[
  {
    "hadithnumber": 1559,
    "english_text": "Yahya related to me from Malik that Ibn Shihab and also Urwa ibn az-Zubayr said the same as Said ibn al-Musayyab said about a woman. Her blood-money from a man is the same up to a third of the blood-money of a man. If what she is owed exceeds a third of the blood-money of the man, she is given up to half of the blood-money of a man. Malik said, \"The explanation of that is that she has blood-money for a head wound that lays bare the bone and one that splinters the bone and for what is less than the brain wound and the belly wound and the like of that of those which obliges a third of the blood-money or more. If the amount owed her exceeds that, her blood- money in that is half of the blood-money of a man"
  },
  {
    "hadithnumber": 1561,
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Abu Salama ibn Abd ar-Rahman ibn Awf from Abu Hurayra that a woman from the Hudhayl tribe threw a stone at a woman from the same tribe, and she had a miscarriage. The Messenger of Allah, may Allah bless him and grant him peace, gave a judgement that a slave or slave-girl of fair complexion and excellence should be given to her"
  },
  {
    "hadithnumber": 1562,
    "english_text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab that the Messenger of Allah, may Allah bless him and grant him peace, gave a judgement that the compensation for a foetus killed in its mother's womb was a slave or slave-girl of fair complexion and excellence. The one against whom the judgement was given said, \"Why should I pay damages for that which did not drink or eat or speak or make any cry. The like of that is nothing.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"This is only one of the brothers of the diviners.\" He disapproved of the rhyming speech of the man's declaration"
  },
  {
    "hadithnumber": 1564,
    "english_text": "Yahya related to me from Malik from Ibn Shihab that Said ibn al- Musayyab used to say, \"The full blood-money is payable for cutting off both lips, but when the lower one only is cut off, two-thirds of the blood-money is due for it"
  },
  {
    "hadithnumber": 1568,
    "english_text": "Yahya related to me from Malik from Yahya ibn Said, that Said ibn al-Musayyab said, \"For every piercing wound in any of the organs or limbs of the body, one third of the blood-money of that limb is payable"
  },
  {
    "hadithnumber": 1569,
    "english_text": "Malik related to me, \"Ibn Shihab did not think and nor do I, that there is a generally agreed on way of doing things regarding a piercing wound in any of the organs or limbs of the body, but I think that there is ijtihad in the case. The imam uses ijtihad in it, and there is no generally agreed on way of doing things in our community about it.\" Malik said, \"What is done in our community about the wound to the brain and the wound which splinters the bone, and the wound that bares the bone is that they apply only to the head and face. Whatever of that occurs in the body only has ijtihad in it.\" Malik said, \"I do not think the lower jaw and the nose are part of the head in their injury because they are separate bones, and except for them the head is one bone"
  },
  {
    "hadithnumber": 1570,
    "english_text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman that Abdullah ibn az-Zubayr allowed retaliation for a head wound which splintered the bone"
  },
  {
    "hadithnumber": 1572,
    "english_text": "Yahya related to me from Malik from Zayd ibn Aslam from Muslim ibn Jundub from Aslam, the mawla of Umar ibn al-Khattab that Umar ibn al-Khattab decided on a camel for a molar, a camel for a collar-bone, and a camel for a rib"
  },
  {
    "hadithnumber": 1574,
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn al-Musayyab used to say,' 'When a tooth is struck and becomes black, there is complete blood- money for it. If it falls out after it becomes black, there is also the complete blood-money for it"
  },
  {
    "hadithnumber": 1576,
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa that his father made all the teeth the same in the blood-money and did not prefer any kind over others. Malik said, \"What is done in our community is that the front teeth, molars, and eye-teeth have the same blood-money. That is because the Messenger of Allah, may Allah bless him and grant him peace, said, 'The tooth has five camels.' The molar is one of the teeth and he did not prefer any kind over the others"
  },
  {
    "hadithnumber": 1578,
    "english_text": "Malik related to me that he had heard that Marwan ibn al-Hakam gave a decision about a slave who was injured that the person who injured him had to pay what he had diminished of the value of the slave. Malik said, \"What is done in our community is that for the head wound of a slave that bares the bone, there is a twentieth of his price. The head wound which splinters the bone is three twentieths of his price. Both the wound to the brain and the belly wound are a third of his price. Besides these four, any other types of injury that decrease the price of the slave are considered after the slave is better and well, and one sees what the value of the slave is after his injury and what his value whole was before he had the injury. Then the one who injured him pays the difference between the two values"
  },
  {
    "hadithnumber": 1580,
    "english_text": "Yahya related to me from Malik from Yahya ibn Said that Sulayman ibn Yasar said, \"The blood-money of a magian is eight hundred dirhams.\" Malik said, \"This is what is done in our community.\" Malik said, \"The blood-monies of the jew, christian, and magian in their injuries, is according to the injury of the muslims in their blood-moneys. The head wound is a twentieth of his full blood-money. The wound that opens the head is a third of his blood-money. The belly-wound is a third of his blood-money. All their injuries are according to this calculation"
  },
  {
    "hadithnumber": 1581,
    "english_text": "Yahya related to me from Malik from Hisham ibn Urwa that his father said, \"The tribe is not obliged to pay blood-money for intentional murder. They pay blood-money for accidental killing"
  },
  {
    "hadithnumber": 1582,
    "english_text": "Yahya related to me from Malik that Ibn Shihab said, \"The precedent of the sunna is that the tribe are not liable for any blood- money of an intentional killing unless they wish that.\" Yahya related to me from Malik from Yahya ibn Said the same as that"
  },
  {
    "hadithnumber": 1587,
    "english_text": "Malik said that he had heard that Said ibn al-Musayyab and Sulayman ibn Yasar were asked, \"Does one deal more harshly in taking the blood-money in the sacred month?\" They said, \"No. But it is increased in it because of violating the month.\" It was said to Said, \"Does one increase for the wound as one increases for the life?\" He said, \"Yes.\" Malik added, \"I think that they meant the same as what Umar ibn al-Khattab did with respect to the blood-money of the Mudliji when he struck his son.\" (i.e. giving 120 camels instead of)"
  },
  {
    "hadithnumber": 1594,
    "english_text": "Yahya related to me from Malik that he saw whomever he was satisfied with among the people of knowledge say about a man who willed that his murderer be pardoned when he murdered him intentionally, \"That is permitted for him. He is more entitled to the man's blood than any of his relatives after him.\" Malik said about a man who pardoned murder, after he had claimed his right and it was obliged for him, \"There is no blood-money against the murderer unless the one who pardons him stipulates that when he pardons him.\" Malik said about the murderer when he was pardoned, \"He is flogged one hundred lashes and jailed for a year.\" Malik said, \"When a man murders intentionally and there is a clear proof of that, and the murdered man has sons and daughters and the sons pardon and the daughters refuse to pardon, the pardon of the sons is permitted in opposition to the daughters and there is no authority for the daughters with the sons in demanding blood and pardoning"
  },
  {
    "hadithnumber": 1602,
    "english_text": "Malik related to me that Yahya ibn Said said, \"I heard Abu'l-Hubab Said ibn Yasar say that he heard Abu Hurayra say that he heard the Messenger of Allah, may Allah bless him and grant him peace, say, 'I was ordered to a town which will eat up towns. They used to say, 'Yathrib,' but it is Madina. It removes the bad people like the blacksmith's furnace removes impurities from the iron"
  },
  {
    "hadithnumber": 1603,
    "english_text": "Malik related to me from Hisham ibn Urwa from his father that the Messenger of Allah, may Allah bless him and grant him peace, said, \"No one leaves Madina preferring to live elsewhere, but that Allah will give it better than him in place of him"
  },
  {
    "hadithnumber": 1604,
    "english_text": "Malik related to me from Hisham ibn Urwa from his father from Abdullah ibn az-Zubayr that Sufyan ibn Abi Zuhayr said, \"I heard the Messenger of Allah, may Allah bless him and grant him peace, say, 'Yemen will be conquered and the people will be attracted to it, taking their families and whoever obeys them. Madina would have been better for them, had they but known. Ash-Sham will be conquered and people will be attracted to it, taking their families and whoever obeys them. Madina would have been better for them, had they but known. Iraq will be conquered and people will be attracted to it, taking their families and whoever obeys them. Madina would have been better for them, had they but known"
  },
  {
    "hadithnumber": 1605,
    "english_text": "Yahya related to me from Malik from Ibn Himas from his paternal uncle from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Madina will be left in the best way that it is until a dog or wolf enters it and urinates on one of the pillars of the mosque or on the mimbar.\" They asked, \"Messenger of Allah! Who will have the fruit at that time?\" He replied, \"Animals seeking food, birds and wild beasts"
  },
  {
    "hadithnumber": 1610,
    "english_text": "Yahya related to me from Malik from a man who said, \"Zayd ibn Thabit came across me while I was at al-Aswaf (on the outskirts of Madina). I had captured a hawk. He took it from my hands and set it free"
  },
  {
    "hadithnumber": 1612,
    "english_text": "Malik said that Yahya ibn Said had related to him that A'isha said that Amir ibn Fuhayra had said at the time of the epidemic, \"I have seen death before tasting it, the coward's destination is from above him"
  },
  {
    "hadithnumber": 1615,
    "english_text": "Yahya related to me from Malik from Ibn Shihab that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Two deens shall not co-exist in the Arabian Peninsula.\" Malik said that Ibn Shihab said, ''Umar ibn al-Khattab searched for information about that until he was absolutely convinced that the Messenger of Allah, may Allah bless him and grant him peace, had said, 'Two deens shall not co-exist in the Arabian Peninsula,' and he therefore expelled the jews from Khaybar.\" Malik said, ''Umar ibn al-Khattab expelled the jews from Najran (a jewish settlement in the Yemen) and Fadak (a jewish settlement thirty miles from Madina). When the jews of Khaybar left, they did not take any fruit or land. The jews of Fadak took half the fruit and half the land, because the Messenger of Allah, may Allah bless him and grant him peace, had made a settlement with them for that. So Umar entrusted to them the value in gold, silver, camels, ropes and saddle bags of half the fruit and half the land, and handed the value over to them and expelled them"
  },
  {
    "hadithnumber": 1617,
    "english_text": "Yahya related to me from Malik from Yahya ibn Said from Abd ar- Rahman ibn al-Qasim that Aslam, the mawla of Umar ibn al-Khattab informed him that he had visited Abdullah ibn Ayyash al-Makhzumi. He saw that he had some nabidh with him and he was at that moment on the way to Makka. Aslam said to him, ''Umar ibn al-Khattab loves this drink.\" Abdullah ibn Ayyash therefore carried a great drinking bowl and brought it to Umar ibn al-Khattab and placed it before him. Umar brought it near to him and then raised his head. Umar said, \"This drink is good,\" so he drank some of it and then passed it to a man on his right. When Abdullah turned to go, Umar ibn al-Khattab called him and asked, \"Are you the person who says that Makka is better than Madina?\" Abdullah said, \"I said that it was the Haram of Allah, and His place of security, and His House was in it.\" Umar said, \"I am not saying anything about the House of Allah or His Haram.\" Then Umar repeated \"Are you the person who says that Makka is better than Madina?\" He replied, \"I said that it was the Haram of Allah and His place of security, and His House was in it.\" Umar said, \"I am not saying anything about the House of Allah and His Haram.\" Then Abdullah left"
  },
  {
    "hadithnumber": 1622,
    "english_text": "Yahya related to me that Malik said, \"I heard that Umar ibn al- Khattab said, 'A night in Rukba (a valley near Taif,) is more preferable to me than ten nights in ash-Sham.' \" Malik said, \"He meant to lengthen and preserve their lives because of the severity of the plague in ash-Sham"
  },
  {
    "hadithnumber": 1654,
    "english_text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar wore garments dyed with red earth and dyed with saffron"
  },
  {
    "hadithnumber": 1664,
    "english_text": "Yahya related to me from Malik from Abu Bakr ibn Nafi from his father Nafi, the mawla of Ibn Umar that Safiyya bint Abi Ubayd informed him that Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, said that when the lower garment of women was mentioned to the Messenger of Allah, he said, \"She lets it down a handspan.\" Umm Salama said, \"If it leaves her uncovered?\" He said, \"Then the length of a forearm and let her not increase it"
  },
  {
    "hadithnumber": 1665,
    "english_text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Do not wear one sandal. Wear both of them or go with both feet bare"
  },
  {
    "hadithnumber": 1700,
    "english_text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi Talha that Anas ibn Malik said, \"I saw Umar ibn al-Khattab when he was amir al-muminin being given a sa of dates, and he ate all of them, even the inferior ones"
  },
  {
    "hadithnumber": 1727,
    "english_text": "Malik related to me from Nafi from Ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Fever is from the vehemence of the heat of Jahannam, so put it out with water"
  },
  {
    "hadithnumber": 1753,
    "english_text": "Yahya related to me from Malik from Musa ibn Maysara from Said ibn Abi Hind from Abu Musa al-Ashari that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Whoever plays games of dice has disobeyed Allah and His Messenger"
  },
  {
    "hadithnumber": 1764,
    "english_text": "Malik related to me from a reliable source of his from Bukayr ibn Abdullah ibn al-Ashajj from Basr ibn Said from Abu Said al-Khudri that Abu Musa al-Ashari said, \"The Messenger of Allah, may Allah bless him and grant him peace, said, 'One asks permission three times. If you are given permission, then enter. If not, go away"
  },
  {
    "hadithnumber": 1765,
    "english_text": "Malik related to me from Rabia ibn Abi Abd ar-Rahman from another of the ulama of that time that Abu Musa al-Ashari came and asked permission from Umar ibn al-Khattab to enter. He asked permission three times, and then went away Umar ibn al-Khattab sent after him and said, \"What's wrong with you? Why didn't you come in?\" Abu Musa said, \"I heard the Messenger of Allah, may Allah bless him and grant him peace, say, 'Ask permission to enter three times. If you are given permission, then enter. If not, go away.' ''Umar said, \"Who can confirm this? If you do not bring me someone to confirm it, I will do such-and-such to you.\" Abu Musa went out until he came to an assembly in the mosque which was called the Majlis-al-Ansar. He said, \"I told Umar ibn al-Khattab that I heard the Messenger of Allah, may Allah bless him and grant him peace, say, 'Ask permission three times. If you are given permission, then enter. If not, go away.' Umar said, 'If you do not bring me someone who can confirm it, I will do such- and-such to you'. If any of you have heard that, let him come with me.' \" They said to Abu Said al-Khudri, \"Go with him\". Abu Said was the youngest of them. He went with him and told Umar ibn al-Khattab about that.\" Umar ibn al-Khattab said to Abu Musa, \"I did not suspect you, but I feared lest people forge sayings of the Messenger of Allah, may Allah bless him and grant him peace"
  }
]