[
    {
        "hadithnumber": 7460,
        "english_text": "There is no god but Allah, I attacked him with a spear. It once occurred to me and I talked about it to the Apostle (ﷺ). The Messenger of Allah (ﷺ) said: Did he profess\" There is no god but Allah,\" and even then you killed him? I said: Messenger of Allah, he made a profession of it out of the fear of the weapon. He (the Holy Prophet) observed: Did you tear his heart in order to find out whether it had professed or not? And he went on repeating it to me till I wished I had embraced Islam that day. Sa'd said: By Allah, I would never kill any Muslim so long as a person with a heavy belly, i. e., Usama, would not kill. Upon this a person remarked: Did Allah not say this: And fight them until there is no more mischief and religion is wholly for Allah? Sa'd said: We fought so that there should be no mischief, but you and your companions wish to fight so that there should be mischief."
    },
    {
        "hadithnumber": 7461,
        "english_text": "The Messenger of Allah may peace be upon him) sent us to Huraqat, a tribe of Juhaina. We attacked that tribe early in the morning and defeated them and I and a man from the Ansar caught hold of a person (of the defeated tribe). When we overcame him, he said: There is no god but Allah. At that moment the Ansari spared him, but I attacked him with my spear and killed him. The news had already reached the Apostle (peace be upon him), so when we came back he (the Apostle) said to me: Usama, did you kill him after he had made the profession: There is no god but Allah? I said. Messenger of Allah, he did it only as a shelter. The Prophet observed: Did you kill him after he had made the profession that there is no god but Allah? He (the Holy Prophet) went on repeating this to me till I wished I had not embraced Islam before that day."
    },
    {
        "hadithnumber": 7462,
        "english_text": "Gather some men of your family so that I should talk to them. He ('As'as) sent a messenger to them (to the members of his family). When they had assembled, Jundab came there with a yellow hooded cloak on him, He said: Talk what you were busy in talking. The talk went on by turns, till there came his (Jundab's) turn. He took off the hooded cloak from his head and said: I have come to you with no other intention but to narrate to you a hadith of your Apostle: Verily the Messenger of Allah (ﷺ) sent a squad of the Muslims to a tribe of the polytheists. Both the armies confronted one another. There was a man among the army of polytheists who (was so dashing that), whenever he intended to kill a man from among the Muslims, he killed him. Amongst the Muslims too was a man looking forward to (an opportunity of) his (the polytheist's) unmindfulness. He (the narrator) said: We talked that he was Usama b, Zaid. When he raised his sword, he (the soldier of the polytheists) uttered:\" There is no god but Allah,\" but he (Usama b. Zaid) killed him. When the messenger of the glad tidings came to the Apostle (ﷺ) he asked him (about the events of the battle) and he informed him about the man (Usama) and what he had done He (the Prophet of Allah) called for him and asked him why he had killed him. He (Usama) said: Messenger of Allah, he struck the Muslims and killed such and such of them. And he even named some of them. (He continued): I attacked him and when he saw the sword he said: There is no god but Allah. The Messenger of Allah (ﷺ) said: Did you kill him? He (Usama) replied in the affirmative. He (the Holy Prophet) remarked: What would you do with:\" There is no god but Allah,\" when he would come (before you) on the Day of Judgment? He (Usama) said: Messenger of Allah, beg pardon for me (from your Lord). He (the Holy Prophet) said: What would you do with:\" There is no god but Allah\" when he would come (before you) on the Day of Judgment? He (the Holy Prophet) added nothing to it but kept saying: What would you do with:\" There is no god but Allah,\" when he would come (before you) on the Day of Judgment?"
    },
    {
        "hadithnumber": 7463,
        "english_text": "He who took up arms against us is not of us."
    },
    {
        "hadithnumber": 7513,
        "english_text": "To Allah belongs whatever is in the heavens and whatever is in the earth and whether you disclose that which is in your mind or conceal it, Allah will call you to account according to it. Then He forgives whom He pleases and chastises whom He Pleases; and Allah is over everything Potent\" (ii. 284). the Companions of the Messenger of Allah (ﷺ) felt it hard and severe and they came to the Messenger of Allah (ﷺ) and sat down on their knees and said: Messenger of Allah, we were assigned some duties which were within our power to perform, such as prayer, fasting, struggling (in the cause of Allah), charity. Then this (the above-mentioned) verse was revealed unto you and it is beyond our power to live up to it. The Messenger of Allah (ﷺ) said: Do you intend to say what the people of two books (Jews and Christians) said before you:\" We hear and disobey\"? You should rather say:\" We hear and we obey, (we seek) Thy forgiveness, our Lord! and unto Thee is the return.\" And they said:\" We hear and we obey, (we seek) Thy forgiveness, Our Lord! and unto Thee is the return.\" When the people recited it and it smoothly flowed on their tongues, then Allah revealed immediately afterwards:\" The Apostle believes in that which is sent down unto him from his Lord, and so do the believers. Each one believes in Allah and His Angels and His Books and His Apostles, saying: We differentiate not between any of His Apostles and they say: We hearken and we obey: (we seek) Thy forgiveness, our Lord! and unto Thee is the return\" (ii. 285). When they did that, Allah abrogated this (verse) and the Great, Majestic Allah revealed:\" Allah burdens not a soul beyond its capacity. It gets every good that it earns and it suffers every ill that it earns. Our Lord, punish us not if we forget or make a mistake.\" (The Prophet said: ) Yes, our Lord! do not lay on us a burden as Thou didst lay on those before us. (The Prophet said: ) Yes, our Lord, impose not on us (burdens) which we have not the strength to bear (The Prophet said: ) Yes, and pardon us and grant us protection! and have mercy on us. Thou art our Patron, so grant us victory over the disbelieving people\" (ii. 286). He (the Lord) said: Yes."
    },
    {
        "hadithnumber": 7514,
        "english_text": "When this verse:\" Whether you disclose that which is in your mind or conceal it, Allah will call you to account according to it\" (ii 284), there entered in their minds something (of that fear) such as had never entered their hearts (before). The Apostle (ﷺ) observed: Say: We have heard and obeyed and submitted ourselves. He (the reporter) said: Allah instilled faith in their hearts and He revealed this verse:\" Allah burdens not a soul beyond its capacity. It gets every good that it earns and it suffers every ill that it earns. Our Lord, call us not to account if we forget or make a mistake. He the (Lord) said: I indeed did it. Our Lord! do not lay on us a burden as Thou didst lay on those before us. He (our Lord) said: I indeed did it. And pardon us, have mercy on us. Thou art our Protector\" (ii. 286). He said: I indeed did it."
    },
    {
        "hadithnumber": 7515,
        "english_text": "Verily Allah forgave my people the evil promptings which arise within their hearts as long as they did not speak about them or did not act upon them."
    },
    {
        "hadithnumber": 7516,
        "english_text": "Verily the Great and Mighty Allah forgave my people the evil promptings arising in their minds, but they neither talked about them nor acted upon them."
    },
    {
        "hadithnumber": 7517,
        "english_text": "The same hadith has been narrated by Zuhair b. Harb, Waki, Ishaq b. Mansur, Husain b. 'Ali."
    },
    {
        "hadithnumber": 7518,
        "english_text": "The Great and the Glorious Lord said (to angels): Whenever My bondsman intends to corn it an evil, do not record it against him, but if he actually commits it, then write it as one evil. And when he intends to do good but does not do it, then take it down is one act of goodness, but if he does it, then write down ten good deeds (in his record)."
    },
    {
        "hadithnumber": 7519,
        "english_text": "Allah, the Great and Glorious, said: Whenever my bondsman intends to do good, but does not do it, I write one good act for him, but if he puts it into practice I wrote from ten to seven hundred good deeds in favour of him. When he intends to commit an evil, but does not actually do it, do not record it. But if he does it, I write only one evil."
    },
    {
        "hadithnumber": 7557,
        "english_text": "Verily Islam started as something strange and it would again revert (to its old position) of being strange just as it started, and it would recede between the two mosques just as the serpent crawls back into its hole."
    }
]