[
    {
        "hadithnumber": 6144,
        "english_text": "This hadith has been narrated on the authority of 'A'isha through another chain of transmitters."
    },
    {
        "hadithnumber": 5637,
        "english_text": "This hadith has been transmitted on the authority of 'Abdullah b. Harith with a slight variation of wording."
    },
    {
        "hadithnumber": 6701,
        "english_text": "Should I not direct you to the words from the treasures of Paradise, or he said: Like a treasure from the treasures of Paradise? I said: Of course, do that. Thereupon he said:\" There is no might and no power but that of Allah.\""
    },
    {
        "hadithnumber": 6702,
        "english_text": "Teach me a supplication which I should recite in my prayer. Thereupon he (the Holy Prophet) said: Recite:\" O Allah, I have done great wrong to myself.\" According to Qutaiba (the words were: ) much (wrong) -there is none to forgive the sins but Thou only, say:\" Grant me pardon from Thyself, have mercy upon me for Thou art much Forgiving and Compassionate.\""
    },
    {
        "hadithnumber": 7256,
        "english_text": "O Allah, make for the family of Muhammad the provision which is a bare subsistence."
    },
    {
        "hadithnumber": 92,
        "english_text": "The summit of unbelief is towards the East and the pride and conceitedness is found among the owners of horses and camels who are rude and uncivil, people of the tents, and tranquillity is found among those who rear goats and sheep."
    },
    {
        "hadithnumber": 5214,
        "english_text": "\" The best condiment.\" And he did not doubt (about this word)."
    },
    {
        "hadithnumber": 1648,
        "english_text": "Make Witr the end of your night prayer."
    },
    {
        "hadithnumber": 637,
        "english_text": "I and the Messenger of Allah (ﷺ) took a bath from one vessel which was placed between me and him and he would get ahead of me, so that I would say: Spare (some water for) me, spare (some water for) me; and she said that they had had sexual intercourse."
    },
    {
        "hadithnumber": 638,
        "english_text": "Maimuna (the wife of the Holy Prophet) reported to me that she and the Messenger of Allah (ﷺ) took a bath from one vessel."
    },
    {
        "hadithnumber": 128,
        "english_text": "Abu Bakr b. Abu Shaiba narrated a hadith like this from the Apostle (may peace and blessings be upon him) on the authority of Abdullah."
    },
    {
        "hadithnumber": 7301,
        "english_text": "So and so sneezed and you said: May Allah have mercy upon you. I also sneezed but you did not utter these words for me. Thereupon he (the Holy Prophet) said: That person praised Allah, and you did not praise Allah."
    },
    {
        "hadithnumber": 6792,
        "english_text": "I used to conceal from you a thing which I heard from Allah's Messenger (ﷺ) and I heard Allah's Messenger (ﷺ) as saying: Had you not committed sins, Allah would have brought into existence a creation that would have committed sin (and Allah) would have forgiven them."
    },
    {
        "hadithnumber": 7325,
        "english_text": "There lived a king before you and he had a (court) magician. As he (the magician) grew old, he said to the king: I have grown old, send some young boy to me so that I should teach him magic. He (the king) sent to him a young man so that he should train him (in magic). And on his way (to the magician) he (the young man) found a monk sitting there. He (the young man) listened to his (the monk's) talk and was impressed by it. It became his habit that on his way to the magician he met the monk and set there and he came to the magician (late). He (the magician) beat him because of delay. He made a complaint of that to the monk and he said to him: When you feel afraid of the magician, say: Members of my family had detained me. And when you feel afraid of your family you should say: The magician had detained me. It so happened that there came a huge beast (of prey) and it blocked the way of the people, and he (the young boy) said: I will come to know today whether the magician is superior or the monk is superior. He picked up a stone and said: O Allah, if the affair of the monk is dearer to Thee than the affair of the magician, cause death to this animal so that the people should be able to move about freely. He threw that stone towards it and killed it and the people began to move about (on the path freely). He (the young man) then came to that monk and Informed him and the monk said: Sonny, today you are superior to me. Your affair has come to a stage where I find that you would be soon put to a trial, and in case you are put to a trial don't give my clue. That young man began to treat the blind and those suffering from leprosy and he in fact began to cure people from (all kinds) of illness. When a companion of the king who had gone blind heard about him, he came to him with numerous gifts and said: If you cure me all these things collected together here would be yours. Be said: I myself do not cure anyone. It is Allah Who cures and if you affirm faith in Allah, I shall also supplicate Allah to cure you. \nHe affirmed his faith in Allah and Allah cured him and he came to the king and sat by his side as he used to sit before. The king said to him: Who restored your eyesight? He said: My Lord. Thereupon he said: It means that your Lord is One besides me. He said: My Lord and your Lord is Allah, so he (the king) took hold of him and tormented him till he gave a clue of that boy. The young man was thus summoned and the king said to him: O boy, it has been conveyed to me that you have become so much proficient in your magic that you cure the blind and those suffering from leprosy and you do such and such things. Thereupon he said: I do not cure anyone; it is Allah Who cures, and he (the king) took hold of him and began to torment him. So he gave a clue of the monk. The monk was thus summoned and it was said to him: You should turn back from your religion. He, however, refused to do so. He (ordered) for a saw to be brought (and when it was done) he (the king) placed it in the middle of his head and tore it into parts till a part fell down. Then the courtier of the king was brought and it was said to him: Turn back from your religion. Arid he refused to do so, and the saw was placed in the midst of his head and it was torn till a part fell down. Then that young boy was brought and it was said to him: Turn back from your religion. He refused to do so and he was handed over to a group of his courtiers. And he 'said to them: Take him to such and such mountain; make him climb up that mountain and when you reach its top (ask him to renounce his faith) but if he refuses to do so, then throw him (down the mountain). So they took him and made him climb up the mountain and he said: O Allah, save me from them (in any way) Thou likest and the mountain began to quake and they all fell down and that person came walking to the king. The king said to him: What has happened to your companions? He said: Allah has saved me from them. He again handed him to some of his courtiers and said: Take him and carry him in a small boat and when you reach the middle of the ocean (ask him to renounce) his religion, but if he does not renounce his religion throw him (into the water). \nSo they took him and he said: O Allah, save me from them and what they want to do. It was quite soon that the boat turned over and they were drowned and he came walking to the king, and the king said to him: What has happened to your companions? He said: Allah has saved me from them, and he said to the king: You cannot kill me until you do what I ask you to do. And he said: What is that? He said: You should gather people in a plain and hang me by the trunk (of a tree). Then take hold of an arrow from the quiver and say: In the name of Allah, the Lord of the young boy; then shoot an arrow and if you do that then you would be able to kill me. So he (the king) called the people in an open plain and tied him (the boy) to the trunk of a tree, then he took hold of an arrow from his quiver and then placed the arrow in the bow and then said: In the name of Allah, the Lord of the young boy; he then shot an arrow and it bit his temple. He (the boy) placed his hands upon the temple where the arrow had bit him and he died and the people said: We affirm our faith in the Lord of this young man, we affirm our faith in the Lord of this young man, we affirm our faith in the Lord of this young man. The courtiers came to the king and it was said to him: Do you see that Allah has actually done what you aimed at averting. They (the people) have affirmed their faith in the Lord. He (the king) commanded ditches to be dug at important points in the path. When these ditches were dug, and the fire was lit in them it was said (to the people): He who would not turn back from his (boy's) religion would be thrown in the fire or it would be said to them to jump in that. (The people courted death but did not renounce religion) till a woman came with her child and she felt hesitant in jumping into the fire and the child said to her: 0 mother, endure (this ordeal) for it is the Truth."
    },
    {
        "hadithnumber": 7329,
        "english_text": "This is what Abu Huraira reported to us from Allah's Messenger (ﷺ) and in this connection he narrated some of the ahadith and Allah's Messenger (ﷺ) said: It was said to people of Israel: Enter this land saying Hitta (Remove Thou from us the burden of our sins), whereupon We would forgive you your sins, but they twisted (this statement) and entered the gate dragging upon their breech and said: The\" grain in the ear.\""
    },
    {
        "hadithnumber": 7330,
        "english_text": "Anas b. Malik reported that Allah, the Exalted and Glorious, sent revelation to Allah's Messenger (ﷺ) just before his death in quick succession until he left for his heavenly home, and the day when he died, he received the revelation profusely."
    },
    {
        "hadithnumber": 7331,
        "english_text": "You recite a verse which, if it had been revealed in relation to us, we would have taken that day as the day of rejoicing. Thereupon 'Umar said: I know where it was revealed and on the day when it was revealed and where Allah's Messenger (ﷺ) had been at that time when it was revealed. It was revealed on the day of 'Arafa (ninth of Dhu'l Hijjah) and Allah's Messenger (ﷺ) had been staying in 'Arafat. Sufyan said: I doubt, whether it was Friday or not (and the verse referred to) is this:\" Today I have perfected your religion for you and completed My favours upon you\" (v. 4)."
    },
    {
        "hadithnumber": 7332,
        "english_text": "If this verse were revealed in relation to the Jews (i e. \"This day I have perfected your religion for you and have completed My favours for you and have chosen for you al-Islam as religion\") we would have taken the day of rejoicing on which this verse was revealed. Thereupon 'Umar said: I know the day on which it was revealed and the hour when it was revealed and where Allah's Messenger (ﷺ) had been when it was revealed. It was revealed on the night of Friday and we were in 'Arafat with Allah's Messenger (ﷺ) at that time."
    },
    {
        "hadithnumber": 7333,
        "english_text": "Commander of the Faithful, there is a verse in your Book, which you recite. Had it been revealed in connection with the Jews, we would have taken it as the day of rejoicing. Thereupon he said: Which verse do you mean? He replied:\" This day I have perfected your religion for you and I have completed My favours upon you and I have chosen al-Islam as religion for you.\" Umar said, I know the day when it was revealed and the place where it was revealed. It was revealed to Allah's Messenger (ﷺ) at 'Arafat on Friday."
    },
    {
        "hadithnumber": 7334,
        "english_text": "\" If you fear that you will not be able to maintain equity amongst the orphan girls, then marry (those) you like from amongst the women two, three or four.\" She said: O, the son of my sister, the orphan girl is one who is under the patronage of her guardian and she shares with him in his property and her property and beauty fascinate him and her guardian makes up his mind to marry her without giving her due share of the wedding money and is not prepared (to pay so much amount) which anyone else is prepared to pay and so Allah has forbidden to marry these girls but in case when equity is observed as regards the wedding money and they are prepared to pay them the full amount of the wedding money and Allah commanded to marry other women besides them according to the liking of their heart. 'Urwa reported that 'A'isha said that people began to seek verdict from Allah's Messenger (ﷺ) after the revelation of this verse about them (orphan girls) and Allah, the Exalted and Glorious, revealed this verse:\" They asked thee verdict about women; say: Allah gives verdict to you in regard to them and what is recited to you in the Book about orphan woman, whom you give not what is ordained for them while you like to marry them\" (iv. 126). She said: The wording of Allah\" what is recited to you\" in the Book means the first verse, i. e.\" if you fear that you may not be able to observe equity in case of an orphan woman, marry what you like in case of woman\" (iv. 3). 'A'isha said: (And as for this verse , i. e. and you intend\" to marry one of them from amongst the orphan girls\" it pertains to one who is in charge (of orphans) having small amount of wealth and less beauty and they have been forbidden that they should marry what they like of her wealth and beauty out of the orphan girls, but with equity, because of their disliking for them."
    },
    {
        "hadithnumber": 7335,
        "english_text": "\" If you fear that you will not be able to observe equity in case of orphan girls\" ; the rest of the hadith is the same but with a slight variation of wording."
    },
    {
        "hadithnumber": 7336,
        "english_text": "\" If you fear that you would not be able to observe equity in case of orphan girls),\" it was revealed in reference to a person who had an orphan girl (as his ward) and he was her guardian, and her heir, and she possessed property, but there was none to contend on her behalf except her ownself. And he (her guardian) did not give her in marriage because of her property and he tortured her and ill-treated her, it was in relation to her that (Allah said: )\" If you fear that you would not be able to observe equity in case of orphan girls, then marry whom you like among women,\" i. e. whatever I have made lawful for you and leave her whom you are putting to torture."
    },
    {
        "hadithnumber": 7337,
        "english_text": "\" What is recited to you in the Book about orphan women whom you give not what is ordained for them, while you like to marry them,\" these were revealed in connection with an orphan girl who was in the charge of the person and she shared with him in his property and he was reluctant to marry her himself and was also unwilling to marry her to someone else (fearing) that (that person) would share in his property (as the husband of that girl), preventing her to marry, neither marrying her himself nor marrying her to another person."
    },
    {
        "hadithnumber": 7338,
        "english_text": "\" They ask thee the religious verdict about women, say: Allah gives you the verdict about them\" (iv. 126), that these relate to an orphan girl who is in charge of the person and she shares with him in his property (as a heir) even in the date-palm trees and he is reluctant to give her hand in marriage to any other person lest he (her husband) should partake of his property, and thus keep her in a lingering state."
    },
    {
        "hadithnumber": 7339,
        "english_text": "\" And whoever is poor let him take reasonably (out of it)\" that it was revealed in connection with the custodian of the property of an orphan, who is in charge of her and looks after her; In case he is poor, he is allowed to eat out of that."
    },
    {
        "hadithnumber": 7340,
        "english_text": "\" He who is rich should abstain, and he who is poor may reasonably eat (out of it)\" that this was revealed in relation to the guardian of an orphan who is poor; he may get out of that what is reasonable keeping in view his own status of solvency."
    },
    {
        "hadithnumber": 7341,
        "english_text": "This hadith has been narrated on the authority of Hisham with the same chain of transmitters."
    },
    {
        "hadithnumber": 7342,
        "english_text": "\" When they came upon you from above you and from below you and when the eyes turned dull and the hearts rose up to the throats\" (xxxiii. 10) pertain to the day of Ditch."
    },
    {
        "hadithnumber": 7343,
        "english_text": "\" And if a woman has reason to fear ill-treatment from her husband or that he might turn away from her\" (iv. 128) that it was revealed in case of a woman who had long association with a person (as his wife) and now he intends to divorce her and she says: Do not divorce me, but retain me (as wife in your house) and you are permitted to live with another wife. It is in this context that this verse was revealed."
    },
    {
        "hadithnumber": 1719,
        "english_text": "O people, perform such acts as you are capable of doing, for Allah does not grow weary but you will get tired. The acts most pleasing to Allah are those which are done continuously, even if they are small. And it was the habit of the members of Muhammad's (ﷺ) household that whenever they did an act they did it continuously."
    },
    {
        "hadithnumber": 6844,
        "english_text": "When Allah's Messenger (may. peace be upon him) intended to set on an expedition he kept It as a secret, but. be did not do so in thic. expedition. And in the narration transmitted on the authority of Muhammad b. Abdullah b. Muslim, there is no mention of Abu Khaithana (Allah be pleased with him) and no mention of his meeting with Allah's Messenger (ﷺ)."
    },
    {
        "hadithnumber": 6845,
        "english_text": "I heard my father Ka'b b. Malik, and he fas one of those three whose repentance was accepted (by Allah). He transmitted that He never lagged behind Allah's Messenger (ﷺ) from any expedition that he undertook except two expeditions; the rest of the hadith is the same, and in the tradition narrated through another chain of transmitters the words are:\" That Allah's Messenger (ﷺ) set out on an expedition with a large number of persons more than ten thousand and this could not be recorded in the census register.\""
    },
    {
        "hadithnumber": 3262,
        "english_text": "Do not undertake a journey to visit any Mosque, but three: this Mosque of mine, the Mosque of al-Haram and the Mosque of Aqsa (Bait al-Maqdis)."
    },
    {
        "hadithnumber": 1221,
        "english_text": "There came to me two old women from the old Jewesses of Medina and said: The people of the grave are tormented in their graves. I contradicted them and I did not deem it proper to testify them. They went away and the Messenger of Allah (ﷺ) came to me and I said to him: Messenger of Allah I there came to me two old women from the old Jewesses of Medina and asserted that the people of the graves would be tormented therein. He (the Prophet) said: They told the truth; they would be tormented (so much) that the animals would listen to it. She ('A'isha) said: Never did I see him (the Holy Prophet) afterwards but seeking refuge from the torment of the grave in prayer."
    },
    {
        "hadithnumber": 1222,
        "english_text": "Never did he (the Holy Prophet) say prayer after this in which I did not hear him seeking refuge from the torment of the grave."
    },
    {
        "hadithnumber": 7371,
        "english_text": "‘Whoever lies upon me intentionally, then let him take his seat in the Fire’."
    },
    {
        "hadithnumber": 209,
        "english_text": "None is obliged to give votive offering (of a thing) which is not in his possession and the cursing of a believer is tantamount to killing him, and he who killed himself with a thing in this world would be tormented with that (very thing) on the Day of Resurrection, and he who made a false claim to increase (his wealth), Allah would make no addition but that of paucity, and he who perjured would earn the wrath of God"
    },
    {
        "hadithnumber": 1251,
        "english_text": "This hadith has been narrated by Abu Huraira by another chain of transmitters."
    },
    {
        "hadithnumber": 1778,
        "english_text": "Is any one of you incapable of reciting a third of the Qur'an in a night? They (the Companions) asked: How could one recite a third of the Qur'an (in a night)? Upon this he (the Holy Prophet) said: \"'Say: He is Allah, One' (Qur'an. cxii) is equivalent to a third of the Qur'an.\""
    },
    {
        "hadithnumber": 2295,
        "english_text": "The heart of an old person is young for two things: for long life and love for wealth."
    },
    {
        "hadithnumber": 248,
        "english_text": "The same hadith has been transmitted by Muhammad b. 'Amr, Abu Baker b. Ishaq, Abu'l-Jawwab, A'mash and Abu Huraira."
    },
    {
        "hadithnumber": 2810,
        "english_text": "Messenger of Allah. the people return (from Mecca) having done two worships (both Hajj and Umra), but I am coming back with one (only). whereupon he said: You should wait and when the period of menses is over, you should go to Tan'im and put on lhram and then meet us at such and such time (and I think he said tomorrow) ; and (the reward of this Umra) is for you equal to your hardship or your spending."
    },
    {
        "hadithnumber": 3836,
        "english_text": "I will allow you to continue here, so long as we would desire. The rest of the hadith is the same, but with this addition:\" The fruit would be distributed equal to the half of Khaibar. And out of hall of the produce of the land, Allah's Apostle (may peace be be upon him) got the fifth part.\""
    },
    {
        "hadithnumber": 3845,
        "english_text": "Who planted this palm-a Muslim or an unbelievers The rest of the hadith is the same."
    },
    {
        "hadithnumber": 5384,
        "english_text": "The most grievous torfnent for the people on the Day of Resurrection would be for those who try to imitate Allah in the act of creation."
    },
    {
        "hadithnumber": 5393,
        "english_text": "I took it and prepared two cushions out of that and he (the Holy Prophet) used to recline against them in the house."
    },
    {
        "hadithnumber": 7447,
        "english_text": "‘Write from Baqiyyah what he transmits on authority of those who are well-known, and do not write from him what he transmits on authority of those who are not; do not write from Ismā’īl bin Ayyāsh what he transmits on authority of those who are well-known or otherwise ’."
    },
    {
        "hadithnumber": 7448,
        "english_text": "‘What an excellent man is Baqiyyah, if it were not for the fact that he would provide a nickname for  he was Abd ul-Quddūs ’."
    },
    {
        "hadithnumber": 7449,
        "english_text": "‘I did not see Ibn al-Mubārak express so plainly the charge of ‘lying’ except towards Abd ul-Quddūs; for indeed I heard him saying to him ‘ a liar’.’"
    },
    {
        "hadithnumber": 794,
        "english_text": "'Umar b. al-Khattab used to recite loudly these words: Subhanak Allahumma wa bi hamdika wa tabarakasmuka wa ta'ala jadduka wa la ilaha ghairuka  and did not recite Bismillah ir- Rahman-ir-Rahim (loudly) at the beginning of the recitation or at the end of it."
    },
    {
        "hadithnumber": 7450,
        "english_text": "‘I heard Abū Nu’aym and he mentioned al-Mu’allā bin Urfān, so"
    },
    {
        "hadithnumber": 7451,
        "english_text": "‘We were near Ismā’īl bin Ulayyah, and a man narrated on authority of another man, so I said: ‘Indeed this is not reliable (Thabt)’. So the man said: ‘Are you backbiting him?’ Ismā’īl said: ‘He is not backbiting him; rather he is judging him unreliable’."
    },
    {
        "hadithnumber": 7452,
        "english_text": "‘I asked Mālik bin Anas about Muhammad bin Abd ar-Rahman who transmits on authority of Sa’īd bin al-Musayyib, so he said: ‘He is not trustworthy ‘. I asked him about Sālih, a freed slave of at-Taw’amah, then he said: ‘He is not trustworthy’. I asked him about Abūl-Huwayrith , and he said: ‘He is not trustworthy’. I asked him about Shu’bah on whose authority Ibn Abī Dhi’b transmitted, and he said: ‘He is not trustworthy’. I asked him about Harām bin Uthmān , and he said ‘He is not trustworthy’. I asked Mālik about these five and he said: ‘They are not trustworthy in terms of their Ḥadīth’. I asked him about another man whose name I forget just now, and he said: ‘Did you see him in my book?’ I said: ‘No’.  he said: ‘If he was trustworthy you would see him in my book’."
    },
    {
        "hadithnumber": 7453,
        "english_text": "‘Yahyā bin Ma’īn narrated to me, Hajjāj narrated to us, Ibn Abī Dhi’b narrated to us on authority of Shurahbīl bin Sa’d , and he was imputed ’."
    },
    {
        "hadithnumber": 7455,
        "english_text": "‘Do not take  from my brother ’."
    },
    {
        "hadithnumber": 7456,
        "english_text": "‘Yahyā bin Abī Unaysah was a liar’."
    },
    {
        "hadithnumber": 7457,
        "english_text": "‘Indeed Farqad is not a companion of Ḥadīth’."
    },
    {
        "hadithnumber": 7458,
        "english_text": "‘More weak than Ya’qūb bin Atā ’?’ He said: ‘Yes’. Then he said: ‘I did not see anyone transmitting on authority of Muhammad bin Abd Allah bin Ubayd bin Umayr’."
    },
    {
        "hadithnumber": 7459,
        "english_text": "‘His Ḥadīth are Rīh or ‘wind’  - do not write the Ḥadīth of Ubaydah bin Mu’attib, as-Sarī bin Ismā’īl, or Muhammad bin Sālim’.’"
    },
    {
        "hadithnumber": 7454,
        "english_text": "‘If I had to choose between entering Paradise and meeting Abd Allah bin Muharrar, I would have chosen to meet him, then enter Paradise. Then when I saw him, dung was more preferred to me than him’."
    },
    {
        "hadithnumber": 2339,
        "english_text": "Did you hear the Messenger of Allah (ﷺ) making a mention of them? He (Abu Sai'd al-Khudri) said: I don't know who the Haruriya are, but I heard the Messenger of Allah (ﷺ) as saying: There would arise in this nation (and he did not say\" out of them\" ) a people and you would hold insignificant your prayers as compared with their prayers. And they would recite the Qur'an which would not go beyond their throats and would swerve through the religion (as blank) just as a (swift) arrow passes through the prey. The archer looks at his arrow, at its iron head and glances at its end (which he held) in the tip of his fingers to see whether it had any stain of blood."
    },
    {
        "hadithnumber": 1332,
        "english_text": "He who said prayer before the rising of the sun and its setting would not enter the fire (of Hell), and there was a man from Basra (sitting) beside him who said: Did you hear it from the Messenger of Allah (way peace be upon him)? He said: Yes, I bear witness to it. The man from Basra said: I bear witness that I did hear from the Messenger of Allah (ﷺ) saying it from the place that you heard from him."
    },
    {
        "hadithnumber": 1351,
        "english_text": "The Messenger of Allah (ﷺ) said: Let the bedouin not gain upper band over you In regard to the name of your prayer, i. e. night prayer, for it is mentioned 'Isya' in the Book of Allah (i. e. the Qur'an). (The bedouin call it 'Atama because) they make delay in milling their she-camels."
    },
    {
        "hadithnumber": 1355,
        "english_text": "When Hajjaj came to Medina we asked Jabir b. Abdullah (about the timings of prayer as observed by the Holy Prophet). He said: The Messenger of Allah (ﷺ) used to pray afternoon prayer in the midday heat; the afternoon prayer when the sun was bright; the evening prayer when the sun had completely set; and as for the night prayer, he sometimes delayed and sometimes (observed it) at earlier hours. When he found them (his Companions) assembled (at earlier hours) he (prayed) early. and when he saw them coming late, he delayed the (prayer). and the morning prayer the Messenger of Allah (ﷺ) observed in the darkness before dawn."
    },
    {
        "hadithnumber": 2381,
        "english_text": "\" When (the month of) Ramadan begins.\""
    },
    {
        "hadithnumber": 852,
        "english_text": "\" Abu Bakr lifted his hands and praised Allah and retraced his (steps) till he stood in a row.\""
    },
    {
        "hadithnumber": 853,
        "english_text": "The Apostle of Allah (ﷺ) went to Bani Amr b. 'Auf in order to bring about reconciliation amongst them. The rest of the hadith is the same but with (the addition of these words):\" The Messenger of Allah (ﷺ) came and made his way through the rows till he came to the first row and Abu Bakr retraced his steps.\""
    },
    {
        "hadithnumber": 1366,
        "english_text": "I said to 'Abdullah b. Samit: We say our Jumu'a prayer behind those rulers who defer the prayer. He ('Abdullah b. Samit), struck. my thigh that I felt pain and said: I asked Abu Dharr about it, he struck my thigh and said: I asked the Messenger of Allah (ﷺ) about it. Upon this he said: Observe prayer at its prescribed time, and treat prayer along with them (along with those Imams who deter prayer) as Nafl. 'Abdullah said: It was narrated to me that the Messenger of Allah (ﷺ) struck the thigh of Abd Dharr."
    },
    {
        "hadithnumber": 4436,
        "english_text": "We accompanied the Messenger of Allah (my peace be upon him) on an expedition in the year of the Battle of Hunain. When we encountered the enemy, (some of the Muslims turned back (in fear). I saw that a man from the polytheists overpowered one of the Muslims. I turned round and attacked him from behind giving a blow between his neck and shoulder. He turned towards me and grappled with me in such a way that I began to see death staring me in the face. Then death overtook him and left me alone. I joined 'Umar b. al-Khattab who was saying: What has happened to the people (that they are retreating)? I said: It is the Decree of Allah. Then the people returned. (The battle ended in a victory for the Muslims) and the Messenger of Allah (ﷺ) sat down (to distribute the spoils of war). He said: One who has killed an enemy and can bring evidence to prove it will get his belongings. So I stood up and said: Who will give evidence for me? Then I sat down. Then he (the Holy Prophet) said like this. I stood up (again) and said: Who will bear witness for me? He (the Holy Prophet) made the same observation the third time, and I stood up (once again). Now the Messenger of Allah (ﷺ) said: What has happened to you, O Abu Qatada? Then I related the (whole) story, to him. At this, one of the people said: He has told the truth. Messenger of Allah 1 The belongings of the enemy killed by him are with me. Persuade him to forgo his right (in my favour). (Objecting to this proposal) Abu Bakr said: BY Allah, this will not happen. The Messenger of Allah (ﷺ) will not like to deprive one of the lions from among the lions of Allah who fight in the cause of Allah and His Messenger and give thee his share of the booty. So the Messenger of Allah (may peace he upon him) said: He (Abu Bakr) has told the truth, and so give the belongings to him (Abu Qatada). So he gave them to me. I sold the armour (which was a part of my share of the booty) and bought with the sale proceeds a garden in the street of Banu Salama. This was the first property I acquired after embracing Islam. \nIn a version of the hadith narrated by Laith, the words uttered by Abu Bakr are:\" No, never! He will not give it to a fox from the Quraish leaving aside a lion from the lions of Allah among....\" And the hadith is closed with the words:\" The first property I acquired.\""
    },
    {
        "hadithnumber": 7016,
        "english_text": "If you survive for a time you would certainly see people who would have whips in their hands like the tail of an ox. They would get up in the morning under the wrath of Allah and they would get into the evening with the anger of Allah."
    },
    {
        "hadithnumber": 5995,
        "english_text": "While a Jew was selling goods, he was given something which he did not accept or he did not agree (to accept) that 'Abdul 'Azlz (one of the narrators) is doubtful about it. He (the Jew) said: By Allah, Who chose Moses (peace be upon him) among mankind. A person from the Ansar heard it and gave a blow at his face saying: (You have the audacity) to say: By Him Who chose Moses amongst mankind, whereas Allah's Messenger (ﷺ) is living amongst us. The Jew went to Allah's Messenger (ﷺ) and said: Abu'l-Qasim, I am a Dhimmi and (thus need your protection) by a covenant, and added: Such and such person has given a blow upon my face. Thereupon Allah's Messenger (ﷺ) said: Why did you give a blow on his face? He said: Allah's Messenger, this man said: By Him Who chose Moses (peace be upon him) amongst mankind, whereas you are living amongst us. Allah's Messenger (ﷺ) became angry and signs of anger could be seen on his face, and then said: Don't make distinction amongst the Prophets of Allah. When the horn will be blown and whatever is in the heavens and the earth would swoon but he whom Allah grants exception, then another horn will be blown and I would be the first amongst those who would recover and Moses (peace be upon him) would be catching hold of the Throne and I do not know whether it is a compensation for that when he swooned on the Day of Tur or he would be resurrected before me and I do not say that anyone is more excellent than Yunus son of Matta (peace he upon him)."
    },
    {
        "hadithnumber": 5996,
        "english_text": "This hadith has been narrated on the authority of Abu Salama with the same chain of transmitters."
    },
    {
        "hadithnumber": 5997,
        "english_text": "By Him Who chose Muhammad (ﷺ) in the worlds. And the Jew said: By Him Who chose Moses in the worlds. Thereupon the Muslim lifted his hand and slapped at the face of the Jew. The Jew went to Allah's Messenger (ﷺ) and told him about his affair and the affair of the Muslim. Thereupon Allah's Messenger (ﷺ) said: Don't make me superior to Moses for mankind will swoon and I would be the first to recover from it and Moses would be at that time seizing the side of the Throne and I do not know (whether) he would swoon and would recover before me or Allah would make an exception for him."
    },
    {
        "hadithnumber": 5998,
        "english_text": "A person from amongst the Muslims and a person from amongst the Jews fell into dispute and reviled each other. The rest of the hadith is the same."
    },
    {
        "hadithnumber": 5999,
        "english_text": "That he (the Holy Prophet) said: I do not know whether he would be one who would fall into swoon and would recover before me or he would be compensated for his swooning at Tur (and thus he would not swoon on this occasion) of Resurrection."
    },
    {
        "hadithnumber": 6000,
        "english_text": "Don't make distinction amongst the Apostles. This hadith has been narrated through another chain of transmitters also."
    },
    {
        "hadithnumber": 881,
        "english_text": "The Messenger of Allah (may peace-be upon him) used to straighten our rows as it lie were straightening an arrow with their help until be saw that we had learnt it from him. One day he came out, stood up (for prayer) and was about to say: Allah is the Greatest, when he saw a man, whose chest was bulging out from the row, so he said: Servants of Allah, you hint straighten your rows or Allah would create dissension amongst you."
    },
    {
        "hadithnumber": 6001,
        "english_text": "I came. And in the narration transmitted on the authority of Haddib (the words are): I happened to pass by Moses on the occasion of the Night journey near the red mound (and found him) saying his prayer in his grave."
    },
    {
        "hadithnumber": 6002,
        "english_text": "I happened to pass by Moses as he was busy in saying prayer in his grave, and in the hadith transmitted on the authority of 'Isa there is an addition of these words:, I happened to pass on the occasion of the Night journey.\""
    },
    {
        "hadithnumber": 6003,
        "english_text": "It is not meet for a servant of Mine that he should say: I am better than Yunus b. Matta (peace be upon him)."
    },
    {
        "hadithnumber": 7020,
        "english_text": "This hadith has been narrated on the authority of Hatim b. Abi Saghira with the same chain of transmitters and there is no mention of the word\" uncircum- cised.\""
    },
    {
        "hadithnumber": 6527,
        "english_text": "Allah's Apostle (ﷺ) said to me: Don't consider anything insignificant out of good things even if it is that you meet your brother with a cheerful countenance."
    },
    {
        "hadithnumber": 384,
        "english_text": "Verily the Apostle (ﷺ) said: He who professed: There is no god but Allah, would be brought out of the Fire even though he has in his heart virtue equal to the weight of a barley grain. Then he who professed: There is no god but Allah, would come out of the Fire, even though he has in his heart virtue equal to the weight of a wheat grain. He would then bring out from the Fire he who professed: There is no god but Allah, even though he has in his heart virtue equal to the weight of an atom. Ibn Minhal has made an addition (of these words) in his narration: Yazid said: I met Shu'ba and narrated to him this hadith. Shu'ba said: Qatada transmitted to us this hadith from Anas b. Malik who heard it from the Messenger of Allah (ﷺ) with this alteration that he substituted the word Zurra (grain) in place of Zarra (atom). Yazid said: Abu Bistam has made a change in it."
    },
    {
        "hadithnumber": 6528,
        "english_text": "Make a recommendation for him, and you would get the reward. Allah, however, gives the verdict through the tongue of His Apostle what He likes most."
    },
    {
        "hadithnumber": 6529,
        "english_text": "The similitude of good company and that of bad company is that of the owner of musk and of the one (iron-smith) blowing bellows, and the owner of musk would either offer you free of charge or you would buy it from him or you would. smell its pleasant odour, and so far as one who blows the. bellows is concerned, he would either burn your clothes or you shall have to smell its repugnant smell."
    },
    {
        "hadithnumber": 388,
        "english_text": "Allah, the Blessed and Exalted, would gather people. The believers would stand till the Paradise would be brought near them. They would come to Adam and say: O our father, open for us the Paradise. He would say: What turned ye out from the Paradise was the sin of your father Adam. I am not in a position to do that; better go to my son Ibrahim, the Friend of Allah. He (the Holy Prophet) said: He (Ibrahim) would say: I am not in a position to do that. Verily I had been the Friend (of Allah) from beyond, beyond; you better approach Moses (peace be upon him) with whom Allah conversed. They would come to Moses (peace be upon him), but he would say: I am not in a position to do that; you better go to Jesus, the Word of Allah and His Spirit. Jesus (peace be upon him) would say: I am not in a position to do that. So they would come to Muhammad (ﷺ). He would then be permitted (to open the door of Paradise). Trustworthiness and kinship would be despatched, and these would stand on the right and left of the Path and the first of you would pass with (the swiftness) of lightning. He (the narrator) said: I said, O thou who art far dearer to me than my father and my mother I which thing is like the passing of lightning? He said: Have you not seen lightning, how it passes and then comes back within the twinkling of an eye? Then (they would pass) like the passing of the wind, then like the passing of a bird, and the hastening of persons would be according to their deeds, and your Apostle would be standing on the Path saying: Save, O my Lord, save. (The people would go on passing) till the deeds of the servants would be failing in strength, till a man would come who would find it hard to go along (that Path) but crawlingly. He (the narrator) said: And on the sides of the Path hooks would be suspended ready to catch anyone whom these would be required (to catch). There would be those who would somehow or other succeed in trasversing that Path and some would be piled up in Hell. By Him in Whose Hand is the life of Abu Huraira it would take one seventy years to fathom the depth of Hell."
    },
    {
        "hadithnumber": 3463,
        "english_text": "The Messenger of Allah (ﷺ) came to me and I said to him: Have you any inclination towards my the daughter of Abu Sufyan? He (the Holy Prophet) said: Then what should I do? I said: Marry her. He said: Do you like that? I said: I am not the exclusive (wife) of yours; I, therefore, wish to join my sister in good. He, said: She is not lawful for me. I said: I have been informed that you have given the proposal of marriage to Durrah daughter of Abu Salama He raid: You mean the daughter of Umm Salama? I said: Yes. He said: Even if she had not been my step-daughter brought up under my guardianship, she would not have been lawful for me, for she is the daughter of my foster-brother (Hamza), for Thuwaiba had suckled me and her father. So do not give me the proposal of the marriage of your daughters and sisters."
    },
    {
        "hadithnumber": 1428,
        "english_text": "A hadith like this has been narrated by A'mash by the same chain of transmitters"
    },
    {
        "hadithnumber": 1429,
        "english_text": "The Messenger of Allah (ﷺ) said to us: The one who is well grounded in Allah's Book and is distinguished among them in recitation should act as; Imam for the people. and if they are equally versed in reciting it, then the one who has most knowledge regarding Sunnah; if they are equal regarding the Sunnah, then the earliest one to emigrate; If they emigrated at the same time, then the oldest one in age. No man must lead another in prayer in latter's house or where (the latter) has authority, or sit in his place of honour in his house, except that he gives you permission or with his permission."
    },
    {
        "hadithnumber": 5541,
        "english_text": "None amongst you should make his brother stand on Friday (during the congregational prayer) and then occupy his-place. but he should only say to him (Accommodate me)."
    },
    {
        "hadithnumber": 5542,
        "english_text": "When anyone amongst you stands up, and in the badltb transmitted on the authority of Abu 'Awina, the words are:\" He who stands in his place and (goes away) and then comes back to it, he his the greatest right (to occupy that)."
    },
    {
        "hadithnumber": 5543,
        "english_text": "Abdullahb. Aba Umayya. if Allah grants you victory in Ta'if on the next day, I will show you the daughter of Ghailan for she has four folds (upon her body) on the front side of her stomach and eight folds on the back. Allah's Messenger (ﷺ) heard this and he said: Such (people) should not visit you."
    },
    {
        "hadithnumber": 5544,
        "english_text": "As the comes in front tour folds appear on her front side and as she turns her back eight folds appear on the back side. Thereupon Allah's Apostle (ﷺ) said: I me that he knows these things; do not, therefore. allow him to cater. She (\" A'isha) said: Then they began to observe veil from him."
    },
    {
        "hadithnumber": 5545,
        "english_text": "I grazed his horse. provided fodder to it and looked after it, and ground dates for his camel. Besides this, I grazed the camel, made arrangements for providing it with water and patched up the leather bucket and kneaded the flour. But I was not proficient in baking the bread, so my female neighbours used to bake bread for me and they were sincere women. She further said: I was carrying on my head the stones of the dates from the land of Zubair which Allah's Messenger (ﷺ) had endowed him and it was at a distance of two miles (from Medina). She add: As I was one day carrying the atones of dates upon my head I happened to meet Allah's Messenger (ﷺ) along with a group of his Companions. He called me and said (to the camel) to sit down so that he should make cite ride behind hirn. (I told my husband: ) I felt shy and remembered your jealousy, whereupon he said: By Allah. the carrying of the stone dates upon your bead is more severe a burden than riding with him. She said: (I led the life of hardship) until Abu Bakr sent afterwards a female servant who took upon herself the responsibility of looking after the horse and I felt as it she had emancipated me."
    },
    {
        "hadithnumber": 3525,
        "english_text": "A believing man should not hate a believing woman; if he dislikes one of her characteristics, he will be pleased with another."
    },
    {
        "hadithnumber": 3038,
        "english_text": "\" There are not these words in it: To all these three rites (throwing of pebbles sacrificing of animal and shaving of one's head).\" And so far as the narration of Yahya al-Umawi (the words are): I got (my head) shaved before I sacrificed the animal, and I sacrified the animal before throwing pebbles, and like that."
    },
    {
        "hadithnumber": 3039,
        "english_text": "I got (my head) shaved before sacrificing the, animal, whereupon be (the Holy Prophet) said: Sacrifice the animal (now) ; there is no harm in it. He (the person said): I sacripced the animal before throwingpebbles. whereupon he said: Throw pebbles (now) ; there is no harm in it."
    },
    {
        "hadithnumber": 7144,
        "english_text": "This hadith has been narrated on the authority of Umm Salama through another chain of transmitters."
    }
]