[
    {
        "hadithnumber": 125,
        "english_text": "\"I was with the Prophet (ﷺ) on a journey, and he said: 'Stay back O Mughirah! Go ahead, O people!' So I went back, and I had with me a vessel of water. The people went ahead, and there the Messenger of Allah (ﷺ) relieved himself. when he came back I went and poured water for him. He was wearing a Roman Jubbah with narrow sleeves, and he wanted to expose his hands (to wash them) but the sleeves were too tight, so he brought his hands out from beneath the Jubbah and washed his head, and wiped over his Khuffs.\""
    },
    {
        "hadithnumber": 1368,
        "english_text": "On the Day of Al-Khandaq, after the sun had set, Umar bin Al-Khattab started cursing the disbelievers of the Quraish and said: \"O Messenger of Allah, I was hardly able to pray until the sun set.\" The Messenger of Allah (ﷺ) said: \"By Allah, I did not pray.\" So we went down with the Messenger of Allah (ﷺ) to Buthan. He performed wudu' for prayer and so did we, and he prayed 'Asr after the sun had set, then he prayed Maghrib after that.\""
    },
    {
        "hadithnumber": 1369,
        "english_text": "\"The Messenger of Allah (ﷺ) said: 'We are the last (to come) but will be the foremost on the Day of Resurrection, but they were given the Book before us and we were given it after them. They differed concerning this day which Allah, the Mighty and Sublime, had prescribed for them and Allah, the Mighty and Sublime, guided us to\"--meaning Friday--\"so the people follow us, the Jews the next day and the Christians the day after that.'\""
    },
    {
        "hadithnumber": 1372,
        "english_text": "\"Whoever missed three jumu'ahs out of negligence, Allah will place a seal over his heart.\""
    },
    {
        "hadithnumber": 3857,
        "english_text": "The Messenger of Allah said: \"There is no vow to commit an act of disobedience and its expiation is the expiation for an oath.\" Mansur bin Zadhan contradicted him in his wording."
    },
    {
        "hadithnumber": 3858,
        "english_text": "The Messenger of Allah said: \"There is no vow for the son of Adam with regard to that which he does not possess, or to do an act of disobedience to Allah, the Mighty and Sublime.\" 'Ali bin Zaid contradicted him -for he reported it from Al-Hasan from 'Abdur-Rahman bin Samurah."
    },
    {
        "hadithnumber": 3859,
        "english_text": "\"There is no vow to commit an act of disobedience or with regard to that which the son of Adam does not possess.\""
    },
    {
        "hadithnumber": 3860,
        "english_text": "The Messenger of Allah said: \"There is no vow to commit an act of disobedience or with regard to that which the son of Adam does not possess.\""
    },
    {
        "hadithnumber": 3861,
        "english_text": "\"The Prophet saw a man being supported by two others and said: 'What is this?' They said: 'He vowed to walk to the House of Allah.' He said: 'Allah has no need for this man to torture himself. Tell him to ride.'\""
    },
    {
        "hadithnumber": 3862,
        "english_text": "\"The Messenger of Allah passed by an old man who was being supported between two men and said: 'What is the matter with him?' They said: 'He vowed to walk.' He said: 'Allah has no need for him to torture himself. Tell him to ride.'\" So he was told to ride."
    },
    {
        "hadithnumber": 3863,
        "english_text": "\"The Messenger of Allah came to a man who was being supported by two others and said: 'What is the matter with him?' It was said: 'He vowed to walk to the Ka'bah.' He said: 'Allah does not benefit from his torturing himself.' And he told him to ride.\""
    },
    {
        "hadithnumber": 3864,
        "english_text": "\"The Messenger of Allah said: 'Whoever swears an oath and says: \"If Allah wills, then he has made an exception.\"'\""
    },
    {
        "hadithnumber": 3865,
        "english_text": "\"Sulaiman said: 'I will certainly go around to ninety women tonight, each of whom will bear a child who will fight in the cause of Allah.' It was said to him: 'Say: If Allah wills' but he did not say it. He went around to them but none of them bore a child except for one woman who bore half a person.\" The Messenger of Allah said: \"If he had said: 'If Allah wills,' he would not have broken his vow, and this would have been a means to help him to get what he wanted.\""
    },
    {
        "hadithnumber": 3866,
        "english_text": "\"When you hire a worker, tell him what his wages will be.\""
    },
    {
        "hadithnumber": 3867,
        "english_text": "It was narrated from Al-Hasan that he disliked to hire a man without telling him what his wages would be."
    },
    {
        "hadithnumber": 3868,
        "english_text": "\"No, not until he tells him (what his wages will be).\""
    },
    {
        "hadithnumber": 3869,
        "english_text": "\"I will lease (something) from you until I reach Makkah for such and such a payment, and if I travel for a month or such and such -something that he named- I will give you such and such in addition.\" They did not see anything wrong with that, but they did not like it if he said: \"If I travel for more than a month I will deduct such and such from your lease.\""
    },
    {
        "hadithnumber": 3870,
        "english_text": "\"I said to 'Ata': 'What if I hire a slave for a year in return for his food, and for another year, in return for such and such?' He said: 'There is nothing wrong with that, and you may stipulate your conditions of hiring even for a few days.' 'How about if I make a deal to hire him when part of the year has passed?' He said: 'Do not hold me to account for what has passed.'\""
    },
    {
        "hadithnumber": 3871,
        "english_text": "\"O Banu Harithah, a calamity has befallen you.\" They said: \"What is it?\" He said: \"The Messenger of Allah has forbidden leasing land.\" We said: \"O Messenger of Allah, what if we lease it in return for some of the grain?\" He said, \"No.\" He said: \"We used to lease it in return for straw.\" He said: \"No.\" \"We used to lease it in return for what is planted on the banks of a stream that is used for irrigation.\" He said: \"No. Cultivate it (yourself) or give it to your brother.\""
    },
    {
        "hadithnumber": 3872,
        "english_text": "\"Rafi' bin Khadij came to us and said: 'The Messenger of Allah has forbidden for you Al-Haql. Al-Haql is the third and the fourth. And Al-Muzabanah. Al-Muzabanah is to buy what is at the top of the date-palm trees in return for a certain number of Wasqs of dried dates.'\""
    },
    {
        "hadithnumber": 3873,
        "english_text": "\"Rafi' bin Khadij came to us and said: 'The Messenger of Allah has forbidden something that was beneficial for us, but obedience to the Messenger of Allah is better for you.  He has forbidden Al-Haql (renting land in return for one-third or one-quarter of the produce) to you, and says: Whoever has land, let him give it (to someone else to cultivate it) or leave it. And he has forbidden Al-Muzabanah. Al-Muzabanah means when a man has a lot of date-palm trees and another man comes and takes it in return for a certain number of Wasqs of dried dates.'\""
    },
    {
        "hadithnumber": 3874,
        "english_text": "\"Rafi' bin Khadij came to us and I was not sure what he meant. He said: 'The Messenger of Allah has forbidden to you something that used to benefit you, but obedience to the Messenger of Allah is better for you than that which benefits you. The Messenger of Allah has forbidden Al-Haql for you. Al-Haql means share-cropping the land in return for one-third or one-quarter (of the yield). So whoever has land that he does not need, let him give it to his brother (to cultivate it) or let him leave it. And he has forbidden to you Al-Muzabanah. Al-Muzabanah means when a man has a great number of datepalms and says: Take it in return for (a certain number of) Wasqs of dried dates this year.'\""
    },
    {
        "hadithnumber": 3875,
        "english_text": "\"Rafi' bin Khadij said: 'The Messenger of Allah has forbidden something for you that used to be beneficial for us, but obedience to the Messenger of Allah is more beneficial for us. He said: \"Whoever has land let him cultivate it, and if he is unable to do so, let him give it to his brother to cultivate.\"'\""
    },
    {
        "hadithnumber": 3876,
        "english_text": "\"I took Tawus by the hand and brought him to Ibn Rafi' bin Khadij, and he told him, narrating from his father, that the Messenger of Allah forbade leasing land. Tawus rejected that and said: 'I heard Ibn 'Abbas (say) that he did not see anything wrong with that.'\""
    },
    {
        "hadithnumber": 3877,
        "english_text": "\"Rafi' bin Khadij said: 'The Messenger of Allah forbade us to do something that was beneficial for us, (but we respect and obey the command of the Messenger of Allah). He forbade us to lease land in return for some of its produce.\""
    },
    {
        "hadithnumber": 3878,
        "english_text": "\"The Prophet passed by the land of a man from among the Ansar who he knew was in need and said: 'Whose is this land?' He said: 'So and so's; he has given it to us in return for rent.' He said: 'Why did he not give it to his brother?'\" Rafi' came to the Ansar and said: \"The Messenger of Allah has forbidden something for you which was beneficial, but obedience to the command of the Messenger of Allah is more beneficial for you.\""
    },
    {
        "hadithnumber": 3879,
        "english_text": "\"The Messenger of Allah forbade Al-Haql (renting land in return for one-third or one-quarter of the produce).\""
    },
    {
        "hadithnumber": 3880,
        "english_text": "\"The Messenger of Allah came out to us and forbade something for us that had been beneficial for us. He said: 'Whoever has land, let him cultivate it or give it to someone else (to cultivate), or leave it.'\""
    },
    {
        "hadithnumber": 3881,
        "english_text": "\"The Messenger of Allah came out to us and forbade something for us that had been beneficial for us, but the command of Messenger of Allah is better for us. He said: 'Whoever has land, let him cultivate it or leave it or give it (to someone else to cultivate).'\""
    },
    {
        "hadithnumber": 3882,
        "english_text": "\"Tawus regarded it disliked renting out land for gold and silver, but he did not see anything wrong with leasing it in return for one-third or one-quarter (of the yield). Mujahid said to him: 'Go to Ibn Rafi' bin Khadij and listen to his Hadith.' He said: 'By Allah, if I knew that the Messenger of Allah had forbidden that I would not have done it. But my Hadith comes from one who is more knowledgeable than him. Ibn 'Abbas (said) that the Messenger of Allah said: \"If one of you were to give his land to his brother (to cultivate it), that would be better than taking an agreed portion of the yield.\"'\""
    },
    {
        "hadithnumber": 3883,
        "english_text": "\"Whoever has land, let him cultivate it. If he is unable to cultivate it, let him give it to his Muslim brother and not share-crop it with him.\""
    },
    {
        "hadithnumber": 3884,
        "english_text": "The Messenger of Allah said: \"Whoever has land, let him cultivate it or give it to his brother, and not lease it to him.\""
    },
    {
        "hadithnumber": 3885,
        "english_text": "\"Some people had some extra land which they leased out in return for half of the yield, or one-third, or one-quarter. The Messenger of Allah said: 'Whoever has land, let him cultivate it, or give it to his brother to cultivate or keep it (without cultivating it).'\""
    },
    {
        "hadithnumber": 3886,
        "english_text": "\"The Messenger of Allah addressed us and said: 'Whoever has land, let him cultivate it or give it to someone else to cultivate, and let him not rent it out.'\""
    },
    {
        "hadithnumber": 3887,
        "english_text": "\"That he forbade leasing out land.\""
    },
    {
        "hadithnumber": 3888,
        "english_text": "It was narrated from Jabir that the Prophet forbade Al-Mukhabarah, Al-Muzabanah and Al-Muhaqalah, and selling fruit until it is fit to eat (ripe enough), except in the case of Al-'Araya."
    },
    {
        "hadithnumber": 3889,
        "english_text": "It was narrated from Jabir that the Prophet forbade Al-Muhaqalah, Al-Muzabanah, Al-Mukhabarah and exceptions when selling, unless they were well-defined."
    },
    {
        "hadithnumber": 3890,
        "english_text": "\"Whoever has land, let him cultivate it or give it to his brother to cultivate, and not lease it to his brother.\""
    },
    {
        "hadithnumber": 3891,
        "english_text": "\"The Prophet forbade Al-Haql and it is Al-Muzabanah.\""
    },
    {
        "hadithnumber": 3892,
        "english_text": "\"Al-Mukhadarah means selling fruit before it ripens and Al-Mukhabarah means selling grapes in return for a certain number of Sa's.\""
    },
    {
        "hadithnumber": 3893,
        "english_text": "\"The Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\""
    },
    {
        "hadithnumber": 3894,
        "english_text": "\"The Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\""
    },
    {
        "hadithnumber": 3895,
        "english_text": "It was narrated from Rafi' bin Khadij that the Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah."
    },
    {
        "hadithnumber": 3896,
        "english_text": "\"I asked Al-Qasim about Al-Muzara'ah, so he narrated from Rafi' bin Khadij that the Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\""
    },
    {
        "hadithnumber": 3897,
        "english_text": "Rafi' bin Khadij said that the Messenger of Allah forbade leasing land."
    },
    {
        "hadithnumber": 3898,
        "english_text": "\"My paternal uncle sent me with a slave of his, to Sa'eed bin Al-Musayyab to ask him about Al-Muzara'ah. He said: 'Ibn 'Umar did not see anything wrong with it, until he heard the Hadith from Rafi' bin Khadij. Then he met him, and Rafi' said: \"The Prophet came to Banu Harithah and saw some crops. He said: 'How good are the crops of Zubair.' They said: 'It is not Zubair's.' He said: 'Is the land not Zubair's?' They said: 'No (it is not his), rather he is leasing it.' The Messenger of Allah said: 'Take your crops and give him what he spent.' So we took our crops, and gave him what he had spent.\""
    },
    {
        "hadithnumber": 3899,
        "english_text": "\"The Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah, and said: 'Only three may cultivate: A man who has land which he cultivates; a man who was given some land and cultivates what he was given; and a man who takes land on lease for gold or silver.'\""
    },
    {
        "hadithnumber": 3900,
        "english_text": "\"The Messenger of Allah forbade Al-Muhaqalah.\" Sa'eed said: \"And he narrated something similar.\" And Sufyan Ath-Thawri reported it from Tariq."
    },
    {
        "hadithnumber": 3901,
        "english_text": "\"I heard Sa'eed bin Al-Musayyab say: 'Cultivating land is not allowed except in three cases: Land which one owns, land which is given to one, or land which one rents in return for gold and silver.'\""
    },
    {
        "hadithnumber": 3902,
        "english_text": "It was narrated from Sa'eed bin Al-Musayyab that the Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah."
    },
    {
        "hadithnumber": 3903,
        "english_text": "\"At the time of the Messenger of Allah landowners used to lease their arable land in return for whatever grew on the banks of the streams for irrigation. They came to the Messenger of Allah and referred a dispute concerning such matters to him, and the Messenger of Allah forbade them to lease land on such terms, and said: 'Lease it for gold or silver.'\""
    },
    {
        "hadithnumber": 3904,
        "english_text": "\"At the time of the Messenger of Allah we used to lease land on the basis of Al-Muhaqalah, so we would lease it in return for one-third or one-quarter of the yield, or a specified amount of food (produce). One day, a man among my paternal uncles came and said 'The Messenger of Allah has forbidden me to do something that was beneficial for us, but obedience to Allah and His Messenger is more beneficial for us. He has forbidden us to lease land on the basis of Al-Muhaqalah and to lease it in return for one-third or one-quarter of the yield, and for a specified amount of food (produce). And he commanded the landowner to cultivate it (himself) or to give it to someone else to cultivate. He did not like leasing it or anything else.'\""
    },
    {
        "hadithnumber": 3905,
        "english_text": "\"Ya'la bin Al-Hakim wrote to me (saying): 'I heard Sulaiman bin Yasar narrating from Rafi' bin Khadij, who said: \"We used to lease land on the basis of Al-Muhaqalah, leasing it in return for one-third or one-quarter of the yield, and a specified amount of food (produce).\"'\""
    },
    {
        "hadithnumber": 3906,
        "english_text": "\"We used to lease land on the basis of Al-Muhaqalah during the time of the Messenger of Allah.\" He said that one of his paternal uncles came to them and said: \"The Messenger of Allah has forbidden me to do something that was beneficial for us, but obedience to Allah and His Messenger is more beneficial.\" We said: \"What is that?\" He said: \"The Messenger of Allah said: 'Whoever has land, let him cultivate it (himself) or give it to his brother to cultivate, and not lease it in return for one-third or one-quarter of the yield nor a specified amount of food (produce).'\""
    },
    {
        "hadithnumber": 3907,
        "english_text": "\"My paternal uncle told me that they used to lease land at the time of the Messenger of Allah in return for what grew on the banks of the streams, and a share of the crop stipulated by the owner of the land. But the Messenger of Allah forbade us that.\" I (Hanzalah) said to Rafi': \"How about leasing it in return for Dinars and Dirhams?\" Rafi' said: \"There is nothing wrong with (leasing it) for Dinars and Dirhams.\""
    },
    {
        "hadithnumber": 3908,
        "english_text": "\"I asked Rafi' bin Khadij about leasing land in return for Dinars and silver. He said: 'There is nothing wrong with that. During the time of the Messenger of Allah they used to rent land to one another in return for what grew on the banks of streams and where the springs emerged - some areas of which might give good produce and some might give none at all - and the people did not lease land in any other way. So that was forbidden. But as for leases where the return is known and guaranteed, there is nothing wrong with that.'\""
    },
    {
        "hadithnumber": 3909,
        "english_text": "\"I asked Rafi' bin Khadij about leasing land. He said: 'The Messenger of Allah forbade leasing land.' I said: 'For gold or silver?' He said: 'No, rather he forbade leasing it in return for what the land produces. As for gold and silver, there is nothing wrong with that.'\""
    },
    {
        "hadithnumber": 3910,
        "english_text": "\"I asked Rafi' bin Khadij about leasing uncultivated land in return for gold and silver. He said: '(It is) permissible and there is nothing wrong with that. That is the due of the land.'\""
    },
    {
        "hadithnumber": 3911,
        "english_text": "\"The Messenger of Allah forbade us to lease our land. At that time there was no gold nor silver. A man would lease his land in return for what grew on the banks of streams and where the springs emerged, and in return for something specific.\""
    },
    {
        "hadithnumber": 3912,
        "english_text": "It was narrated from Az-Zuhri that Salim bin 'Abdullah narrated something similar."
    },
    {
        "hadithnumber": 3913,
        "english_text": "\"O Ibn Khadij, what do you narrate from the Messenger of Allah about leasing land?\" Rafi said to Abdullah: \"I heard two of my uncles, who had been present at Badr, telling the people in the house, that the Messenger of Allah forbade leasing land.\" Abdullah said: \"I knew that at the time of the Messenger of Allah land used to be leased.\" Then Abdullah was concerned that the Messenger of Allah had decreed something and he had not known about it, so he stopped leasing land."
    },
    {
        "hadithnumber": 3914,
        "english_text": "\"We heard that Rafi bin Khadij used to narrate that his paternal uncles -whom he said had been present at Badr- (said) that the Messenger of Allah forbade leasing land.\""
    },
    {
        "hadithnumber": 3915,
        "english_text": "\"Az-Zuhri said: 'Ibn Al-Musayyab used to say: 'There is nothing wrong with leasing land in return for gold and silver, and Rafi bin Khadij used to narrate that the Messenger of Allah forbade that.''\""
    },
    {
        "hadithnumber": 3916,
        "english_text": "\"The Messenger of Allah forbade leasing land.\" Ibn Shihab said: \"Rafi was asked after that: 'How did they lease land?' He said: 'In return for a set amount of food (produce), and it was stipulated that we would have whatever grew on the banks of the streams and springs.'\""
    },
    {
        "hadithnumber": 3917,
        "english_text": "\"We knew that he owned some arable land that he leased at the time of the Messenger of Allah in return for whatever grew on the banks of the streams of water, and for a certain amount of straw, I do not know how much it was.\" Ibn Awn reported it from Nafi but he said: \"From some of his paternal uncles.\""
    },
    {
        "hadithnumber": 3918,
        "english_text": "\"Ibn 'Umar used to take rent for some land, then he heard something from Rafi' bin Khadij. He took me by the hand and went off to Rafi', and I was with him. Rafi' narrated to him from some of his paternal uncles, that the Messenger of Allah forbade leasing land, so 'Abdullah stopped (doing that) afterward.\""
    },
    {
        "hadithnumber": 3919,
        "english_text": "It was narrated from Ibn 'Umar that he used to take rent for land until Rafi' narrated to him, from some of his paternal uncles, that the Messenger of Allah forbade leasing land. So he stopped doing that afterward."
    },
    {
        "hadithnumber": 3920,
        "english_text": "\"The Messenger of Allah used to forbid leasing arable land.\" So Ibn 'Umar stopped (doing that) afterward. When he was asked about it he said: \"Rafi' bin Khadij said that the Prophet forbade that.\""
    },
    {
        "hadithnumber": 3921,
        "english_text": "\"He went out to him (and met him) in Al-Balat, and I was with him. He asked him (about that) and he said: 'Yes, the Messenger of Allah forbade leasing arable land.' So 'Abdullah stopped leasing it.\""
    },
    {
        "hadithnumber": 3922,
        "english_text": "\"A man told Ibn 'Umar that Rafi' bin Khadij had narrated a Hadith concerning leasing of land. He and I, along with the man who had told him that, went to Rafi', and he told us that the Messenger of Allah had forbidden leasing land. So 'Abdullah stopped leasing land.\""
    },
    {
        "hadithnumber": 3923,
        "english_text": "It was narrated from Nafi' that Rafi' bin Khadij told 'Abdullah bin 'Umar that the Messenger of Allah forbade leasing arable land."
    },
    {
        "hadithnumber": 3924,
        "english_text": "\"Ibn 'Umar used to lease his land in return for some of its produce.  Then he heard that Rafi' bin Khadij warned against that. He said: 'The Messenger of Allah forbade that.' He said: 'We used to lease our land before we came to know Rafi'.' Then he (Ibn 'Umar) became unsure, so he put his hand on my shoulder and we went to Rafi'. 'Abdullah said to him: 'Did you hear the Prophet forbid leasing land?' Rafi' said: 'I heard the Prophet say: Do not lease land in return for anything.'\""
    },
    {
        "hadithnumber": 3925,
        "english_text": "It was narrated from Rafi' bin Khadij that the Messenger of Allah forbade leasing land."
    },
    {
        "hadithnumber": 3926,
        "english_text": "\"I heard Ibn 'Umar say: 'We used to sell grain before it was ripe and before it was evident that it was free of disease and blight (by means of Al-Mukhabarah). We did not see anything wrong with that, until Rafi' bin Khadij said that the Messenger of Allah had forbidden Al-Mukhabarah.'\""
    },
    {
        "hadithnumber": 3927,
        "english_text": "\"I bear witness that I heard Ibn 'Umar asking about Al-Khibr (the agreement to Al-Mukhabarah) and he said: 'We did not see anything wrong with that, until Ibn Khadij told us earlier that he heard the Messenger of Allah forbidding Al-Khibr.'\" Hammad bin Zaid was in accord with the two of them."
    },
    {
        "hadithnumber": 3928,
        "english_text": "\"I heard Ibn 'Umar say: 'We did not see anything wrong with Al-Khibr until last year, when Rafi' said that the Prophet of Allah forbade it.'\""
    },
    {
        "hadithnumber": 3929,
        "english_text": "It was narrated from Jabir bin 'Abdullah that the Prophet forbade leasing land."
    },
    {
        "hadithnumber": 3930,
        "english_text": "\"The Messenger of Allah forbade Al-Mukhabarah, Al-Muhaqalah and Al-Muzabanah.\""
    },
    {
        "hadithnumber": 3931,
        "english_text": "It was narrated from Ibn 'Umar and Jabir that the Messenger of Allah forbade selling fruits until it was clear that they were free of blemish, and (he forbade from) Al-Mukhabarah; leasing land in return for one-third or one-quarter (of the yield)."
    },
    {
        "hadithnumber": 3932,
        "english_text": "\"Do you rent out your arable land?\" I said: \"Yes, O Messenger of Allah. We rent it out in return for one-quarter, and in return for (a number of) Wasqs of barley.\" The Messenger of Allah said: \"Do not do that. Cultivate it (yourselves), or lend it, or keep it.\""
    },
    {
        "hadithnumber": 3933,
        "english_text": "\"Zuhair bin Rafi' came to us and said: 'The Messenger of Allah forbade me to do something that was convenient for us.' I said: 'What was that?' He said: 'The command of the Messenger of Allah is true. He asked me: What do you do with your land? I said: We rent it out in return for one-quarter (of the yield) and a number of Wasqs of dates or barley. He said: Do not do that. Cultivate it, give it to someone else to cultivate, or keep it.'\""
    },
    {
        "hadithnumber": 3934,
        "english_text": "\"Today the Messenger of Allah has forbidden something which was convenient for you, but following his command is an act of obedience (to Allah) and is good. He forbade Al-Haql.\""
    },
    {
        "hadithnumber": 3935,
        "english_text": "\"I heard Usaid bin Rafi' bin Khadij Al-Ansari say that they did not allow Al-Muhaqalah, which is land that is cultivated in return for some of its produce.\""
    },
    {
        "hadithnumber": 3936,
        "english_text": "\"I was an orphan in the care of my grandfather Rafi' bin Khadij. I reached puberty and became a man, and I performed Hajj with him. My brother 'Imran bin Sahl bin Rafi' bin Khadij came and said: 'O my father, we have leased our land to so and so (a woman) for two hundred Dirhams.' He said: 'O my son, leave that (do not do it), for Allah will give you other provision. The Messenger of Allah forbade leasing land.'\""
    },
    {
        "hadithnumber": 3937,
        "english_text": "\"Zaid bin Thabit said: 'May Allah forgive Rafi' bin Khadij. By Allah, I have more knowledge of the Hadith than him. We were two men who fought and the Messenger of Allah said: If this is how it is between you, then do not lease land. And he only heard the words: Do not lease land.'\""
    },
    {
        "hadithnumber": 3938,
        "english_text": "\"Muhammad used to say: 'In my view land is like the wealth put into a Mudarabah (limited partnership) contract. Whatever is valid with regard to the wealth put into a Mudarabah partnership, is valid with regard to land, and whatever is not valid with regard to the wealth put into a Mudarabah partnership, then it is not valid with regard to land.'\" He said: \"He did not see anything wrong with giving all of his land to the plowman on the basis that he would work with it himself, or with his children, and helpers, and oxen, and, that he would not spend anything on it; all expenses were to be paid by the owner of the land.\""
    }
]