[
    {
        "hadithnumber": 190,
        "text": "Yahya m'a rapporté de Malik, de Yazid ibn Ruman, que Nafi ibn Jubayr ibn Mutim récitait derrière l'imam lorsqu'il ne récitait pas à voix haute. Malik a dit : \"C'est ce que je préfère de ce que j'ai entendu à ce sujet.\""
    },
    {
        "hadithnumber": 191,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar, lorsqu'on lui demandait si quelqu'un devait réciter derrière un imam, disait : \"Quand tu pries derrière un imam, alors la récitation de l'imam te suffit, et quand tu pries seul, tu dois réciter.\" Nafi a ajouté : \"Abdullah ibn Umar ne récitait pas derrière l'imam.\" Yahya a dit qu'il a entendu Malik dire : \"Notre position est qu'un homme récite derrière l'imam lorsque l'imam ne récite pas à voix haute et il s'abstient de réciter lorsque l'imam récite à voix haute.\""
    },
    {
        "hadithnumber": 203,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar prononçait le tashahhud en disant : \"Au nom d'Allah. Les salutations appartiennent à Allah. Les prières appartiennent à Allah. Les bonnes actions appartiennent à Allah. Paix sur le Prophète et la miséricorde d'Allah et Ses bénédictions. Paix sur nous et sur les serviteurs d'Allah vertueux. J'atteste qu'il n'y a de dieu qu'Allah. J'atteste que Muhammad est le Messager d'Allah.\" (Bismillah, at-tahiyatu lillah, as-salawatu lillah, az-zakiyatu lillah. As-salamu ala'n-nabiyyi wa rahmatullahi wa barakatuhu. As-salamu alayna wa ala ibadi'llahi's-salihin. Shahidtu an la ilaha illallah. Shahidtu anna Muhammadu'r-rasulu'llah). Il disait cela après les deux premières rakas et il faisait des invocations avec ce qui lui semblait bon lorsque le tashahhud était terminé. Lorsqu'il s'asseyait à la fin de la prière, il faisait le tashahhud de la même manière, sauf qu'après le tashahhud il faisait des invocations avec ce qui lui semblait bon. Lorsqu'il avait terminé le tashahhud et avait l'intention de dire le taslim, il disait : \"Paix sur le Prophète et Sa miséricorde et bénédictions. Paix sur nous et sur les serviteurs d'Allah vertueux.\" Il disait ensuite : \"Paix sur vous\" à sa droite, et rendait le salut à l'imam, et si quelqu'un disait \"Paix sur vous\" de sa gauche, il lui rendait le salut."
    },
    {
        "hadithnumber": 204,
        "text": "Yahya m'a rapporté de Malik, de Abd ar-Rahman ibn al-Qasim, de son père, que A'isha, l'épouse du Prophète, paix et bénédictions sur lui, disait dans le tashahhud : \"Les salutations, les bonnes paroles, les prières, les actions pures appartiennent à Allah. J'atteste qu'il n'y a de dieu qu'Allah, seul sans associé, et que Muhammad est Son serviteur et Son Messager. Paix sur toi, Prophète, et la miséricorde d'Allah et Ses bénédictions. Paix sur nous et sur les serviteurs d'Allah vertueux. Paix sur vous.\""
    },
    {
        "hadithnumber": 209,
        "text": "Yahya m'a rapporté de Malik, de Da'ud ibn al-Husayn, que Abu Sufyan, le mawla de Ibn Abi Ahmad, a dit qu'il a entendu Abu Hurayra dire : \"Le Messager d'Allah, paix et bénédictions sur lui, a prié le asr et a dit le taslim après deux rakas. Dhu'l-Yadayn se leva et dit : 'La prière a-t-elle été raccourcie, Messager d'Allah, ou as-tu oublié ?' Le Messager d'Allah, paix et bénédictions sur lui, se leva et compléta ce qui restait de la prière, puis, restant assis après avoir dit le taslim, il fit deux prosternations.\""
    },
    {
        "hadithnumber": 210,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que Abu Bakr ibn Sulayman ibn Abi Hathma a dit : \"J'ai entendu que le Messager d'Allah, paix et bénédictions sur lui, a prié deux rakas de l'une des deux prières de jour, dhuhr ou asr, et a dit le taslim après deux rakas. Dhu'sh-Shamalayn lui dit : 'La prière a-t-elle été raccourcie, Messager d'Allah, ou as-tu oublié ?' Le Messager d'Allah, paix et bénédictions sur lui, dit : 'La prière n'a pas été raccourcie et je n'ai pas oublié.' Dhu'sh-Shamalayn dit : 'C'était certainement l'un des deux, Messager d'Allah.' Le Messager d'Allah, paix et bénédictions sur lui, s'approcha des gens et dit : 'Dhu'sh-Shamalayn a-t-il dit la vérité ?' Ils dirent : 'Oui, Messager d'Allah', et le Messager d'Allah, paix et bénédictions sur lui, compléta ce qui restait de la prière, puis dit : 'Paix sur vous'.\""
    },
    {
        "hadithnumber": 215,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar, interrogé sur l'oubli dans la prière, a dit : \"Si tu penses que tu as oublié une partie de la prière, alors prie-la.\""
    },
    {
        "hadithnumber": 221,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Abi Bakr, qu'un homme des Ansar priait dans un jardin à lui à Quff, l'une des vallées de Médine, pendant la saison des dattes et les branches des palmiers étaient lourdes de fruits de tous côtés. Il les regarda et ce qu'il vit de leurs fruits l'émerveilla. Puis il retourna à sa prière et il ne savait plus combien il avait prié. Il dit : \"Une épreuve m'a atteint dans cette propriété qui est la mienne.\" Alors il alla voir Uthman ibn Affan, qui était le calife à l'époque, et lui en fit part et dit : \"C'est une sadaqa, donne-la donc dans les sentiers du bien.\" Uthman ibn Affan la vendit pour cinquante mille et cette propriété devint connue sous le nom de 'La Cinquante'.\""
    },
    {
        "hadithnumber": 226,
        "text": "Yahya m'a rapporté de Malik, de Said ibn Abi Said al-Maqburi, que Abu Hurayra disait : \"Faire le ghusl comme prescrit pour l'impureté rituelle majeure est obligatoire (wajib) le jour du vendredi pour tout mâle ayant atteint la puberté.\""
    },
    {
        "hadithnumber": 227,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que Salim ibn Abdullah a dit : \"L'un des compagnons du Messager d'Allah, paix et bénédictions sur lui, entra dans la mosquée un vendredi alors que Umar ibn al-Khattab faisait déjà le prêche (khutba). Umar dit : 'Quelle heure est-ce pour arriver ?' Il dit : 'Ô Commandeur des Croyants, je suis revenu du marché et j'ai entendu l'appel à la prière, alors je n'ai fait que les ablutions (wudu).' Umar dit : 'Tu n'as fait que les ablutions aussi ? Tu sais que le Messager d'Allah, paix et bénédictions sur lui, disait aux gens de faire le ghusl.\""
    },
    {
        "hadithnumber": 228,
        "text": "Yahya m'a rapporté de Malik, de Safwan ibn Sulaym, de Ata ibn Yasar, de Abu Said al-Khudri, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Le ghusl le jour du vendredi est obligatoire pour tout mâle ayant atteint la puberté.\""
    },
    {
        "hadithnumber": 229,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Ibn Umar, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Quand vous venez au vendredi, faites le ghusl.\" Malik a dit : \"Il ne suffit pas à quelqu'un de faire un ghusl le jour du vendredi et d'avoir l'intention par cela du ghusl du vendredi à moins qu'il ne fasse le ghusl et ne parte ensuite. C'est parce que le Messager d'Allah, paix et bénédictions sur lui, a dit dans le hadith rapporté par Ibn Umar, 'Quand vous venez au vendredi, faites le ghusl.'\" Malik a dit : \"Si quelqu'un fait le ghusl le jour du vendredi et a l'intention par cela du ghusl du jour du vendredi et part ensuite, que ce soit tôt ou tard, et fait quelque chose qui rompt ses ablutions, il n'a qu'à faire les ablutions et son ghusl reste valide pour lui.\""
    },
    {
        "hadithnumber": 230,
        "text": "Yahya m'a rapporté de Malik, de Abu'z-Zinad, de al-Araj, de Abu Hurayra, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Même dire à ton compagnon 'Écoute' pendant que l'imam fait le prêche le jour du vendredi, c'est parler futilement.\""
    },
    {
        "hadithnumber": 237,
        "text": "Malik a dit : \"Quelqu'un qui saigne du nez le jour du vendredi pendant que l'imam fait le prêche et qui sort et ne revient pas avant que l'imam ait fini la prière, doit prier quatre rakas.\" Malik a dit que quelqu'un qui a prié une raka avec l'imam le jour du vendredi, puis a saigné du nez et est sorti et est revenu alors que l'imam avait prié les deux rakas, doit compléter la prière avec une autre raka tant qu'il n'a pas parlé. Malik a dit : \"Si quelqu'un saigne du nez, ou si quelque chose lui arrive et qu'il n'a d'autre choix que de sortir, il n'a pas à demander la permission de l'imam s'il veut sortir le jour du vendredi.\" Yahya m'a rapporté de Malik qu'il avait interrogé Ibn Shihab sur la parole d'Allah, le Majestueux, le Puissant : \"Ô vous qui avez cru! Quand on appelle à la Salat du jour du Vendredi, accourez à l'invocation d'Allah\" (Sourate 62 verset 9). Ibn Shihab a dit : \"Umar ibn al-Khattab récitait : 'Quand on appelle à la Salat du jour du Vendredi, allez à l'invocation d'Allah'.\" Malik a dit : \"Accourir (S'efforcer) dans le Livre d'Allah n'est que l'acte et l'action. Allah le Béni, l'Exalté, dit 'Dès qu'il tourne le dos, il parcourt la terre' (Sourate 2 verset 205), et Il, l'Exalté, a dit 'Et quant à celui qui vient à toi en s'efforçant' (Sourate 80 verset 8), et Il a dit 'Ensuite il tourna le dos et s'efforça' (Sourate 79 verset 22), et Il a dit 'Vos efforts sont divergents' (Sourate 92 verset 4). Malik a dit : \"Ainsi, l'effort qu'Allah mentionne dans Son Livre n'est pas de courir sur ses pieds ou l'effort physique. Cela signifie seulement l'acte et les actions.\""
    },
    {
        "hadithnumber": 239,
        "text": "Yahya m'a rapporté de Malik, de Yazid ibn Abdullah ibn al-Had, de Muhammad ibn Ibrahim ibn al-Harith at-Taymi, de Abu Salama ibn Abd ar-Rahman ibn Awf, que Abu Hurayra a dit : \"Je suis sorti vers at-Tur (Mont Sinaï) et ai rencontré Kab al-Ahbar et me suis assis avec lui. Il m'a raconté des choses de la Torah et je lui ai raconté des choses du Messager d'Allah, paix et bénédictions sur lui. Parmi les choses que je lui ai racontées, il y avait que le Messager d'Allah, paix et bénédictions sur lui, a dit : 'Le meilleur jour sur lequel le soleil se lève est le jour du vendredi. En ce jour Adam a été créé, et en ce jour il est tombé du Jardin. En ce jour il a été pardonné, et en ce jour il est mort. En ce jour l'Heure survient, et chaque être vivant écoute du matin au coucher du soleil dans la crainte de l'Heure sauf les djinns et les hommes. En ce jour il y a un moment où Allah donne à un serviteur musulman debout en prière tout ce qu'il demande.' Kab dit : 'C'est un jour chaque année.' Je dis : 'Non, chaque vendredi.' Alors Kab récita la Torah et dit : 'Le Messager d'Allah a dit la vérité.' Abu Hurayra continua : \"J'ai rencontré Basram ibn Abi Basra al-Ghiffari et il dit : 'D'où viens-tu ?' Je dis : 'De at-Tur.' Il dit : 'Si je t'avais vu avant que tu partes, tu n'y serais pas allé. J'ai entendu le Messager d'Allah, paix et bénédictions sur lui, dire : \"Ne faites de voyage spécial que vers trois mosquées : la mosquée du Haram (La Mecque), cette mosquée (Médine), et la mosquée de Ilya ou Bayt al-Maqdis (deux noms de Jérusalem).\"'\" (Il n'était pas sûr de l'expression utilisée). Abu Hurayra continua : \"Puis j'ai rencontré Abdullah ibn Salam et je lui ai dit que je m'étais assis avec Kab al-Ahbar, et j'ai mentionné ce que je lui avais raconté sur le jour du vendredi, et lui ai dit que Kab avait dit : 'C'est un jour chaque année.' Abdullah ibn Salam dit : 'Kab a menti,' et j'ajoutai : 'Kab a ensuite récité la Torah et dit : \"Non, c'est chaque vendredi.\" Abdullah ibn Salam dit : 'Kab a dit la vérité.' Puis Abdullah ibn Salam dit : 'Je sais quel moment c'est.'\" Abu Hurayra continua : \"Je lui dis : 'Fais-le moi savoir - ne me le cache pas.' Abdullah ibn Salam dit : 'C'est la dernière période de temps du jour du vendredi.'\" Abu Hurayra continua : \"Je dis : 'Comment cela peut-il être la dernière période de temps du jour du vendredi, alors que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"un serviteur musulman debout en prière\", et c'est un moment où il n'y a pas de prière ?' Abdullah ibn Salam répondit : 'Le Messager d'Allah, paix et bénédictions sur lui, n'a-t-il pas dit : \"Celui qui s'assoit en attendant la prière est en prière jusqu'à ce qu'il prie ?\"' Abu Hurayra ajouta : \"Je dis : 'Bien sûr.' Il dit : 'Alors c'est cela.'\""
    },
    {
        "hadithnumber": 253,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, de son père, que Dhakwan Abu Amr (un esclave appartenant à A'isha, l'épouse du Prophète, paix et bénédictions sur lui, qui fut affranchi par elle après sa mort) avait l'habitude de se tenir en prière et de réciter pour elle pendant le Ramadan."
    },
    {
        "hadithnumber": 254,
        "text": "Yahya m'a rapporté de Malik, de Muhammad ibn al-Munkadir, de Said ibn al-Jubayr, qu'un homme qui a l'approbation (comme rapporteur de hadith) lui a dit que A'isha, l'épouse du Prophète, paix et bénédictions sur lui, a dit : \"Si un homme prie la nuit et que le sommeil le submerge pendant ce temps, Allah écrit pour lui la récompense de sa prière, et son sommeil est une sadaqa pour lui.\""
    },
    {
        "hadithnumber": 263,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, de son père, que A'isha, Mère des Croyants, a dit : \"Le Messager d'Allah, paix et bénédictions sur lui, avait l'habitude de prier treize rakas la nuit et priait ensuite deux rakas lorsqu'il entendait l'adhan pour la prière du subh.\""
    },
    {
        "hadithnumber": 265,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Abi Bakr, de son père, que Abdullah ibn Qays ibn Makhrama lui a dit que Zayd ibn Khalid al-Juhani a dit une nuit qu'il allait observer la prière du Messager d'Allah, paix et bénédictions sur lui. Il dit : \"J'ai posé ma tête sur son seuil. Le Messager d'Allah, paix et bénédictions sur lui, se leva et pria deux longues, longues, longues rakas. Puis il pria deux rakas qui étaient légèrement moins longues que les deux précédentes. Puis il pria deux rakas qui étaient légèrement moins longues que les deux précédentes. Puis il pria deux rakas qui étaient légèrement moins longues que les deux précédentes. Puis il pria deux rakas qui étaient légèrement moins longues que les deux précédentes. Puis il pria deux rakas qui étaient légèrement moins longues que les deux précédentes. Puis il pria une raka impaire, faisant treize rakas en tout.\""
    },
    {
        "hadithnumber": 283,
        "text": "Malik m'a rapporté de Yahya ibn Said que A'isha, l'épouse du Prophète, paix et bénédictions sur lui, a dit : \"Le Messager d'Allah, paix et bénédictions sur lui, avait l'habitude de prier les deux rakas de l'aube (fajr) si rapidement que je me disais 'A-t-il récité la Mère du Coran ou non ?'\""
    },
    {
        "hadithnumber": 296,
        "text": "Yahya m'a rapporté de Malik, de Nafi, qu'un homme demanda à Abdullah ibn Umar : \"Parfois je prie dans ma maison, et ensuite j'attrape la prière avec l'imam. Dois-je prier avec lui ?\" Abdullah ibn Umar lui dit : \"Oui,\" et l'homme dit : \"Laquelle des deux fais-je ma prière ?\" Abdullah ibn Umar dit : \"Est-ce à toi de décider ? C'est à Allah. Il décidera de celle qu'Il veut.\""
    },
    {
        "hadithnumber": 297,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, qu'un homme demanda à Said ibn al-Musayyab : \"Je prie dans ma maison, et ensuite je viens à la mosquée et trouve l'imam en train de prier. Dois-je prier avec lui ?\" Said dit : \"Oui,\" et l'homme dit : \"Laquelle des deux est ma prière ?\" Said dit : \"Es-tu celui qui décide de cela ? C'est à Allah.\""
    },
    {
        "hadithnumber": 334,
        "text": "Yahya m'a rapporté de Malik, de Salih ibn Kaysan, de Urwa ibn az-Zubayr, que A'isha, l'épouse du Prophète, paix et bénédictions sur lui, a dit : \"La prière a été prescrite comme deux rakas, à la fois en résidence et en voyage. Puis la prière du voyage a été maintenue telle quelle, et une augmentation a été faite dans la prière en résidence.\""
    },
    {
        "hadithnumber": 338,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Salim ibn Abdullah, que Abdullah ibn Umar monta vers Dhat an-Nusub et raccourcit la prière pendant le voyage. Malik a dit : \"Il y a quatre étapes postales entre Dhat an-Nusub et Médine.\""
    },
    {
        "hadithnumber": 339,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Ibn Umar, qu'il avait l'habitude de voyager vers Khaybar et qu'il raccourcissait la prière."
    },
    {
        "hadithnumber": 340,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, de Salim ibn Abdullah, que Abdullah ibn Umar avait l'habitude de raccourcir la prière lorsqu'il voyageait pour une journée entière."
    },
    {
        "hadithnumber": 341,
        "text": "Yahya m'a rapporté de Malik, de Nafi, qu'il avait l'habitude de voyager une étape postale avec Ibn Umar, et il ne raccourcissait pas la prière."
    },
    {
        "hadithnumber": 342,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Abdullah ibn Abbas avait l'habitude de raccourcir la prière lorsqu'il voyageait une distance équivalente à celle entre La Mecque et Ta'if, et celle entre La Mecque et Usfan et celle entre La Mecque et Djeddah. Malik a dit : \"C'est quatre étapes postales, et pour moi c'est la distance la plus préférable pour raccourcir la prière.\" Malik a dit : \"Quelqu'un qui a l'intention de voyager ne raccourcit pas la prière tant qu'il n'a pas quitté les maisons du village. Et il ne la fait pas complète tant qu'il n'arrive pas aux premières maisons du village, ou qu'il est à proximité.\""
    },
    {
        "hadithnumber": 348,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar avait l'habitude de prier quatre rakas derrière l'imam à Mina, et quand il priait seul il priait deux rakas."
    },
    {
        "hadithnumber": 356,
        "text": "Yahya m'a rapporté de Malik, de Musa ibn Maysara, de Abu Murra, le mawla de Aqil ibn Abi Talib, que Umm Hani bint Abi Talib lui a dit que l'année de la conquête, le Messager d'Allah, paix et bénédictions sur lui, a prié huit rakas, se couvrant d'un seul vêtement."
    }
]