[
    {
        "hadithnumber": 787,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, de son père, que A'isha, Mère des Croyants, lui a dit : \"Fils de ma sœur, ce n'est que pour dix nuits, alors si tu as une envie de faire quelque chose, laisse-la,\" par quoi elle voulait dire manger du gibier. Malik a dit que si du gibier était chassé pour un homme qui est en ihram et qu'il était préparé pour lui et qu'il en mangeait sachant qu'il avait été chassé pour lui, alors il devait payer un forfait pour tout le gibier qui avait été chassé pour son compte. On demanda à Malik si quelqu'un qui était forcé de manger de la charogne alors qu'il était en ihram devait chasser du gibier et manger cela plutôt que la charogne, et il dit : \"Il est préférable pour lui de manger la charogne, parce qu'Allah, le Béni et Exalté, n'a pas donné la permission à quelqu'un en ihram de manger du gibier ou d'en prendre dans quelque situation que ce soit, mais Il a fait des concessions pour manger de la charogne quand c'est absolument nécessaire.\" Malik a dit : \"Il n'est pas halal pour quiconque, qu'il soit en ihram ou non, de manger du gibier qui a été tué ou sacrifié par quelqu'un en ihram, parce que, qu'il ait été tué délibérément ou par erreur, cela n'a pas été fait d'une manière halal, et donc le manger n'est pas halal. J'ai entendu cela de plus d'une personne. Quelqu'un qui tue du gibier et le mange ensuite n'a qu'à faire une seule kaffara, ce qui est la même chose que pour quelqu'un qui tue du gibier mais n'en mange pas.\""
    },
    {
        "hadithnumber": 788,
        "text": "Malik a dit : \"Il n'est pas halal de manger tout gibier qui a été chassé dans le Haram, ou après lequel un chien a été lancé dans le Haram et qui a ensuite été tué en dehors du Haram. Quiconque fait cela doit payer un forfait pour ce qui a été chassé. Cependant, quelqu'un qui lance son chien après du gibier en dehors du Haram et le suit ensuite jusqu'à ce qu'il soit chassé dans le Haram n'a pas à payer de forfait, à moins qu'il n'ait lancé le chien après le gibier près du Haram. Le gibier ne doit cependant pas être mangé. S'il a lâché le chien près du Haram, alors il doit payer un forfait pour le gibier.\" Malik a dit : \"Allah, le Béni et Exalté, dit : 'Ô vous qui avez cru, ne tuez pas de gibier pendant que vous êtes en état de sacralisation (ihram). Quiconque d'entre vous en tue intentionnellement devra une réparation équivalente à ce qu'il a tué en bétail, jugée par deux hommes intègres parmi vous, offrande destinée à atteindre la Ka'ba, ou bien l'expiation par la nourriture de pauvres ou l'équivalent en jeûne, afin qu'il goûte la conséquence de son acte.' (Sourate 5 verset 95). Malik a dit : \"Quelqu'un qui chasse du gibier quand il n'est pas en ihram et le tue ensuite alors qu'il est en ihram est dans la même position que quelqu'un qui achète du gibier alors qu'il est en ihram et le tue ensuite. Allah a interdit de le tuer, et donc un homme qui le fait doit payer un forfait pour cela. La position que nous suivons en cette matière est qu'un forfait est évalué pour quiconque tue du gibier alors qu'il est en ihram.\" Yahya a dit que Malik a dit : \"Le meilleur de ce que j'ai entendu au sujet de quelqu'un qui tue du gibier et est évalué pour cela est que le gibier qu'il a tué est évalué et sa valeur en nourriture est estimée et avec cette nourriture il nourrit chaque pauvre d'un mudd, ou jeûne un jour à la place de chaque mudd. Le nombre de pauvres est pris en compte, et si c'est dix alors il jeûne dix jours, et si c'est vingt il jeûne vingt jours, selon le nombre de personnes à nourrir, même s'il y en a plus de soixante.\" Malik a dit : \"J'ai entendu qu'un forfait est évalué pour quelqu'un qui tue du gibier dans le Haram alors qu'il n'est pas en ihram de la même manière qu'il est évalué pour quelqu'un qui tue du gibier dans le Haram alors qu'il est en ihram.\" Yahya m'a rapporté de Malik, de Nafi, de Abdullah ibn Umar, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Il y a cinq sortes d'animaux qu'il n'est pas mal pour quelqu'un en ihram de tuer : les corbeaux, les milans, les scorpions, les rats et souris, et les chiens sauvages.\""
    },
    {
        "hadithnumber": 789,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Dinar, de Abdullah ibn Umar, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Il y a cinq (sortes d') animaux qu'il n'est pas mal pour quelqu'un en ihram de tuer : les scorpions, les rats et souris, les corbeaux, les milans et les chiens sauvages.\""
    },
    {
        "hadithnumber": 790,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, de son père, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Il y a cinq intrus qui peuvent être tués dans le Haram : les rats et souris, les scorpions, les corbeaux, les milans et les chiens sauvages.\""
    },
    {
        "hadithnumber": 795,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar n'aimait pas que les gens qui étaient en ihram enlèvent les mites ou les tiques de leurs chameaux. Malik a dit : \"C'est ce que j'aime le plus de ce que j'ai entendu à ce sujet.\""
    },
    {
        "hadithnumber": 800,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, de Salim ibn Abdullah, que Abdullah ibn Umar a dit : \"Quelqu'un qui est retenu d'aller à la Maison par la maladie ne peut sortir de l'ihram qu'après avoir fait le tawaf de la Maison et le sa'y entre Safa et Marwa. S'il est absolument nécessaire pour lui de porter des vêtements ordinaires, ou de subir un traitement médical, il doit le faire et payer une compensation pour cela.\""
    },
    {
        "hadithnumber": 801,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, qu'il avait entendu que A'isha, l'épouse du Prophète, paix et bénédictions sur lui, disait : \"Seule la Maison libère une personne en ihram de l'ihram.\""
    },
    {
        "hadithnumber": 803,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, de Salim ibn Abdullah, que Abdullah ibn Umar a dit : \"Quelqu'un qui est détenu par la maladie avant d'être arrivé à la Maison ne peut quitter l'ihram avant d'avoir fait le tawaf de la Maison et le sa'y entre Safa et Marwa.\""
    },
    {
        "hadithnumber": 804,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, de Sulayman ibn Yasar, que Said ibn Huzaba al-Makhzumi fut jeté de sa monture alors qu'il était en ihram sur la route de La Mecque. Il demanda après la personne responsable du relais de poste où il fut blessé et il y trouva Abdullah ibn Umar, Abdullah ibn az-Zubayr et Marwan ibn al-Hakam. Il leur raconta ce qui lui était arrivé et tous lui dirent qu'il devait prendre tout médicament qu'il avait à prendre et payer une compensation pour cela. Ensuite, quand il irait mieux, il devrait faire une umra et sortir de son ihram, après quoi il devait faire le hajj une autre année et offrir tout animal sacrificiel dont il serait capable à l'avenir. Malik a dit : \"C'est ce que nous faisons ici (à Médine) si quelqu'un est détenu par autre chose qu'un ennemi. Et quand Abu Ayyub al-Ansari et Habbar ibn al-Aswad arrivèrent au jour du sacrifice et avaient manqué le hajj, Umar ibn al-Khattab leur dit de sortir de l'ihram en faisant une umra et ensuite de rentrer chez eux libres de l'ihram et de faire le hajj à un moment futur et de sacrifier un animal, ou, s'ils ne pouvaient pas en trouver un, de jeûner trois jours pendant le hajj et sept jours après être retournés dans leurs familles.\" Malik a dit : \"Quiconque est empêché de faire le hajj après être entré en ihram, que ce soit par la maladie ou autre, ou par une erreur dans le calcul du mois ou parce que la nouvelle lune lui est cachée, est dans la même position que quelqu'un qui est empêché de faire le hajj et doit faire la même chose que lui.\" Yahya a dit que l'on demanda à Malik la situation de quelqu'un de La Mecque qui entrait en ihram pour le hajj et se cassait ensuite un os ou avait une douleur d'estomac sévère, ou d'une femme qui était en travail, et il dit : \"Quelqu'un à qui cela arrive est dans la même situation que celui qui est empêché de faire le hajj, et il doit faire la même chose que les gens des régions éloignées font quand ils sont empêchés de faire le hajj.\" Malik a dit, au sujet de quelqu'un qui arrivait dans les mois du hajj avec l'intention de faire une umra, et complétait sa umra et entrait en ihram à La Mecque pour faire le hajj, et se cassait ensuite un os ou quelque chose d'autre lui arrivait qui l'empêchait d'être présent à Arafa avec tous les autres : \"Je pense qu'il devrait rester où il est jusqu'à ce qu'il aille mieux et ensuite aller en dehors de la zone du Haram, et ensuite retourner à La Mecque et faire le tawaf de la Maison et le sa'y entre Safa et Marwa, et ensuite quitter l'ihram. Il doit ensuite refaire le hajj une autre année et offrir un animal sacrificiel.\" Malik a dit, au sujet de quelqu'un qui quittait l'ihram à La Mecque, et faisait ensuite le tawaf de la Maison et le sa'y entre Safa et Marwa, et tombait ensuite malade et était incapable d'être présent avec tout le monde à Arafa : \"Si le hajj passe quelqu'un, il devrait, s'il le peut, sortir de la zone du Haram et ensuite revenir faire une umra et faire le tawaf de la Maison et le sa'y entre Safa et Marwa, parce qu'il n'avait pas l'intention que son tawaf initial soit pour une umra, et donc pour cette raison il le refait. Il doit faire le hajj suivant et offrir un animal sacrificiel. S'il n'est pas des gens de La Mecque, et que quelque chose lui arrive qui l'empêche de faire le hajj, mais qu'il fait le tawaf de la Maison et le sa'y entre Safa et Marwa, il devrait sortir de l'ihram en faisant une umra et ensuite faire le tawaf de la Maison une deuxième fois, et le sa'y entre Safa et Marwa, parce que son tawaf et sa'y initiaux étaient destinés au hajj. Il doit faire le hajj suivant et offrir un animal sacrificiel.\""
    },
    {
        "hadithnumber": 814,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, que son père a dit que le Messager d'Allah, paix et bénédictions sur lui, a dit une fois à Abd ar-Rahman ibn Awf : \"Que fais-tu, Abu Muhammad, quand tu salues le coin ?\" et Abd ar-Rahman dit : \"Parfois je le salue, et parfois je ne le fais pas.\" Le Messager d'Allah, paix et bénédictions sur lui, dit : \"Tu as raison.\""
    },
    {
        "hadithnumber": 815,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, que son père avait l'habitude de saluer tous les coins quand il faisait le tawaf de la Maison et n'omettait pas le coin Yéménite à moins qu'il n'en fût empêché."
    },
    {
        "hadithnumber": 816,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, de son père, que Umar ibn al-Khattab a dit au coin de la Pierre Noire alors qu'il faisait le tawaf de la Maison : \"Tu n'es qu'une pierre, et si je n'avais pas vu le Messager d'Allah, paix et bénédictions sur lui, t'embrasser, je ne le ferais pas.\" Puis il l'embrassa. Malik a dit : \"J'ai entendu certains des gens de science recommander à quelqu'un faisant le tawaf de la Maison de porter sa main à sa bouche quand il la retire du coin Yéménite.\""
    },
    {
        "hadithnumber": 818,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, de Humayd ibn Abd ar-Rahman ibn Awf, que Abd ar-Rahman ibn Abd al-Qari lui a mentionné qu'il fit une fois le tawaf de la Maison avec Umar ibn al-Khattab après le subh et quand Umar eut fini son tawaf, il regarda et vit que le soleil ne s'était pas encore levé, alors il chevaucha jusqu'à ce qu'il fit agenouiller son chameau à Dhu Tuwa, et il pria deux rakas."
    },
    {
        "hadithnumber": 822,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, que Umar ibn al-Khattab refusa de laisser un homme qui n'avait pas pris congé de la Maison passer adh-Dhahran (une vallée à dix-huit miles de La Mecque) avant qu'il n'ait pris congé d'elle."
    },
    {
        "hadithnumber": 846,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Abdullah ibn Umar, que lorsqu'il amenait un animal à sacrifier de Médine, il le décorait d'une guirlande et le marquait à Dhu'l-Hulayfa, faisant la guirlande avant le marquage, mais faisant les deux au même endroit, tout en faisant face à la qibla. Il décorait l'animal avec deux sandales et le marquait sur son flanc gauche. Il était ensuite conduit avec lui jusqu'à ce qu'il observe la station avec tout le monde à Arafa. Puis il le conduisait avec lui quand tout le monde avançait, et ensuite quand il arrivait à Mina le matin du sacrifice, il sacrifiait l'animal, avant de se raser la tête. Il sacrifiait les animaux de ses propres mains, les alignant debout et faisant face à la qibla. Il mangeait ensuite un peu de la viande, et en donnait une partie."
    },
    {
        "hadithnumber": 847,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar disait, en incisant la bosse de son animal sacrificiel pour le marquer : \"Au nom d'Allah, et Allah est le plus grand.\""
    },
    {
        "hadithnumber": 851,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar disait, au sujet des animaux sacrificiels : \"Des chameaux de six ans, des vaches de trois ans et des moutons, ou plus vieux que cela.\""
    },
    {
        "hadithnumber": 852,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar n'avait jamais l'habitude de déchirer les couvertures de ses animaux sacrificiels, et il ne les couvrait pas avant d'aller de Mina à Arafa."
    },
    {
        "hadithnumber": 854,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, de son père, que l'homme qui était en charge de l'animal sacrificiel du Messager d'Allah, paix et bénédictions sur lui, a dit : \"Messager d'Allah, que dois-je faire avec un animal sacrificiel qui est blessé ?\" Le Messager d'Allah, paix et bénédictions sur lui, lui dit : \"Abats tout animal sacrificiel qui est blessé. Puis jette les guirlandes dans son sang, et ensuite donne aux gens la liberté d'en manger.\""
    },
    {
        "hadithnumber": 859,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu les gens de science dire : \"Quelqu'un qui dédie un animal sacrificiel pour compensation ou comme partie du hajj ne doit pas en manger.\" Yahya m'a rapporté de Malik qu'il avait entendu que Umar ibn al-Khattab et Ali ibn Abi Talib et Abu Hurayra furent interrogés sur un homme qui avait eu des rapports avec sa femme alors qu'il était en ihram pour le hajj. Ils dirent : \"Les deux doivent continuer et compléter leur hajj. Ensuite ils doivent refaire le hajj une autre année, et sacrifier un animal.\" Malik ajouta que Ali ibn Abi Talib a dit : \"Quand ils entrent ensuite en ihram pour le hajj dans une année future, ils doivent rester séparés jusqu'à ce qu'ils aient complété leur hajj.\""
    },
    {
        "hadithnumber": 872,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu l'un des gens de science dire : \"Un homme et sa femme ne doivent pas partager un seul animal sacrificiel. Chacun doit sacrifier un animal séparément.\" On demanda à Malik si quelqu'un à qui on avait confié un animal pour qu'il le sacrifie au hajj, qui entrait en ihram pour la umra, devait le sacrifier quand il sortait de l'ihram ou le reporter pour le sacrifier au moment du hajj alors qu'entre-temps il sortait de l'ihram de sa umra. Il dit : \"Il devrait le reporter pour pouvoir le sacrifier au moment du hajj, et entre-temps sortir de l'ihram de sa umra.\" Malik a dit : \"S'il est jugé que quelqu'un doit offrir un animal pour avoir tué du gibier, ou pour toute autre raison, cet animal ne peut être sacrifié qu'à La Mecque, puisque Allah, le Béni et Exalté, dit : 'une offrande destinée à atteindre la Ka'ba.' Le jeûne ou la sadaqa qui est considéré comme équivalent à l'offre d'un sacrifice peut être fait en dehors de La Mecque, et la personne qui le fait peut le faire où elle veut.\" Yahya m'a rapporté de Malik, de Yahya ibn Said, de Yaqub ibn Khalid al-Makhzumi, que Abu Asma, le mawla de Abdullah ibn Jafar, lui a dit qu'il était avec Abdullah ibn Jafar quand ils partirent une fois de Médine. À as-Suqya, ils passèrent par Husayn ibn Ali, qui était malade à ce moment-là. Abdullah ibn Jafar resta avec lui et ensuite, quand il craignit d'être en retard (pour le hajj), il partit, et envoya chercher Ali ibn Abi Talib et Asma bint Umays à Médine, et ils vinrent à Husayn. Puis Husayn montra sa tête, et Ali dit à quelqu'un de lui raser la tête. Puis il sacrifia un animal pour lui à as-Suqya, tuant un chameau pour lui. Yahya ibn Said ajouta : \"Husayn était parti avec Uthman ibn Affan lors de ce voyage particulier à La Mecque.\""
    },
    {
        "hadithnumber": 876,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, que son père a dit : \"Quelqu'un qui ne se tient pas à Arafa la nuit de Muzdalifa avant que l'aube ne se lève a manqué le hajj, et quelqu'un qui se tient à Arafa la nuit de Muzdalifa avant que l'aube ne se lève a attrapé le hajj.\" Malik a dit, au sujet d'un esclave affranchi pendant le wuquf à Arafa : \"Sa station n'accomplit pas pour lui le hajj de l'Islam, sauf s'il n'était pas en ihram et qu'il est ensuite entré en ihram après avoir été affranchi et qu'il s'est tenu à Arafa cette même nuit avant que l'aube ne se lève, auquel cas c'est suffisant pour lui. Si, cependant, il n'est pas entré en ihram avant que l'aube ne se soit levée, il est dans la même position que quelqu'un qui manque le hajj en n'attrapant pas la station à Arafa avant le lever de l'aube la nuit de Muzdalifa, et il devra faire le hajj de l'Islam plus tard.\""
    },
    {
        "hadithnumber": 880,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu l'un des gens de science désapprouver la lapidation de la jamra avant l'aube le jour du sacrifice, car il était halal pour quiconque avait jeté les pierres de sacrifier. Yahya m'a rapporté de Malik, de Hisham ibn Urwa, que Fatima bint al-Mundhir lui a dit qu'elle voyait Asma bint Abi Bakr à Muzdalifa dire à quiconque dirigeait la prière du subh pour elle et ses compagnons de la prier dès que l'aube se levait, après quoi elle montait et allait à Mina sans s'arrêter du tout."
    },
    {
        "hadithnumber": 882,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar avait l'habitude d'éperonner sa monture au milieu de Muhassir sur la distance d'un jet de pierre."
    },
    {
        "hadithnumber": 888,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, que son père tuait ses animaux sacrificiels pendant qu'ils étaient debout. Malik a dit : \"Personne n'a la permission de se raser la tête avant d'avoir tué son animal sacrificiel, et personne ne doit sacrifier avant l'aube le jour du sacrifice. Les choses qui doivent être faites le jour du sacrifice sont l'abattage, le port des vêtements, le soin du corps en général (at-tafath) et le rasage de la tête, et rien de tout cela ne peut être fait avant le jour du sacrifice.\""
    },
    {
        "hadithnumber": 897,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, de Said ibn al-Musayyab, que Umar ibn al-Khattab a dit : \"Quiconque a tressé ses cheveux, ou les a nattés ou emmêlés doit se raser la tête.\""
    },
    {
        "hadithnumber": 904,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar priait le maghrib et le isha ensemble à Muzdalifa."
    },
    {
        "hadithnumber": 905,
        "text": "Malik a dit que les gens de La Mecque qui font le hajj devraient raccourcir la prière à deux rakas lorsqu'ils sont à Mina jusqu'à ce qu'ils retournent à La Mecque. Yahya m'a rapporté de Malik, de Hisham ibn Urwa, de son père, que le Messager d'Allah, paix et bénédictions sur lui, priait les prières de quatre rakas avec seulement deux rakas lorsqu'il était à Mina, et que Abu Bakr les priait à Mina avec seulement deux rakas, et que Umar ibn al-Khattab les priait à Mina avec seulement deux rakas, et que Uthman les priait à Mina avec seulement deux rakas pendant la moitié de son califat, et ensuite plus tard les complétait."
    },
    {
        "hadithnumber": 907,
        "text": "Yahya m'a rapporté de Malik, de Zayd ibn Aslam, de son père, que Umar ibn al-Khattab pria deux rakas avec les gens de La Mecque, et ensuite, quand il eut fini, il dit : \"Gens de La Mecque, complétez votre prière, parce que nous sommes un groupe de voyageurs.\" Plus tard, Umar pria deux rakas avec eux à Mina, mais nous n'avons pas entendu qu'il leur ait dit quoi que ce soit à cette occasion. On demanda à Malik si les gens de La Mecque devaient prier deux rakas à Arafa ou quatre, et si l'émir du hajj, s'il était mecquois, devait prier le dhuhr et le asr avec quatre rakas ou deux, et aussi comment les gens de La Mecque qui vivaient (à Mina) devaient prier, et il dit : \"Les gens de La Mecque ne devraient prier que deux rakas à Arafa et Mina tant qu'ils y séjournent, et devraient raccourcir la prière jusqu'à ce qu'ils retournent à La Mecque. L'émir du hajj, s'il est mecquois, devrait aussi raccourcir la prière à Arafa et pendant les jours de Mina. Quiconque vit à Mina en tant que résident devrait faire la prière complète à Mina, et de même quiconque vit à Arafa et y est résident devrait faire la prière complète à Arafa.\""
    },
    {
        "hadithnumber": 908,
        "text": "Yahya m'a rapporté que Malik a dit : \"Quelqu'un qui vient à La Mecque à ou avant la nouvelle lune de Dhu'l-Hijja et entre en ihram pour le hajj devrait faire la prière complète jusqu'à ce qu'il quitte La Mecque pour Mina, et ensuite il devrait raccourcir la prière. C'est parce qu'il a décidé d'y rester plus de quatre nuits.\" Yahya m'a rapporté de Malik, de Yahya ibn Said, qu'il avait entendu que le jour après le jour du sacrifice, Umar ibn al-Khattab sortit un peu après le lever du soleil et dit le takbir, et tout le monde le répéta après lui. Puis il sortit une deuxième fois le même jour quand le soleil était bien haut et dit le takbir, et tout le monde le répéta après lui. Puis il sortit une troisième fois après midi et dit le takbir, et tout le monde le répéta après lui jusqu'à ce que cela résonne de groupe en groupe jusqu'à ce que cela atteigne la Maison et que les gens sachent que Umar était parti jeter les pierres. Malik a dit : \"Ce que nous faisons ici (à Médine) est de dire le takbir pendant les jours de tashriq après chaque prière. La première fois est quand l'imam et tout le monde avec lui dit le takbir après la prière du dhuhr le jour du sacrifice, et la dernière est quand l'imam et tout le monde avec lui dit le takbir après le subh le dernier des jours de tashriq, après quoi il arrête de dire le takbir.\" Malik a dit : \"Les takbirs pendant les jours de tashriq devraient être faits par les hommes et les femmes, qu'ils soient en groupe ou seuls, à Mina ou ailleurs, et tous les takbirs devraient être faits. En cela, tout le monde suit l'imam du hajj et les gens à Mina, parce que quand tout le monde retourne (à La Mecque) et sort de l'ihram, ils gardent les mêmes personnes comme imams tout en étant hors d'ihram (comme ils le faisaient quand ils étaient en ihram). Quelqu'un qui ne fait pas le hajj ne les suit pas sauf pour les takbirs pendant les jours de tashriq.\" Malik a dit : \"Le 'nombre limité de jours' sont les jours de tashriq.\""
    }
]