[
    {
        "hadithnumber": 1317,
        "text": "Yahya m'a rapporté de Malik, de Musa ibn Abi Tamim, de Abu'l-Hubab Said ibn Yasar, de Abu Hurayra, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Un dinar pour un dinar, un dirham pour un dirham, pas d'excès entre les deux.\""
    },
    {
        "hadithnumber": 1318,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Abu Said al-Khudri, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Ne vendez pas l'or pour l'or sauf semblable pour semblable et n'augmentez pas une partie sur une autre. Ne vendez pas l'argent pour l'argent, sauf semblable pour semblable et n'augmentez pas une partie sur une autre. Ne vendez pas une partie qui n'est pas là pour une partie qui l'est.\""
    },
    {
        "hadithnumber": 1322,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Abdullah ibn Umar, que Umar ibn al-Khattab a dit : \"Ne vendez pas l'or pour l'or sauf semblable pour semblable, et n'augmentez pas une partie sur une autre. Ne vendez pas l'argent pour l'argent sauf semblable pour semblable, et n'augmentez pas une partie sur une autre. Ne vendez pas l'argent pour l'or, l'un d'eux à portée de main et l'autre à donner plus tard. Si quelqu'un cherche à retarder le paiement jusqu'à ce qu'il ait été chez lui, ne le quittez pas. Je crains pour vous le rama.\" Le rama est l'usure."
    },
    {
        "hadithnumber": 1323,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Dinar, de Abdullah ibn Umar, que Umar ibn al-Khattab a dit : \"Ne vendez pas l'or pour l'or sauf semblable pour semblable. N'augmentez pas une partie sur une autre. Ne vendez pas l'argent pour l'argent sauf semblable pour semblable, et n'augmentez pas une partie sur une autre. Ne vendez pas une partie qui est là pour une partie qui n'est pas là. Si quelqu'un vous demande d'attendre pour le paiement jusqu'à ce qu'il ait été chez lui, ne le quittez pas. Je crains pour vous le rama.\" Le rama est l'usure."
    },
    {
        "hadithnumber": 1325,
        "text": "Yahya m'a rapporté de Malik que Abu'z-Zinad a entendu Said ibn al-Musayyab dire : \"Il n'y a d'usure que dans l'or ou l'argent ou ce qui est pesé ou mesuré de ce qui est mangé ou bu.\""
    },
    {
        "hadithnumber": 1328,
        "text": "Yahya m'a rapporté de Malik que Yazid ibn Abdullah ibn Qusayt a vu Said ibn al-Musayyab vendre de l'or en contrepoids pour de l'or. Il versa son or dans un plateau de la balance, et l'homme avec qui il faisait le contrepoids mit son or dans l'autre plateau de la balance et quand l'aiguille de la balance fut à l'équilibre, ils prirent et donnèrent. Malik a dit : \"Selon la manière dont les choses sont faites parmi nous, il n'y a pas de mal à vendre de l'or pour de l'or, et de l'argent pour de l'argent par poids en contrepoids, même si 11 dinars sont pris pour 10 dinars de la main à la main, quand le poids de l'or est égal, pièce pour pièce, même si le nombre est différent. Les dirhams dans une telle situation sont traités de la même manière que les dinars.\" Malik a dit : \"Si, en contrebalançant de l'or pour de l'or ou de l'argent pour de l'argent, il y a une différence de poids, une partie ne doit pas donner à l'autre la valeur de la différence en argent ou autre chose. Une telle transaction est vilaine et un moyen vers l'usure parce que si l'une des parties était autorisée à prendre la différence pour un prix séparé, ce pourrait être comme s'il l'avait achetée séparément, donc il serait autorisé. Alors il lui serait possible de demander plusieurs fois la valeur de la différence afin de permettre la conclusion de la transaction entre les deux parties.\" Malik a dit : \"S'il avait vraiment vendu la différence sans rien d'autre avec, il ne l'aurait pas prise pour un dixième du prix pour lequel il l'a prise afin de mettre une 'façade légale' sur la transaction. Cela conduit à permettre ce qui est interdit. L'affaire est interdite.\" Malik a dit qu'il n'était pas bon lors du contrepoids de donner de bonnes vieilles pièces d'or et de mettre avec elles de l'or non frappé en échange d'or kufique usé, qui était impopulaire et de traiter ensuite l'échange comme semblable pour semblable. Malik a dit : \"Le commentaire sur pourquoi cela est désapprouvé est que le propriétaire du bon or utilise l'excellence de ses vieilles pièces d'or comme excuse pour jeter l'or non frappé avec. N'eût été la supériorité de son or (bon) sur l'or de l'autre partie, l'autre partie n'aurait pas contrebalancé l'or non frappé pour son or kufique, et le marché aurait été refusé. C'est comme un homme voulant acheter trois sa de dattes séchées ajwa pour deux sa et un mudd de dattes kabis, et s'entendant dire que ce n'était pas bon, offrant alors deux sa de kabis et un sa de dattes pauvres désirant rendre la vente possible. Ce n'est pas bon parce que le propriétaire de l'ajwa ne devrait pas lui donner un sa d'ajwa pour un sa de dattes pauvres. Il ne lui donnerait cela qu'à cause de l'excellence des dattes kabis. Ou c'est comme un homme demandant à quelqu'un de lui vendre trois sa de blé blanc pour deux sa et demi de blé syrien, et s'entendant dire que ce n'était pas bon sauf semblable pour semblable, et offrant ainsi deux sa de blé et un sa d'orge ayant l'intention de rendre la vente possible entre eux. Ce n'est pas bon parce que personne n'aurait donné un sa d'orge pour un sa de blé blanc si ce sa avait été seul. Il n'a été donné qu'à cause de l'excellence du blé syrien sur le blé blanc. Ce n'est pas bon. C'est la même chose que le cas de l'or non frappé.\" Malik a dit : \"Là où l'or, l'argent et la nourriture, choses qui ne devraient être vendues que semblable pour semblable, sont concernés, quelque chose de détesté et de pauvre qualité ne doit pas être mis avec quelque chose de bon et désirable afin de rendre la vente possible et de rendre une mauvaise situation halal. Quand quelque chose de qualité désirable est mis avec quelque chose de pauvre qualité et qu'il n'est inclus que pour que son excellence en qualité soit remarquée, quelque chose est vendu qui s'il avait été vendu seul, n'aurait pas été accepté et auquel l'acheteur n'aurait prêté aucune attention. Il n'est accepté par l'acheteur qu'à cause de la supériorité de ce qui vient avec sur ses propres biens. Les transactions impliquant l'or, l'argent, ou la nourriture, ne doivent rien avoir de cette description qui entre en elles. Si le propriétaire des biens de pauvre qualité veut les vendre, il les vend seuls, et ne met rien avec eux. Il n'y a pas de mal si c'est comme ça.\""
    },
    {
        "hadithnumber": 1330,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Dinar, de Abdullah ibn Umar, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Quelqu'un qui achète de la nourriture, ne doit pas la vendre avant d'en prendre possession.\""
    },
    {
        "hadithnumber": 1334,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu qu'un homme voulait acheter de la nourriture à un homme à l'avance. L'homme qui voulait lui vendre la nourriture alla avec lui au marché, et il commença à lui montrer des tas, disant : \"Lequel voudrais-tu que j'achète pour toi ?\" L'acheteur lui dit : \"Me vends-tu ce que tu n'as pas ?\" Alors ils vinrent à Abdullah ibn Umar et lui mentionnèrent cela. Abdullah ibn Umar dit à l'acheteur : \"N'achète pas de lui ce qu'il n'a pas.\" Il dit au vendeur : \"Ne vends pas ce que tu n'as pas.\""
    },
    {
        "hadithnumber": 1336,
        "text": "Yahya m'a rapporté de Malik que Abu'z-Zinad a entendu Said ibn al-Musayyab et Sulayman ibn Yasar interdire à un homme de vendre du blé pour de l'or à terme et ensuite d'acheter des dattes séchées avec l'or avant d'avoir pris livraison de l'or."
    },
    {
        "hadithnumber": 1339,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar disait qu'il n'y avait pas de mal à ce qu'un man fasse une avance à un autre homme pour de la nourriture, avec une description et un prix fixés jusqu'à une date fixée, tant que ce n'était pas dans des cultures, ou des dattes qui n'avaient pas commencé à mûrir. Malik a dit : \"La manière de faire les choses parmi nous concernant quelqu'un qui fait une avance pour des denrées alimentaires à un taux connu jusqu'à une date déclarée, et la date arrive et il trouve qu'il n'y a pas assez de ce qu'on lui a vendu avec le vendeur pour remplir sa commande, et donc il révoque la vente, est qu'il doit seulement reprendre l'argent, l'or, ou le prix qu'il a payé exactement. Il n'achète rien d'autre de l'homme pour le même prix jusqu'à ce qu'il ait récupéré ce qu'il a payé. C'est parce que s'il prenait autre chose en plus du prix qu'il lui a payé ou l'échangeait pour des biens autres que les biens qu'il a achetés de lui, ce serait vendre de la nourriture avant d'en obtenir la livraison.\" Malik a dit : \"Le Messager d'Allah, paix et bénédictions sur lui, a interdit de vendre de la nourriture avant d'en obtenir la livraison.\" Malik a dit qu'il n'était pas bon si l'acheteur regrettait son achat et demandait au vendeur de révoquer la vente pour lui et qu'il ne le presserait pas immédiatement pour ce qu'il avait payé. Les gens de science interdisaient cela. C'était parce que quand la nourriture était rendue prête pour l'acheteur par le vendeur, l'acheteur différait son dû du vendeur afin qu'il puisse révoquer la vente pour lui. C'était la vente de nourriture avec des termes retardés avant de prendre livraison de la nourriture. Malik a dit : \"L'explication de cela est que quand la date de livraison arrive et que l'acheteur n'aime pas la nourriture, le vendeur prend par elle de l'argent à payer plus tard et donc ce n'est pas une révocation. La révocation est celle dans laquelle ni l'acheteur ni le vendeur n'est augmenté. Quand l'augmentation se produit par report de paiement pour une période de temps, ou par quoi que ce soit qui augmente l'un d'eux sur l'autre ou quoi que ce soit qui donne à l'un d'eux un profit, ce n'est pas une révocation. Quand l'un ou l'autre fait cela, la révocation devient une vente. Il y a une indulgence pour la révocation, le partenariat, et le transfert, tant que l'augmentation, la diminution, ou le report n'entrent pas en eux. Si l'augmentation, la diminution, ou le report entrent en elle, elle devient une vente. Tout ce qui rend une vente halal la rend halal et tout ce qui rend une vente haram la rend haram.\" Malik a dit : \"Si quelqu'un paie à l'avance pour du blé syrien, il n'y a pas de mal s'il prend une charge après que le terme tombe dû.\" Malik a dit : \"C'est la même chose avec quiconque avance pour n'importe quel genre de chose. Il n'y a pas de mal à ce qu'il prenne mieux que ce pour quoi il a fait une avance ou pire que cela après la date de livraison convenue. L'explication de cela est que si, par exemple, un homme avance pour un certain poids de blé. Il n'y a pas de mal s'il décide de prendre de l'orge ou du blé syrien. S'il a fait une avance pour de bonnes dattes, il n'y a pas de mal s'il décide de prendre des dattes de pauvre qualité. S'il a payé à l'avance pour des raisins secs rouges, il n'y a pas de mal s'il prend des noirs, quand cela arrive après la date de livraison convenue, et quand la mesure de ce qu'il prend est comme la mesure de ce pour quoi il a payé à l'avance.\""
    },
    {
        "hadithnumber": 1340,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Sulayman ibn Yasar a dit : \"Le fourrage des ânes de Saad ibn Abi Waqqas s'épuisa et donc il dit à son esclave de prendre une partie du blé de la famille et d'acheter de l'orge avec, et de ne prendre qu'une quantité semblable.\""
    },
    {
        "hadithnumber": 1341,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Sulayman ibn Yasar lui a dit qu'une fois le fourrage des animaux de Abd ar-Rahman ibn al-Aswad ibn Abd Yaghuth était fini alors il dit à son esclave : \"Prends une partie du blé de ta famille comme nourriture et achète avec de l'orge, et ne prends qu'une quantité semblable.\""
    },
    {
        "hadithnumber": 1345,
        "text": "Malik a dit : \"Un autre exemple de cela est que le Messager d'Allah, paix et bénédictions sur lui, a interdit la vente appelée muzabana et a accordé une indulgence dans l'ariya pour calculer l'équivalent en dattes. Il a été distingué entre elles que la vente muzabana était basée sur la perspicacité et le commerce, et la vente ariya était basée sur une faveur rendue, et il n'y avait pas de perspicacité en elle.\" Malik a dit : \"Un homme ne doit pas acheter de la nourriture pour un quart, un tiers, ou une fraction d'un dirham sur la base qu'on lui donne cette nourriture à crédit. Il n'y a pas de mal à ce qu'un homme achète de la nourriture pour une fraction d'un dirham à crédit et ensuite il donne un dirham et prend des marchandises avec ce qui reste de son dirham parce qu'il a donné la fraction qu'il devait comme argent, et a pris des marchandises pour compléter le reste de son dirham. Il n'y a pas de mal dans cette transaction.\" Malik a dit : \"Il n'y a pas de mal à ce qu'un homme place un dirham avec un autre homme et ensuite prenne de lui des marchandises connues pour un quart, un tiers, ou une fraction connue. S'il n'y avait pas de prix connu sur les marchandises et que l'homme disait : 'Je les prendrai de toi pour le prix de chaque jour,' ce n'est pas halal parce qu'il y a de l'incertitude. Cela pourrait être moins une fois, et plus une autre fois, et ils ne se sépareraient pas avec une vente connue.\" Malik a dit : \"Si quelqu'un vend de la nourriture sans mesurer précisément et n'en exclut rien de la vente et qu'ensuite il lui vient à l'esprit d'en acheter une partie, il n'est pas bon pour lui d'en acheter une partie sauf ce qu'il lui serait permis d'en exclure. C'est un tiers ou moins. Si c'est plus d'un tiers, cela devient de la muzabana et est désapprouvé. Il ne doit acheter que de ce qu'il lui serait permis d'exclure, et il n'est permis d'exclure qu'un tiers ou moins que cela. C'est la manière de faire les choses dans laquelle il n'y a pas de dispute chez nous.\" Yahya m'a rapporté de Malik qu'il avait entendu que Umar ibn al-Khattab a dit : \"Il n'y a pas d'accaparement dans notre marché, et les hommes qui ont de l'or en excès dans leurs mains ne devraient pas acheter une des provisions d'Allah qu'il a envoyée à notre cour et ensuite l'accaparer contre nous. Quelqu'un qui apporte des marchandises importées à travers une grande fatigue pour lui-même en été et en hiver, cette personne est l'invité de Umar. Qu'il vende ce qu'Allah veut et garde ce qu'Allah veut.\""
    },
    {
        "hadithnumber": 1347,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Uthman ibn Affan interdisait l'accaparement."
    }
]