[
    {
        "hadithnumber": 6144,
        "text": "Ce hadith a été rapporté sous l'autorité de 'A'isha à travers une autre chaîne de transmetteurs."
    },
    {
        "hadithnumber": 5637,
        "text": "Ce hadith a été transmis sous l'autorité de 'Abdullah b. Harith avec une légère variation de formulation."
    },
    {
        "hadithnumber": 6701,
        "text": "Ne devrais-je pas vous diriger vers les paroles des trésors du Paradis, ou il a dit : Comme un trésor des trésors du Paradis ? J'ai dit : bien sûr, fais-le. Sur ce, il dit : « Il n'y a de force ni de puissance que celle d'Allah. »"
    },
    {
        "hadithnumber": 6702,
        "text": "Apprenez-moi une supplication que je dois réciter dans ma prière. Sur ce, il (le Saint Prophète) dit : Récitez : « Ô Allah, je me suis fait un grand tort. » Selon Qutaiba (les mots étaient : ) beaucoup (faux) - il n'y a personne pour pardonner les péchés à part Toi seul, dis : \" Accorde-moi le pardon de Toi-même, aie pitié de moi car Tu es très Pardonneur et Compatissant. \""
    },
    {
        "hadithnumber": 7256,
        "text": "Ô Allah, accorde à la famille de Muhammad la subsistance qui est une simple subsistance."
    },
    {
        "hadithnumber": 92,
        "text": "Le sommet de l'incrédulité est vers l'Est et l'orgueil et l'orgueil se trouvent parmi les propriétaires de chevaux et de chameaux qui sont grossiers et incivils, les gens des tentes, et la tranquillité se trouve parmi ceux qui élèvent des chèvres et des moutons."
    },
    {
        "hadithnumber": 5214,
        "text": "\"Le meilleur condiment.\" Et il n'a pas douté (de ce mot)."
    },
    {
        "hadithnumber": 1648,
        "text": "Faites du Witr la fin de votre prière nocturne."
    },
    {
        "hadithnumber": 637,
        "text": "Moi et le Messager d'Allah (ﷺ) avons pris un bain dans un récipient qui était placé entre moi et lui et il passait devant moi, de sorte que je disais : Épargnez-moi (un peu d'eau), épargnez-moi (un peu d'eau) ; et elle a dit qu'ils avaient eu des rapports sexuels."
    },
    {
        "hadithnumber": 638,
        "text": "Maimuna (l'épouse du Saint Prophète) m'a rapporté qu'elle et le Messager d'Allah (ﷺ) avaient pris un bain dans un même récipient."
    },
    {
        "hadithnumber": 128,
        "text": "Abou Bakr b. Abu Shaiba a rapporté un hadith comme celui-ci de la part de l'Apôtre (que la paix et la bénédiction soient sur lui) sous l'autorité d'Abdallah."
    },
    {
        "hadithnumber": 7301,
        "text": "Un tel a éternué et vous avez dit : Qu'Allah vous fasse miséricorde. J'ai aussi éternué mais tu n'as pas prononcé ces mots pour moi. Sur ce, il (le Saint Prophète) dit : Cette personne a loué Allah, et vous n'avez pas loué Allah."
    },
    {
        "hadithnumber": 6792,
        "text": "Je vous cachais une chose que j'avais entendue du Messager d'Allah (ﷺ) et j'ai entendu le Messager d'Allah (ﷺ) dire : Si vous n'aviez pas commis de péchés, Allah aurait fait exister une création qui aurait commis des péchés (et Allah) les aurait pardonnés."
    },
    {
        "hadithnumber": 7325,
        "text": "There lived a king before you and he had a (court) magician. As he (the magician) grew old, he said to the king: I have grown old, send some young boy to me so that I should teach him magic. He (the king) sent to him a young man so that he should train him (in magic). And on his way (to the magician) he (the young man) found a monk sitting there. He (the young man) listened to his (the monk's) talk and was impressed by it. It became his habit that on his way to the magician he met the monk and set there and he came to the magician (late). He (the magician) beat him because of delay. He made a complaint of that to the monk and he said to him: When you feel afraid of the magician, say: Members of my family had detained me. And when you feel afraid of your family you should say: The magician had detained me. It so happened that there came a huge beast (of prey) and it blocked the way of the people, and he (the young boy) said: I will come to know today whether the magician is superior or the monk is superior. He picked up a stone and said: O Allah, if the affair of the monk is dearer to Thee than the affair of the magician, cause death to this animal so that the people should be able to move about freely. He threw that stone towards it and killed it and the people began to move about (on the path freely). He (the young man) then came to that monk and Informed him and the monk said: Sonny, today you are superior to me. Your affair has come to a stage where I find that you would be soon put to a trial, and in case you are put to a trial don't give my clue. That young man began to treat the blind and those suffering from leprosy and he in fact began to cure people from (all kinds) of illness. When a companion of the king who had gone blind heard about him, he came to him with numerous gifts and said: If you cure me all these things collected together here would be yours. Be said: I myself do not cure anyone. It is Allah Who cures and if you affirm faith in Allah, I shall also supplicate Allah to cure you. \nHe affirmed his faith in Allah and Allah cured him and he came to the king and sat by his side as he used to sit before. The king said to him: Who restored your eyesight? He said: My Lord. Thereupon he said: It means that your Lord is One besides me. He said: My Lord and your Lord is Allah, so he (the king) took hold of him and tormented him till he gave a clue of that boy. The young man was thus summoned and the king said to him: O boy, it has been conveyed to me that you have become so much proficient in your magic that you cure the blind and those suffering from leprosy and you do such and such things. Thereupon he said: I do not cure anyone; it is Allah Who cures, and he (the king) took hold of him and began to torment him. So he gave a clue of the monk. The monk was thus summoned and it was said to him: You should turn back from your religion. He, however, refused to do so. He (ordered) for a saw to be brought (and when it was done) he (the king) placed it in the middle of his head and tore it into parts till a part fell down. Then the courtier of the king was brought and it was said to him: Turn back from your religion. Arid he refused to do so, and the saw was placed in the midst of his head and it was torn till a part fell down. Then that young boy was brought and it was said to him: Turn back from your religion. He refused to do so and he was handed over to a group of his courtiers. And he 'said to them: Take him to such and such mountain; make him climb up that mountain and when you reach its top (ask him to renounce his faith) but if he refuses to do so, then throw him (down the mountain). So they took him and made him climb up the mountain and he said: O Allah, save me from them (in any way) Thou likest and the mountain began to quake and they all fell down and that person came walking to the king. The king said to him: What has happened to your companions? He said: Allah has saved me from them. He again handed him to some of his courtiers and said: Take him and carry him in a small boat and when you reach the middle of the ocean (ask him to renounce) his religion, but if he does not renounce his religion throw him (into the water). \nSo they took him and he said: O Allah, save me from them and what they want to do. It was quite soon that the boat turned over and they were drowned and he came walking to the king, and the king said to him: What has happened to your companions? He said: Allah has saved me from them, and he said to the king: You cannot kill me until you do what I ask you to do. And he said: What is that? He said: You should gather people in a plain and hang me by the trunk (of a tree). Then take hold of an arrow from the quiver and say: In the name of Allah, the Lord of the young boy; then shoot an arrow and if you do that then you would be able to kill me. So he (the king) called the people in an open plain and tied him (the boy) to the trunk of a tree, then he took hold of an arrow from his quiver and then placed the arrow in the bow and then said: In the name of Allah, the Lord of the young boy; he then shot an arrow and it bit his temple. He (the boy) placed his hands upon the temple where the arrow had bit him and he died and the people said: We affirm our faith in the Lord of this young man, we affirm our faith in the Lord of this young man, we affirm our faith in the Lord of this young man. The courtiers came to the king and it was said to him: Do you see that Allah has actually done what you aimed at averting. They (the people) have affirmed their faith in the Lord. He (the king) commanded ditches to be dug at important points in the path. When these ditches were dug, and the fire was lit in them it was said (to the people): He who would not turn back from his (boy's) religion would be thrown in the fire or it would be said to them to jump in that. (The people courted death but did not renounce religion) till a woman came with her child and she felt hesitant in jumping into the fire and the child said to her: 0 mother, endure (this ordeal) for it is the Truth."
    },
    {
        "hadithnumber": 7329,
        "text": "C'est ce qu'Abu Huraira nous a rapporté du Messager d'Allah (ﷺ) et à ce propos, il a rapporté certains des hadiths et le Messager d'Allah (ﷺ) a dit : Il a été dit au peuple d'Israël : Entrez dans ce pays en disant Hitta (Retirez-nous le fardeau de nos péchés), sur quoi Nous vous pardonnerions vos péchés, mais ils se sont tordus (cette déclaration) et sont entrés dans la porte en traînant sur leur culasse et ont dit : « Le grain dans l'épi »."
    },
    {
        "hadithnumber": 7330,
        "text": "Anas b. Malik a rapporté qu'Allah, l'Exalté et le Glorieux, a envoyé une révélation au Messager d'Allah (ﷺ) juste avant sa mort, en succession rapide jusqu'à ce qu'il parte pour sa demeure céleste, et le jour de sa mort, il a reçu la révélation abondamment."
    },
    {
        "hadithnumber": 7331,
        "text": "Vous récitez un verset qui, s'il avait été révélé par rapport à nous, nous aurions pris ce jour comme le jour de la réjouissance. Sur ce, 'Umar dit : Je sais où cela a été révélé et le jour où il a été révélé et où se trouvait le Messager d'Allah (ﷺ) à ce moment-là où il a été révélé. Il a été révélé le jour de 'Arafa (le neuvième de Dhu'l Hijjah) et le Messager d'Allah (ﷺ) séjournait à 'Arafat. Sufyan a dit : Je doute que ce soit vendredi ou non (et le verset auquel il fait référence) est le suivant : « Aujourd'hui, j'ai perfectionné votre religion pour vous et j'ai complété mes faveurs envers vous » (v. 4)."
    },
    {
        "hadithnumber": 7332,
        "text": "Si ce verset avait été révélé en relation avec les Juifs (c'est-à-dire \"Aujourd'hui, j'ai perfectionné votre religion pour vous, j'ai complété mes faveurs pour vous et j'ai choisi pour vous l'Islam comme religion\"), nous aurions pris le jour de réjouissance où ce verset a été révélé. Sur ce, 'Umar dit : Je connais le jour où cela a été révélé et l'heure à laquelle cela a été révélé et où se trouvait le Messager d'Allah (ﷺ) quand cela a été révélé. Cela a été révélé dans la nuit de vendredi et nous étions à 'Arafat avec le Messager d'Allah (ﷺ) à ce moment-là."
    },
    {
        "hadithnumber": 7333,
        "text": "Commandeur des Fidèles, il y a un verset dans votre Livre que vous récitez. Si cela avait été révélé à propos des Juifs, nous l’aurions considéré comme un jour de réjouissance. Alors il dit : De quel verset parlez-vous ? Il répondit : \"Aujourd'hui, j'ai perfectionné votre religion pour vous et j'ai complété mes faveurs envers vous et j'ai choisi l'Islam comme religion pour vous.\" Umar a dit : Je connais le jour où cela a été révélé et l'endroit où cela a été révélé. Cela a été révélé au Messager d'Allah (ﷺ) à 'Arafat vendredi."
    },
    {
        "hadithnumber": 7334,
        "text": "\" Si vous craignez de ne pas pouvoir maintenir l'équité entre les filles orphelines, alors épousez (celles) que vous aimez parmi les femmes deux, trois ou quatre. \" Elle dit : Ô, le fils de ma sœur, l'orpheline est celle qui est sous la protection de son tuteur et elle partage avec lui ses biens et ses biens et sa beauté le fascinent et son tuteur décide de l'épouser sans lui donner la part qui lui revient de l'argent du mariage et n'est pas prêt (à payer autant de montant) que quelqu'un d'autre est prêt à payer et donc Allah a interdit d'épouser ces filles mais dans le cas où l'équité est observée en ce qui concerne l'argent du mariage et ils sont prêts à leur payer la totalité du montant de l'argent du mariage et Allah ordonné d'épouser d'autres femmes qu'elles selon le goût de leur cœur. 'Urwa a rapporté que 'A'isha a dit que les gens ont commencé à demander le verdict du Messager d'Allah (ﷺ) après la révélation de ce verset à leur sujet (les orphelines) et Allah, l'Exalté et le Glorieux, a révélé ce verset : \"Ils t'ont demandé un verdict sur les femmes ; dis : Allah te rend le jugement à leur sujet et sur ce qui t'est récité dans le Livre sur la femme orpheline, à qui tu ne donnes pas ce qui leur est ordonné alors que tu aimes les épouser.\" (iv. 126). Elle dit : La parole d'Allah « ce qui vous est récité » dans le Livre signifie le premier verset, i. e. \"Si vous craignez de ne pas pouvoir respecter l'équité dans le cas d'une femme orpheline, épousez ce que vous voudrez dans le cas d'une femme\" (iv. 3). 'A'isha a dit : (Et quant à ce verset, c'est-à-dire et vous avez l'intention \"d'épouser l'une d'elles parmi les filles orphelines\", il se rapporte à celle qui s'occupe (des orphelins) ayant peu de richesse et moins de beauté et il leur a été interdit d'épouser ce qu'ils aiment de sa richesse et de sa beauté parmi les filles orphelines, mais avec équité, à cause de leur aversion pour elles."
    },
    {
        "hadithnumber": 7335,
        "text": "\" Si vous craignez de ne pas pouvoir observer l'équité en cas d'orphelines\" ; le reste du hadith est le même mais avec une légère variation de formulation."
    },
    {
        "hadithnumber": 7336,
        "text": "\"Si vous craignez de ne pas pouvoir respecter l'équité dans le cas des orphelines),\" a-t-il été révélé en référence à une personne qui avait une orpheline (comme pupille) et il était son tuteur et son héritier, et elle possédait des biens, mais il n'y avait personne pour lutter en son nom sauf elle-même. Et il (son tuteur) ne l'a pas donnée en mariage à cause de ses biens et il l'a torturée et maltraitée, c'est par rapport à elle que (Allah a dit : ) \" Si vous craignez de ne pas pouvoir observer l'équité dans le cas des orphelines, alors épousez celle que vous aimez parmi les femmes \", c'est-à-dire. e. tout ce que je vous ai rendu licite et laissez celle que vous torturez."
    },
    {
        "hadithnumber": 7337,
        "text": "\"Ce qui vous est récité dans le Livre sur les orphelines à qui vous ne donnez pas ce qui leur est ordonné, alors que vous aimez les épouser\", cela a été révélé à propos d'une orpheline qui était à la charge de la personne et partageait avec lui ses biens et il hésitait à l'épouser lui-même et ne voulait pas non plus la marier à quelqu'un d'autre (craignant) que (cette personne) partagerait ses biens (en tant que mari de cette fille), l'empêchant de se marier, ni de l'épouser lui-même ni la marier à une autre personne."
    },
    {
        "hadithnumber": 7338,
        "text": "\" Ils te demandent le verdict religieux sur les femmes, dis : Allah te donne le verdict à leur sujet \" (iv. 126), qu'il s'agit d'une orpheline qui est à la charge de la personne et qu'elle partage avec lui ses biens (en tant qu'héritière) même dans les palmiers dattiers et qu'il hésite à donner sa main en mariage à toute autre personne de peur qu'il (son mari) ne partage ses biens, et ainsi la maintienne dans un état persistant."
    },
    {
        "hadithnumber": 7339,
        "text": "\"Et celui qui est pauvre, qu'il en retire raisonnablement\", a-t-il été révélé à propos du gardien des biens d'une orpheline, qui a soin d'elle et prend soin d'elle ; S'il est pauvre, il est autorisé à manger avec cela."
    },
    {
        "hadithnumber": 7340,
        "text": "« Celui qui est riche doit s'abstenir, et celui qui est pauvre peut raisonnablement en manger » que cela a été révélé à propos du tuteur d'un orphelin pauvre ; il peut en tirer ce qui est raisonnable compte tenu de son propre état de solvabilité."
    },
    {
        "hadithnumber": 7341,
        "text": "Ce hadith a été rapporté sous l'autorité de Hisham avec la même chaîne de transmetteurs."
    },
    {
        "hadithnumber": 7342,
        "text": "\"Quand ils sont venus sur vous d'en haut et d'en bas, et quand les yeux sont devenus ternes et les cœurs sont montés jusqu'à la gorge\" (xxxiii, 10) se rapporte au jour du Fossé."
    },
    {
        "hadithnumber": 7343,
        "text": "\"Et si une femme a des raisons de craindre des mauvais traitements de la part de son mari ou qu'il se détourne d'elle\" (iv. 128), cela a été révélé dans le cas d'une femme qui a eu une longue association avec une personne (comme son épouse) et maintenant il a l'intention de divorcer d'elle et elle dit : Ne divorcez pas de moi, mais gardez-moi (comme épouse dans votre maison) et il vous est permis de vivre avec une autre épouse. C'est dans ce contexte que ce verset a été révélé."
    },
    {
        "hadithnumber": 1719,
        "text": "Ô gens, accomplissez les actes dont vous êtes capables, car Allah ne se lasse pas, mais vous vous fatiguerez. Les actes les plus agréables à Allah sont ceux qui sont accomplis continuellement, même s'ils sont petits. Et c'était l'habitude des membres de la maison de Muhammad (ﷺ) que chaque fois qu'ils accomplissaient un acte, ils le faisaient continuellement."
    },
    {
        "hadithnumber": 6844,
        "text": "Lorsque le Messager d'Allah (que la paix soit sur lui) avait l'intention de partir en expédition, il l'a gardé secret, mais. il ne l’a pas fait. expédition. Et dans le récit transmis sous l'autorité de Muhammad b. Abdallah b. Musulman, il n'y a aucune mention d'Abu Khaithana (qu'Allah soit satisfait de lui) et aucune mention de sa rencontre avec le Messager d'Allah (ﷺ)."
    },
    {
        "hadithnumber": 6845,
        "text": "J'ai entendu mon père Ka'b b. Malik, et il est l'un de ces trois dont le repentir a été accepté (par Allah). Il a transmis qu'Il n'était jamais à la traîne du Messager d'Allah (ﷺ) dans les expéditions qu'il avait entreprises, à l'exception de deux expéditions ; le reste du hadith est le même, et dans la tradition rapportée par une autre chaîne de transmetteurs, les mots sont : \" Que le Messager d'Allah (ﷺ) partit en expédition avec un grand nombre de personnes supérieur à dix mille et cela n'a pas pu être enregistré dans le registre du recensement. \""
    },
    {
        "hadithnumber": 3262,
        "text": "N'entreprenez pas de voyage pour visiter une mosquée, mais trois : ma mosquée, la mosquée d'al-Haram et la mosquée d'Aqsa (Bait al-Maqdis)."
    },
    {
        "hadithnumber": 1221,
        "text": "Deux vieilles femmes des vieilles juives de Médine sont venues me voir et m'ont dit : Les gens du tombeau sont tourmentés dans leurs tombeaux. Je les ai contredits et je n'ai pas jugé opportun de les témoigner. Ils sont partis et le Messager d'Allah (ﷺ) est venu vers moi et je lui ai dit : Messager d'Allah. Je suis venue me voir deux vieilles femmes des vieilles juives de Médine et j'ai affirmé que les gens des tombes y seraient tourmentés. Il (le Prophète) dit : Ils ont dit la vérité ; ils seraient (tellement) tourmentés que les animaux l'écouteraient. Elle ('A'isha) a dit : Je ne l'ai jamais revu (le Saint Prophète) par la suite, mais je cherchais refuge contre les tourments de la tombe dans la prière."
    },
    {
        "hadithnumber": 1222,
        "text": "Jamais il (le Saint Prophète) n'a dit une prière après cela sans que je ne l'entende chercher refuge contre les tourments de la tombe."
    },
    {
        "hadithnumber": 7371,
        "text": "« Celui qui se couche intentionnellement sur moi, qu'il prenne place dans le Feu »."
    },
    {
        "hadithnumber": 209,
        "text": "Nul n'est obligé de faire une offrande votive (d'une chose) qui n'est pas en sa possession et maudire un croyant équivaut à le tuer, et celui qui se suicide avec une chose dans ce monde sera tourmenté par cela (même chose) le Jour de la Résurrection, et celui qui prétend faussement augmenter (sa richesse), Allah ne fera d'autre chose que celle de la pauvreté, et celui qui a parjuré s'attirera la colère de Dieu."
    },
    {
        "hadithnumber": 1251,
        "text": "Ce hadith a été rapporté par Abu Huraira par une autre chaîne de transmetteurs."
    },
    {
        "hadithnumber": 1778,
        "text": "L'un d'entre vous est-il incapable de réciter un tiers du Coran en une nuit ? Ils (les Compagnons) demandèrent : Comment peut-on réciter un tiers du Coran (en une nuit) ? Sur ce, il (le Saint Prophète) dit : « Dis : Il est Allah, Un » (Coran. cxii) équivaut à un tiers du Coran. »"
    },
    {
        "hadithnumber": 2295,
        "text": "Le cœur d’une personne âgée est jeune pour deux choses : pour la longue vie et pour l’amour de la richesse."
    },
    {
        "hadithnumber": 248,
        "text": "Le même hadith a été transmis par Muhammad b. 'Amr, Abou Baker b. Ishaq, Abu'l-Jawwab, A'mash et Abu Huraira."
    },
    {
        "hadithnumber": 2810,
        "text": "Messager d'Allah. les gens reviennent (de La Mecque) après avoir accompli deux cultes (le Hajj et la Omra), mais je reviens avec un (un seul). sur quoi il dit : Tu devrais attendre et quand la période des règles sera terminée, tu devras aller à Tan'im et mettre le lhram et ensuite nous retrouver à telle ou telle heure (et je pense qu'il a dit demain) ; et (la récompense de cette Omra) est pour vous égale à vos difficultés ou à vos dépenses."
    },
    {
        "hadithnumber": 3836,
        "text": "Je vous permettrai de continuer ici, aussi longtemps que nous le désirons. Le reste du hadith est le même, mais avec cet ajout : « Le fruit serait distribué à hauteur de la moitié du Khaibar. Et de la récolte des produits de la terre, l'Apôtre d'Allah (que la paix soit sur lui) obtenait la cinquième partie. »"
    },
    {
        "hadithnumber": 3845,
        "text": "Qui a planté ce palmier : un musulman ou un incroyant ? Le reste du hadith est le même."
    },
    {
        "hadithnumber": 5384,
        "text": "Le tourment le plus grave pour les gens le Jour de la Résurrection serait celui de ceux qui tentent d'imiter Allah dans l'acte de création."
    },
    {
        "hadithnumber": 5393,
        "text": "Je l'ai pris et j'en ai préparé deux coussins et il (le Saint Prophète) avait l'habitude de s'allonger contre eux dans la maison."
    },
    {
        "hadithnumber": 7447,
        "text": "« Écrivez de Baqiyyah ce qu'il transmet sous l'autorité de ceux qui sont connus, et n'écrivez pas de lui ce qu'il transmet sous l'autorité de ceux qui ne le sont pas ; n’écrivez pas d’Ismā’īl bin Ayyāsh ce qu’il transmet sous l’autorité de ceux qui sont connus ou non »."
    },
    {
        "hadithnumber": 7448,
        "text": "«Quel excellent homme que Baqiyyah, si ce n'était du fait qu'il lui aurait donné un surnom car il était Abd ul-Quddūs.»"
    },
    {
        "hadithnumber": 7449,
        "text": "« Je n’ai vu Ibn al-Mubārak exprimer aussi clairement l’accusation de « mensonge » qu’à l’égard d’Abd ul-Quddūs ; car en effet je l’ai entendu lui dire : « un menteur »."
    },
    {
        "hadithnumber": 794,
        "text": "'Umar b. al-Khattab avait l'habitude de réciter à haute voix ces mots : Subhanak Allahumma wa bi hamdika wa tabarakasmuka wa ta'ala jadduka wa la ilaha ghairuka et ne récitait pas Bismillah ir-Rahman-ir-Rahim (à voix haute) au début ou à la fin de la récitation."
    },
    {
        "hadithnumber": 7450,
        "text": "« J’ai entendu Abu Nu’aym et il a mentionné al-Mu’allā bin Urfān, donc"
    },
    {
        "hadithnumber": 7451,
        "text": "« Nous étions près d'Ismā'īl bin Ulayyah, et un homme a raconté sous l'autorité d'un autre homme, alors j'ai dit : « En effet, ceci n'est pas fiable (Thabt) ». Alors l’homme dit : « Est-ce que vous le médisez ? » Ismā’īl dit : « Il ne le médise pas ; il le juge plutôt peu fiable »."
    },
    {
        "hadithnumber": 7452,
        "text": "« J'ai interrogé Malik bin Anas à propos de Muhammad bin Abd ar-Rahman qui transmet sous l'autorité de Sa'īd bin al-Musayyib, alors il a répondu : « Il n'est pas digne de confiance ». Je lui ai posé des questions sur Sālih, un esclave affranchi d’at-Taw’amah, puis il a répondu : « Il n’est pas digne de confiance ». Je lui ai posé des questions sur Abūl-Huwayrith et il a répondu : « Il n’est pas digne de confiance ». Je lui ai posé des questions sur Shu'bah sous l'autorité de qui Ibn Abī Dhi'b a transmis, et il a répondu : « Il n'est pas digne de confiance ». Je lui ai posé des questions sur Haram bin Uthmān et il a répondu : « Il n’est pas digne de confiance ». J’ai interrogé Malik à propos de ces cinq personnes et il m’a répondu : « Ils ne sont pas dignes de confiance en termes de leur Ḥadīth ». Je lui ai posé des questions sur un autre homme dont j’ai oublié le nom à l’instant et il m’a répondu : « L’avez-vous vu dans mon livre ? » J’ai répondu : « Non ».  il a dit : « S’il était digne de confiance, vous le verriez dans mon livre »."
    },
    {
        "hadithnumber": 7453,
        "text": "'Yahyā bin Ma'īn m'a raconté, Hajjāj nous a raconté, Ibn Abī Dhi'b nous a raconté sous l'autorité de Shurahbīl bin Sa'd, et il a été imputé'."
    },
    {
        "hadithnumber": 7455,
        "text": "« Ne prends rien à mon frère »."
    },
    {
        "hadithnumber": 7456,
        "text": "« Yahyā bin Abī Unaysah était un menteur »."
    },
    {
        "hadithnumber": 7457,
        "text": "« En effet, Farqad n’est pas un compagnon du Ḥadīth »."
    },
    {
        "hadithnumber": 7458,
        "text": "« Plus faible que Ya’qūb bin Atā » ? » Il répondit : « Oui ». Puis il dit : « Je n’ai vu personne transmettre sous l’autorité de Muhammad bin Abd Allah bin Ubayd bin Umayr »."
    },
    {
        "hadithnumber": 7459,
        "text": "\"Ses hadiths sont Rīh ou 'vent' - n'écrivez pas les hadiths d'Ubaydah bin Mu'attib, as-Sarī bin Ismā'īl ou Muhammad bin Sālim'.'"
    },
    {
        "hadithnumber": 7454,
        "text": "« Si j'avais dû choisir entre entrer au Paradis et rencontrer Abd Allah bin Muharrar, j'aurais choisi de le rencontrer, puis d'entrer au Paradis. Puis, quand je l’ai vu, la bouse m’a été préférée à lui."
    },
    {
        "hadithnumber": 2339,
        "text": "Avez-vous entendu le Messager d'Allah (ﷺ) en faire mention ? Il (Abu Sai'd al-Khudri) a dit : Je ne sais pas qui sont les Haruriya, mais j'ai entendu le Messager d'Allah (ﷺ) dire : Il surgirait dans cette nation (et il n'a pas dit \"d'eux\") un peuple et vous considéreriez vos prières insignifiantes par rapport à leurs prières. Et ils réciteraient le Coran qui ne dépasserait pas leur gorge et ferait un écart à travers la religion (aussi vide) tout comme une flèche (rapide) traverse la proie. L'archer regarde sa flèche, sa tête de fer et son extrémité (qu'il tenait) au bout de ses doigts pour voir si elle avait une tache de sang."
    },
    {
        "hadithnumber": 1332,
        "text": "Celui qui faisait la prière avant le lever et le coucher du soleil n'entrerait pas dans le feu (de l'Enfer), et il y avait un homme de Bassorah (assis) à côté de lui qui dit : L'avez-vous entendu de la part du Messager d'Allah (que la paix soit sur lui) ? Il a dit : Oui, j'en suis témoin. L'homme de Bassorah a dit : J'atteste que j'ai entendu le Messager d'Allah (ﷺ) le dire depuis l'endroit où vous l'avez entendu."
    },
    {
        "hadithnumber": 1351,
        "text": "Le Messager d'Allah (ﷺ) a dit : Que les bédouins ne prennent pas le dessus sur vous. En ce qui concerne le nom de votre prière, c'est-à-dire. e. prière nocturne, car elle est mentionnée « Isya » dans le Livre d'Allah (c'est-à-dire le Coran). (Les bédouins l'appellent 'Atama parce que) ils tardent à moudre leurs chamelles."
    },
    {
        "hadithnumber": 1355,
        "text": "Lorsque Hajjaj est venu à Médine, nous avons demandé à Jabir b. Abdullah (à propos des horaires de prière observés par le Saint Prophète). Il a dit : Le Messager d'Allah (ﷺ) avait l'habitude de prier la prière de l'après-midi dans la chaleur de midi ; la prière de l'après-midi quand le soleil brillait ; la prière du soir lorsque le soleil était complètement couché ; et quant à la prière du soir, il la retardait parfois et parfois (l'observait) plus tôt. Lorsqu'il les trouva (ses compagnons) rassemblés (plus tôt), il (pria) tôt. et quand il les vit arriver en retard, il retarda la (prière). et la prière du matin que le Messager d'Allah (ﷺ) a observée dans l'obscurité avant l'aube."
    },
    {
        "hadithnumber": 2381,
        "text": "\"Quand commence (le mois du) Ramadan.\""
    },
    {
        "hadithnumber": 852,
        "text": "\"Abou Bakr leva les mains et loua Allah et revint sur ses (pas) jusqu'à ce qu'il se mette en rang.\""
    },
    {
        "hadithnumber": 853,
        "text": "L'Apôtre d'Allah (ﷺ) se rendit à Bani Amr b. 'Auf afin de parvenir à une réconciliation entre eux. Le reste du hadith est le même mais avec (l'ajout de ces mots) : \" Le Messager d'Allah (ﷺ) est venu et s'est frayé un chemin à travers les rangées jusqu'à ce qu'il arrive au premier rang et Abou Bakr est revenu sur ses pas. \""
    },
    {
        "hadithnumber": 1366,
        "text": "J'ai dit à 'Abdullah b. Samit : Nous disons notre prière de Jumu'a derrière les dirigeants qui reportent la prière. Il ('Abdullah b. Samit), a frappé. ma cuisse que j'ai ressenti de la douleur et j'ai dit : J'ai interrogé Abu Tharr à ce sujet, il a frappé ma cuisse et a dit : J'ai interrogé le Messager d'Allah (ﷺ) à ce sujet. Sur ce, il dit : Observez la prière à l'heure prescrite et traitez la prière avec eux (avec les Imams qui dissuadent la prière) comme Nafl. 'Abdullah a dit : On m'a rapporté que le Messager d'Allah (ﷺ) a frappé la cuisse d'Abd Dharr."
    },
    {
        "hadithnumber": 4436,
        "text": "Nous avons accompagné le Messager d'Allah (que ma paix soit sur lui) lors d'une expédition l'année de la bataille de Hunain. Lorsque nous avons rencontré l'ennemi, certains musulmans se sont retournés (effrayés). J'ai vu qu'un homme polythéiste avait maîtrisé l'un des musulmans. Je me suis retourné et je l'ai attaqué par derrière en lui donnant un coup entre le cou et l'épaule. Il s'est tourné vers moi et s'est saisi de telle manière que j'ai commencé à voir la mort me regarder en face. Alors, le peuple revint (la bataille s'est terminée par une victoire pour les musulmans) et le Messager d'Allah (ﷺ) s'est assis (pour distribuer le butin de guerre). Il a dit : Celui qui a tué un ennemi et peut apporter des preuves pour le prouver récupérera ses biens. Il (le Saint Prophète) a fait la même observation la troisième fois, et je me suis levé (une fois de plus). Alors le Messager d'Allah (ﷺ) a dit : Que t'est-il arrivé, ô Abu Qatada ? Alors je lui ai raconté (toute) l'histoire. À cela, l'un des gens a dit : Il a dit la vérité. Bakr a dit : Par Allah, cela n'arrivera pas. Le Messager d'Allah (ﷺ) n'aimera pas priver l'un des lions parmi les lions d'Allah qui combattent dans la cause d'Allah et de Son Messager et te donner sa part du butin. Alors le Messager d'Allah (que la paix soit sur lui) a dit : Il (Abu Bakr) a dit la vérité, et lui a donc donné les biens (Abu Qatada). de ma part du butin) et j'ai acheté avec le produit de la vente un jardin dans la rue de Banu Salama. Ce fut la première propriété que j'ai acquise après avoir embrassé l'Islam. \nDans une version du hadith rapportée par Laith, les mots prononcés par Abu Bakr sont : « Non, jamais ! Il ne le donnera pas à un renard des Quraish, laissant de côté un lion parmi les lions d'Allah parmi… » Et le hadith se termine par les mots : « La première propriété que j'ai acquise. »"
    },
    {
        "hadithnumber": 7016,
        "text": "Si vous survivez pendant un certain temps, vous verrez certainement des gens qui auront des fouets à la main comme une queue de bœuf. Ils se levaient le matin sous la colère d'Allah et se levaient le soir sous la colère d'Allah."
    },
    {
        "hadithnumber": 5995,
        "text": "Alors qu'un Juif vendait des marchandises, on lui a donné quelque chose qu'il n'a pas accepté ou il n'a pas accepté (d'accepter) que 'Abdul 'Azlz (l'un des narrateurs) en doute. Il (le Juif) dit : Par Allah, qui a choisi Moïse (que la paix soit sur lui) parmi les hommes. Un homme des Ansar l'entendit et se frappa le visage en disant : (Vous avez l'audace) de dire : Par Celui qui a choisi Moïse parmi les humains, alors que le Messager d'Allah (ﷺ) vit parmi nous. Le Juif est allé voir le Messager d'Allah (ﷺ) et a dit : Abu'l-Qasim, je suis un Dhimmi et (ai donc besoin de votre protection) par une alliance, et a ajouté : Telle ou telle personne m'a donné un coup au visage. Sur ce, le Messager d'Allah (ﷺ) dit : Pourquoi lui as-tu donné un coup au visage ? Il dit : Envoyé d'Allah, cet homme a dit : Par Celui qui a choisi Moïse (que la paix soit sur lui) parmi les hommes, alors que tu vis parmi nous. Le Messager d'Allah (ﷺ) s'est mis en colère et des signes de colère étaient visibles sur son visage, puis a dit : Ne faites pas de distinction parmi les prophètes d'Allah. Quand le cor sonnera et que tout ce qui est dans les cieux et la terre s'évanouira mais que celui à qui Allah accorde une exception, alors un autre cor sonnera et je serais le premier parmi ceux qui guériraient et Moïse (que la paix soit sur lui) saisirait le trône et je ne sais pas si c'est une compensation pour cela quand il s'est évanoui le jour de Tur ou s'il serait ressuscité devant moi et je ne dis pas que quelqu'un soit plus excellent que Yunus, fils de Matta (paix sur lui). lui)."
    },
    {
        "hadithnumber": 5996,
        "text": "Ce hadith a été rapporté sous l'autorité d'Abou Salama avec la même chaîne de transmetteurs."
    },
    {
        "hadithnumber": 5997,
        "text": "Par Celui qui a choisi Muhammad (ﷺ) dans les mondes. Et le Juif dit : Par Celui qui a choisi Moïse dans les mondes. Alors le musulman leva la main et frappa le visage du juif. Le Juif est allé voir le Messager d'Allah (ﷺ) et lui a parlé de sa liaison et de celle du musulman. Sur ce, le Messager d'Allah (ﷺ) a dit : Ne me rendez pas supérieur à Moïse, car l'humanité s'évanouirait et je serais le premier à m'en remettre et Moïse serait à ce moment-là en train de s'emparer du côté du trône et je ne sais pas (si) il s'évanouirait et se rétablirait avant moi ou Allah ferait une exception pour lui."
    },
    {
        "hadithnumber": 5998,
        "text": "Un homme musulman et un homme juif se disputèrent et s'insultèrent mutuellement. Le reste du hadith est le même."
    },
    {
        "hadithnumber": 5999,
        "text": "Qu'il (le Saint Prophète) a dit : Je ne sais pas s'il tomberait en évanouissement et se rétablirait avant moi ou s'il serait compensé pour son évanouissement à Tur (et donc il ne s'évanouirait pas à cette occasion) de la Résurrection."
    },
    {
        "hadithnumber": 6000,
        "text": "Ne faites pas de distinction entre les apôtres. Ce hadith a également été rapporté par une autre chaîne de transmetteurs."
    },
    {
        "hadithnumber": 881,
        "text": "Le Messager d'Allah (que la paix soit sur lui) avait l'habitude de redresser nos rangées comme si nous redressions une flèche avec leur aide jusqu'à ce qu'on voie que nous l'avions appris de lui. Un jour, il sortit, se leva (pour la prière) et était sur le point de dire : Allah est le plus grand, lorsqu'il vit un homme dont la poitrine dépassait de la rangée, alors il dit : Serviteurs d'Allah, vous suggérez de redresser vos rangées, sinon Allah créerait des dissensions parmi vous."
    },
    {
        "hadithnumber": 6001,
        "text": "Je suis venu. Et dans le récit transmis sous l'autorité de Haddib (les mots sont) : Je suis passé par hasard près de Moïse à l'occasion du voyage de nuit près du monticule rouge (et je l'ai trouvé) en train de faire sa prière dans sa tombe."
    },
    {
        "hadithnumber": 6002,
        "text": "Il m'est arrivé de passer près de Moïse alors qu'il était occupé à réciter une prière dans sa tombe, et dans le hadith transmis sous l'autorité de 'Isa, il y a un ajout de ces mots : \"Je suis passé par hasard à l'occasion du voyage de nuit.\""
    },
    {
        "hadithnumber": 6003,
        "text": "Il n'est pas convenable qu'un de mes serviteurs dise : Je suis meilleur que Yunus b. Matta (que la paix soit sur lui)."
    },
    {
        "hadithnumber": 7020,
        "text": "Ce hadith a été rapporté sous l'autorité de Hatim b. Abi Saghira avec la même chaîne d'émetteurs et il n'y a aucune mention du mot « incirconcis »."
    },
    {
        "hadithnumber": 6527,
        "text": "L'Apôtre d'Allah (ﷺ) m'a dit : Ne considère rien d'insignifiant parmi les bonnes choses, même si tu rencontres ton frère avec un visage joyeux."
    },
    {
        "hadithnumber": 384,
        "text": "En vérité, l'Apôtre (ﷺ) a dit : Celui qui a professé : Il n'y a de dieu qu'Allah, serait sorti du Feu même s'il a dans son cœur une vertu égale au poids d'un grain d'orge. Alors celui qui professait : Il n’y a de divinité qu’Allah, sortirait du Feu, même s’il avait dans son cœur une vertu égale au poids d’un grain de blé. Il ferait alors sortir du Feu celui qui professerait : Il n'y a de dieu qu'Allah, même s'il a dans son cœur une vertu égale au poids d'un atome. Ibn Minhal a fait un ajout (de ces mots) dans son récit : Yazid a dit : J'ai rencontré Shu'ba et lui ai raconté ce hadith. Shu'ba a dit : Qatada nous a transmis ce hadith d'Anas b. Malik qui l'a entendu du Messager d'Allah (ﷺ) avec cette modification qu'il a substitué le mot Zurra (grain) à la place de Zarra (atome). Yazid a dit : Abu Bistam a apporté un changement."
    },
    {
        "hadithnumber": 6528,
        "text": "Faites-lui une recommandation et vous obtiendrez la récompense. Allah, cependant, rend le verdict par la langue de Son Apôtre sur ce qu'Il aime le plus."
    },
    {
        "hadithnumber": 6529,
        "text": "La similitude entre la bonne compagnie et celle de la mauvaise compagnie est celle du propriétaire du musc et de celui (forgeron) qui souffle des soufflets, et le propriétaire du musc vous l'offrirait gratuitement ou vous l'achèteriez chez lui ou vous le feriez. sentir son odeur agréable, et pour autant que celui qui souffle le. Soufflet est concerné, soit il brûlerait vos vêtements, soit vous devrez sentir son odeur répugnante."
    },
    {
        "hadithnumber": 388,
        "text": "Allah, le Béni et Exalté, rassemblerait les gens. Les croyants resteraient debout jusqu'à ce que le Paradis soit proche d'eux. Ils venaient vers Adam et lui disaient : Ô notre père, ouvre-nous le Paradis. Il disait : Ce qui vous a fait sortir du Paradis, c'est le péché de votre père Adam. Je ne suis pas en mesure de le faire; je ferais mieux d'aller voir mon fils Ibrahim, l'Ami d'Allah. Il (le Saint Prophète) a dit : Il (Ibrahim) dirait : Je ne suis pas en mesure de faire cela. En vérité, j'avais été l'Ami (d'Allah) de l'au-delà, de l'au-delà ; tu ferais mieux de t'approcher de Moïse (que la paix soit sur lui) avec qui Allah a conversé. Ils venaient voir Moïse (que la paix soit sur lui), mais il disait : je ne suis pas en mesure de faire cela ; tu ferais mieux d'aller à Jésus, la Parole d'Allah et Son Esprit. Jésus (que la paix soit sur lui) dirait : je ne suis pas en mesure de faire cela. Alors ils viendraient vers Muhammad (ﷺ). Il lui serait alors permis (d'ouvrir la porte du Paradis). La fiabilité et la parenté seraient dispersées, et celles-ci se tiendraient à droite et à gauche du Sentier et le premier d'entre vous passerait avec (la rapidité) de l'éclair. Il (le narrateur) dit : J'ai dit : Ô toi, qui m'es bien plus cher que mon père et ma mère, quelle chose est comme le passage de la foudre ? Il dit : N'avez-vous pas vu l'éclair, comment il passe puis revient en un clin d'œil ? Alors (ils passeraient) comme le passage du vent, puis comme le passage d'un oiseau, et la hâte des personnes serait selon leurs actes, et ton Apôtre se tiendrait sur le chemin en disant : Sauve, ô mon Seigneur, sauve. (Les gens continueraient de passer) jusqu'à ce que les actes des serviteurs faiblissent, jusqu'à ce qu'un homme vienne qui aurait du mal à suivre (ce Sentier) mais en rampant. Il (le narrateur) dit : Et sur les côtés du Sentier, des crochets seraient suspendus, prêts à attraper quiconque en aurait besoin (d'attraper). Il y en aurait qui réussiraient d’une manière ou d’une autre à parcourir ce Chemin et certains seraient entassés en Enfer. Par Celui qui tient entre les mains la vie d’Abou Huraira, il faudrait soixante-dix ans pour sonder la profondeur de l’Enfer."
    },
    {
        "hadithnumber": 3463,
        "text": "Le Messager d'Allah (ﷺ) est venu vers moi et je lui ai dit : As-tu une inclination envers ma fille d'Abu Sufyan ? Il (le Saint Prophète) dit : Alors que dois-je faire ? J'ai dit : épouse-la. Il a dit : Est-ce que tu aimes ça ? J'ai dit : je ne suis pas votre (épouse) exclusive ; Je souhaite donc rejoindre ma sœur dans le bien. Il dit : Elle ne m'est pas licite. J'ai dit : J'ai été informé que vous avez fait la demande en mariage à Durrah, fille d'Abu Salama. Il raid : Vous voulez dire la fille d'Umm Salama ? J'ai dit : Oui. Il dit : Même si elle n'avait pas été ma belle-fille élevée sous ma tutelle, elle ne m'aurait pas été légitime, car elle est la fille de mon frère adoptif (Hamza), car Thuwaiba m'a allaité moi et son père. Ne me donnez donc pas la proposition de mariage de vos filles et sœurs."
    },
    {
        "hadithnumber": 1428,
        "text": "Un hadith comme celui-ci a été rapporté par A'mash par la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 1429,
        "text": "Le Messager d'Allah (ﷺ) nous a dit : Celui qui est bien ancré dans le Livre d'Allah et qui se distingue parmi eux dans la récitation doit agir comme ; Imam du peuple. et s'ils sont également versés dans la récitation, alors celui qui a le plus de connaissances sur la Sunnah ; s'ils sont égaux en ce qui concerne la Sunna, alors le premier à émigrer ; S'ils ont émigré en même temps, alors le plus âgé. Nul ne doit diriger un autre en prière dans la maison de ce dernier ou là où (ce dernier) a autorité, ni s'asseoir à sa place d'honneur dans sa maison, sauf s'il vous en donne la permission ou avec sa permission."
    },
    {
        "hadithnumber": 5541,
        "text": "Aucun d'entre vous ne doit faire lever son frère le vendredi (pendant la prière commune) pour ensuite occuper sa place. mais il devrait seulement lui dire (Accueillez-moi)."
    },
    {
        "hadithnumber": 5542,
        "text": "Quand quelqu'un parmi vous se lève, et dans le badltb transmis sous l'autorité d'Abu 'Awina, les mots sont : \" Celui qui se tient à sa place et (s'en va) puis y revient, c'est lui qui a le plus grand droit (d'occuper cela)."
    },
    {
        "hadithnumber": 5543,
        "text": "Abdallahb. Aba Umayya. Si Allah vous accorde la victoire à Ta'if le lendemain, je vous montrerai la fille de Ghailan car elle a quatre plis (sur son corps) sur le devant du ventre et huit plis sur le dos. Le Messager d'Allah (ﷺ) a entendu cela et il a dit : De telles (personnes) ne devraient pas vous rendre visite."
    },
    {
        "hadithnumber": 5544,
        "text": "Au fur et à mesure que la tournée arrive devant, des plis apparaissent sur sa face avant et lorsqu'elle tourne le dos, huit plis apparaissent sur la face arrière. Sur ce, l'Apôtre d'Allah (ﷺ) a dit : Je crois qu'il sait ces choses ; ne le faites donc pas. lui permettre de s'occuper. Elle (\" A'isha) a dit : Alors ils ont commencé à observer le voile de sa part."
    },
    {
        "hadithnumber": 5545,
        "text": "J'ai fait paître son cheval. il lui fournissait du fourrage et en prenait soin, ainsi que des dattes moulues pour son chameau. En plus de cela, j'ai fait paître le chameau, pris des dispositions pour lui fournir de l'eau, réparé le seau en cuir et pétri la farine. Mais je n'étais pas douée pour faire du pain, alors mes voisines me faisaient du pain et c'étaient des femmes sincères. Elle a ajouté: Je portais sur ma tête les pierres de dattes du pays de Zubair que le Messager d'Allah (ﷺ) lui avait doté et c'était à une distance de deux miles (de Médine). Elle ajoute : Alors qu'un jour je portais les expiations des dattes sur ma tête, j'ai rencontré le Messager d'Allah (ﷺ) avec un groupe de ses compagnons. Il m'a appelé et a dit (au chameau) de s'asseoir pour qu'il puisse le faire monter derrière lui. (J'ai dit à mon mari : ) Je me suis senti timide et je me suis souvenu de ta jalousie, sur quoi il a dit : Par Allah. porter les dattes en pierre sur votre perle est un fardeau plus lourd que de rouler avec elle. Elle a dit : (J'ai mené une vie difficile) jusqu'à ce qu'Abou Bakr envoie ensuite une servante qui a pris sur elle la responsabilité de s'occuper du cheval et j'ai senti qu'elle m'avait émancipé."
    },
    {
        "hadithnumber": 3525,
        "text": "Un homme croyant ne devrait pas haïr une femme croyante ; s’il n’aime pas l’une de ses caractéristiques, il se contentera d’une autre."
    },
    {
        "hadithnumber": 3038,
        "text": "\" Il n'y a pas ces mots dedans : À tous ces trois rites (lancer de cailloux, sacrifice d'animal et rasage de la tête).\" Et en ce qui concerne le récit de Yahya al-Umawi (les mots sont) : Je me suis fait raser (la tête) avant de sacrifier l'animal, et j'ai sacrifié l'animal avant de jeter des cailloux, et comme ça."
    },
    {
        "hadithnumber": 3039,
        "text": "Je me suis fait raser la tête avant de sacrifier l'animal, après quoi (le Saint Prophète) a dit : Sacrifiez l'animal (maintenant) ; il n'y a aucun mal à cela. Il (la personne a dit) : J'ai sacrifié l'animal avant de lui lancer des cailloux. sur quoi il dit : Jetez des cailloux (maintenant) ; il n'y a aucun mal à cela."
    },
    {
        "hadithnumber": 7144,
        "text": "Ce hadith a été rapporté sous l'autorité d'Umm Salama à travers une autre chaîne de transmetteurs."
    }
]