[
    {
        "hadithnumber": 7460,
        "text": "Il n'y a de dieu qu'Allah, je l'ai attaqué avec une lance. Cela m'est venu à l'esprit une fois et j'en ai parlé à l'Apôtre (ﷺ). Le Messager d'Allah (ﷺ) a dit : A-t-il professé « Il n'y a de dieu qu'Allah », et même alors vous l'avez tué ? J'ai dit : Messager d'Allah, il en a fait profession par peur de l'arme. Il (le Saint Prophète) a observé : Lui avez-vous déchiré le cœur pour savoir s'il avait fait profession ou non ? Et il a continué à me le répéter jusqu'à ce que j'aurais aimé avoir embrassé l'Islam ce jour-là. Sa'd a dit : Par Allah, je ne tuerai jamais un musulman tant qu'une personne au ventre lourd, c'est-à-dire. e., Oussama, ne tuerait pas. À ce sujet, une personne remarqua : Allah n'a-t-il pas dit ceci : Et combattez-les jusqu'à ce qu'il n'y ait plus de mal et que la religion soit entièrement à Allah ? Sa'd a dit : Nous avons combattu pour qu'il n'y ait pas de mal, mais vous et vos compagnons souhaitez vous battre pour qu'il n'y ait pas de mal."
    },
    {
        "hadithnumber": 7461,
        "text": "Le Messager d'Allah (que la paix soit sur lui) nous a envoyés à Huraqat, une tribu de Juhaina. Nous avons attaqué cette tribu tôt le matin et les avons vaincus. Moi et un homme des Ansar avons attrapé une personne (de la tribu vaincue). Lorsque nous l'avons vaincu, il a dit : Il n'y a de dieu qu'Allah. À ce moment-là, les Ansari l'ont épargné, mais je l'ai attaqué avec ma lance et je l'ai tué. La nouvelle était déjà parvenue à l'Apôtre (que la paix soit sur lui), alors quand nous sommes revenus, il (l'Apôtre) m'a dit : Oussama, l'as-tu tué après qu'il ait fait profession : Il n'y a de dieu qu'Allah ? J'ai dit. Messager d'Allah, il ne l'a fait que comme refuge. Le Prophète a observé : L'avez-vous tué après qu'il ait fait profession qu'il n'y avait de dieu qu'Allah ? Il (le Saint Prophète) a continué à me répéter cela jusqu'à ce que j'aurais souhaité ne pas avoir embrassé l'Islam avant ce jour."
    },
    {
        "hadithnumber": 7462,
        "text": "Rassemblez quelques hommes de votre famille pour que je leur parle. Il ('As'as) leur envoya un messager (aux membres de sa famille). Lorsqu'ils furent assemblés, Jundab arriva là-bas avec un manteau à capuche jaune sur lui. Il dit : Parlez de ce dont vous étiez occupé à parler. La conversation se poursuivit tour à tour, jusqu'à ce que son tour (celui de Jundab) vienne. Il ôta le manteau à capuche de sa tête et dit : Je suis venu vers vous sans autre intention que de vous raconter un hadith de votre Apôtre : En vérité, le Messager d'Allah (ﷺ) a envoyé une escouade de musulmans vers une tribu de polythéistes. Les deux armées s’affrontent. Il y avait un homme parmi l'armée des polythéistes qui (était si fringant que), chaque fois qu'il avait l'intention de tuer un homme parmi les musulmans, il le tuait. Parmi les musulmans, il y avait aussi un homme qui attendait avec impatience (une opportunité de) son inconscience (du polythéiste). Il (le narrateur) a dit : Nous avons dit qu'il était Usama b, Zaid. Lorsqu'il leva son épée, il (le soldat des polythéistes) dit : « Il n'y a de dieu qu'Allah », mais il (Oussama ben Zaid) le tua. Lorsque le messager de la bonne nouvelle est venu voir l'Apôtre (ﷺ), il l'a interrogé (sur les événements de la bataille) et il l'a informé de l'homme (Oussama) et de ce qu'il avait fait. Il (le Prophète d'Allah) l'a appelé et lui a demandé pourquoi il l'avait tué. Il (Oussama) dit : Messager d'Allah, il a frappé les musulmans et tué tel ou tel d'entre eux. Et il en a même nommé certains. (Il a continué) : Je l'ai attaqué et quand il a vu l'épée, il a dit : Il n'y a de dieu qu'Allah. Le Messager d'Allah (ﷺ) a dit : L'avez-vous tué ? Il (Oussama) a répondu par l'affirmative. Il (le Saint Prophète) a fait la remarque suivante : Que feriez-vous avec : « Il n'y a de dieu qu'Allah », lorsqu'il viendrait (devant vous) le Jour du Jugement ? Il (Oussama) dit : Messager d'Allah, demande pardon pour moi (à ton Seigneur). Il (le Saint Prophète) a dit : Que feriez-vous avec : « Il n'y a de dieu qu'Allah » lorsqu'il viendrait (devant vous) le Jour du Jugement ? Il (le Saint Prophète) n'y ajouta rien mais répétait : Que feriez-vous avec : « Il n'y a de dieu qu'Allah », lorsqu'il viendrait (devant vous) le Jour du Jugement ?"
    },
    {
        "hadithnumber": 7463,
        "text": "Celui qui a pris les armes contre nous n'est pas des nôtres."
    },
    {
        "hadithnumber": 7513,
        "text": "A Allah appartient tout ce qui est dans les cieux et sur la terre. Que vous révéliez ce que vous avez en tête ou que vous le cachiez, Allah vous demandera compte selon cela. Puis Il pardonne à qui Il veut et châtie qui Il veut ; et Allah est au-dessus de tout ce qui est puissant » (ii. 284). Les compagnons du Messager d'Allah (ﷺ) ont ressenti cela dur et sévère et ils sont venus vers le Messager d'Allah (ﷺ) et se sont assis à genoux et ont dit : Messager d'Allah, nous avons reçu certaines tâches qui étaient en notre pouvoir d'accomplir, telles que la prière, le jeûne, la lutte (dans la cause d'Allah), la charité. Alors ce verset (mentionné ci-dessus) vous a été révélé et il est au-dessus de notre pouvoir d'être à la hauteur. Le Messager d'Allah (ﷺ) a dit : Avez-vous l'intention de dire ce que les gens des deux livres (Juifs et Chrétiens) ont dit avant vous : « Nous entendons et désobéissons » Vous devriez plutôt dire : « Nous entendons et nous obéissons, (nous recherchons) Ton pardon, notre Seigneur ! et vers Toi est le retour. » Et ils dirent : « Nous écoutons et nous obéissons, (nous recherchons) Ton pardon, Notre Seigneur ! et c'est vers Toi qu'est le retour. » Quand les gens le récitèrent et que cela coula doucement sur leurs langues, alors Allah révéla immédiatement après : « L'Apôtre croit en ce qui lui a été descendu de la part de son Seigneur, et les croyants aussi. Chacun croit en Allah et en Ses anges et en Ses Livres et en Ses Apôtres, disant : Nous ne faisons de différence entre aucun de Ses Apôtres et ils disent : Nous écoutons et nous obéissons : (nous recherchons) Ton pardon, notre Seigneur ! et vers Toi est le retour » (ii. 285). Quand ils firent cela, Allah abrogea ce (verset) et le Grand et Majestueux Allah révéla : « Allah n'impose à une âme aucun fardeau au-delà de sa capacité. Il obtient tous les biens qu’il gagne et subit tous les maux qu’il gagne. Ne nous impose pas un fardeau comme Tu as imposé à ceux qui nous ont précédés. (Le Prophète a dit : ) Oui, notre Seigneur, ne nous impose pas des fardeaux que nous n'avons pas la force de porter (Le Prophète a dit : ) Oui, pardonne-nous et accorde-nous protection ! et aie pitié de nous. Tu es notre Patron, alors accorde-nous la victoire sur les gens mécréants. \" (ii. 286). Il (le Seigneur) dit : Oui."
    },
    {
        "hadithnumber": 7514,
        "text": "Lorsque ce verset : « Que vous révéliez ce qui est dans votre esprit ou que vous le cachiez, Allah vous demandera des comptes selon cela » (ii 284), est entré dans leur esprit quelque chose (de cette peur) tel qu'il n'était jamais entré dans leur cœur (auparavant). L'Apôtre (ﷺ) a observé : Dis : Nous avons entendu, obéi et soumis. Il (le journaliste) a dit : Allah a instillé la foi dans leurs cœurs et Il a révélé ce verset : « Allah n'impose pas à une âme un fardeau au-delà de ses capacités. Elle obtient tout le bien qu'elle gagne et elle souffre tous les maux qu'elle gagne. Et pardonne-nous, aie pitié de nous. Tu es notre Protecteur » (ii. 286). Il a dit : Je l'ai effectivement fait."
    },
    {
        "hadithnumber": 7515,
        "text": "En vérité, Allah a pardonné à mon peuple les mauvaises inspirations qui surgissent dans leurs cœurs tant qu'ils n'en parlaient pas ou n'agissaient pas en conséquence."
    },
    {
        "hadithnumber": 7516,
        "text": "En vérité, le Grand et Puissant Allah a pardonné à mon peuple les mauvaises incitations qui surgissaient dans leur esprit, mais ils n'en parlaient ni n'agissait en conséquence."
    },
    {
        "hadithnumber": 7517,
        "text": "Le même hadith a été rapporté par Zuhair b. Harb, Waki, Ishaq b. Mansur, Husain b. 'Ali."
    },
    {
        "hadithnumber": 7518,
        "text": "Le Grand et Glorieux Seigneur a dit (aux anges) : Chaque fois que Mon serviteur a l'intention de faire un mal, ne l'enregistrez pas contre lui, mais s'il le commet réellement, alors écrivez-le comme un seul mal. Et quand il a l'intention de faire le bien mais ne le fait pas, alors le retirer est un acte de bonté, mais s'il le fait, alors écrivez dix bonnes actions (dans son registre)."
    },
    {
        "hadithnumber": 7519,
        "text": "Allah, le Grand et Glorieux, a dit : Chaque fois que mon serviteur a l'intention de faire le bien, mais ne le fait pas, je lui écris une bonne action, mais s'il la met en pratique, j'écris de dix à sept cents bonnes actions en sa faveur. Lorsqu'il a l'intention de commettre un mal, mais qu'il ne le fait pas, ne le notez pas. Mais s'il le fait, je n'écris qu'un seul mal."
    },
    {
        "hadithnumber": 7557,
        "text": "En vérité, l'Islam a commencé comme quelque chose d'étrange et il reviendrait à nouveau (à son ancienne position) d'être étrange juste comme il a commencé, et il reculerait entre les deux mosquées juste au moment où le serpent retourne dans son trou."
    }
]