[
    {
        "hadithnumber": 125,
        "text": "\"J'étais avec le Prophète (ﷺ) en voyage, et il a dit : 'Reste en arrière, ô Mughirah ! Allez-y, ô peuple !' Je suis donc reparti et j'avais avec moi un récipient rempli d'eau. Les gens sont allés en avant, et là le Messager d'Allah (ﷺ) s'est soulagé. quand il est revenu, je suis allé lui verser de l'eau. Il portait une Jubbah romaine avec des manches étroites, et il voulait exposer ses mains (pour les laver) mais les manches étaient trop serrées, alors il a sorti ses mains de dessous la Jubbah et s'est lavé la tête et a essuyé ses Khuffs."
    },
    {
        "hadithnumber": 1368,
        "text": "Le jour d'Al-Khandaq, après le coucher du soleil, Umar bin Al-Khattab commença à maudire les mécréants des Quraish et dit : « Ô Messager d'Allah, j'étais à peine capable de prier jusqu'au coucher du soleil. Le Messager d'Allah (ﷺ) a dit : « Par Allah, je n'ai pas prié. Nous sommes donc descendus avec le Messager d'Allah (ﷺ) à Buthan. Il a effectué le wudu' pour la prière et nous aussi, et il a prié 'Asr après le coucher du soleil, puis il a prié Maghrib après cela.\""
    },
    {
        "hadithnumber": 1369,
        "text": "\"Le Messager d'Allah (ﷺ) a dit : 'Nous sommes les derniers (à venir) mais nous serons les premiers le Jour de la Résurrection, mais le Livre leur a été donné avant nous et nous l'avons reçu après eux. Ils étaient en désaccord sur ce jour qu'Allah, le Puissant et Sublime, leur avait prescrit et Allah, le Puissant et Sublime, nous a guidé vers\" - c'est-à-dire vendredi - \" alors les gens nous suivent, les Juifs le lendemain et les Chrétiens le lendemain. ça.'\""
    },
    {
        "hadithnumber": 1372,
        "text": "\"Quiconque a manqué trois jumu'ahs par négligence, Allah mettra un sceau sur son cœur.\""
    },
    {
        "hadithnumber": 3857,
        "text": "Le Messager d'Allah a dit : « Il n'y a pas de vœu de commettre un acte de désobéissance et son expiation est l'expiation d'un serment. » Mansur bin Zadhan l'a contredit dans ses propos."
    },
    {
        "hadithnumber": 3858,
        "text": "Le Messager d'Allah a dit : « Il n'y a pas de vœu pour le fils d'Adam concernant ce qu'il ne possède pas, ni de commettre un acte de désobéissance à Allah, le Puissant et Sublime. » 'Ali bin Zaid l'a contredit - car il l'a rapporté d'Al-Hasan d'après 'Abdur-Rahman bin Samurah."
    },
    {
        "hadithnumber": 3859,
        "text": "\"Il n'y a aucun vœu de commettre un acte de désobéissance ou à l'égard de ce que le fils d'Adam ne possède pas.\""
    },
    {
        "hadithnumber": 3860,
        "text": "Le Messager d'Allah a dit : « Il n'y a aucun vœu de commettre un acte de désobéissance ou concernant ce que le fils d'Adam ne possède pas. »"
    },
    {
        "hadithnumber": 3861,
        "text": "\"Le Prophète a vu un homme soutenu par deux autres et a dit : 'Qu'est-ce que c'est ?' Ils dirent : \"Il a juré de marcher jusqu'à la Maison d'Allah.\" Il a dit : « Allah n'a pas besoin que cet homme se torture. Dites-lui de monter à bord.'\""
    },
    {
        "hadithnumber": 3862,
        "text": "\"Le Messager d'Allah passa à côté d'un vieil homme soutenu par deux hommes et dit : 'Qu'a-t-il ?' Ils dirent : « Il a juré de marcher. » Il a dit : « Allah n'a pas besoin qu'il se torture. Dites-lui de monter à cheval.'\" On lui a donc dit de monter à cheval."
    },
    {
        "hadithnumber": 3863,
        "text": "\"Le Messager d'Allah s'est approché d'un homme qui était soutenu par deux autres et lui a dit : 'Qu'a-t-il ?' Il a été dit : « Il a juré de marcher jusqu'à la Kaaba. » Il a dit : « Allah ne profite pas du fait qu'il se torture. » Et il lui a dit de monter à cheval.\""
    },
    {
        "hadithnumber": 3864,
        "text": "\"Le Messager d'Allah a dit : 'Quiconque prête serment et dit : 'Si Allah le veut, alors il a fait une exception.'\""
    },
    {
        "hadithnumber": 3865,
        "text": "\" Sulaiman a dit : 'Je vais certainement rencontrer quatre-vingt-dix femmes ce soir, dont chacune aura un enfant qui combattra dans la cause d'Allah.' On lui dit : « Dis : Si Allah le veut », mais il ne le dit pas. Il est allé vers eux, mais aucun d'eux n'a eu d'enfant, à l'exception d'une femme qui a donné naissance à la moitié d'une personne. » Le Messager d'Allah a dit : « S'il avait dit : « Si Allah le voulait », il n'aurait pas rompu son vœu, et cela aurait été un moyen de l'aider à obtenir ce qu'il voulait."
    },
    {
        "hadithnumber": 3866,
        "text": "\"Lorsque vous embauchez un ouvrier, dites-lui quel sera son salaire.\""
    },
    {
        "hadithnumber": 3867,
        "text": "Al-Hasan rapporte qu'il n'aimait pas embaucher un homme sans lui dire quel serait son salaire."
    },
    {
        "hadithnumber": 3868,
        "text": "\"Non, pas avant qu'il ne lui dise (quel sera son salaire).\""
    },
    {
        "hadithnumber": 3869,
        "text": "\"Je vous louerai (quelque chose) jusqu'à ce que j'atteigne La Mecque pour tel ou tel paiement, et si je voyage pendant un mois ou tel ou tel - quelque chose qu'il a nommé - je vous donnerai tel ou tel en plus.\" Ils n'y voyaient rien de mal, mais ils n'aimaient pas qu'il dise : « Si je voyage pendant plus d'un mois, je déduirai tel ou tel de votre bail."
    },
    {
        "hadithnumber": 3870,
        "text": "\"J'ai dit à 'Ata' : 'Et si j'engageais un esclave pour un an en échange de sa nourriture, et pour une autre année, en échange de telle ou telle chose ?' Il a déclaré : « Il n'y a rien de mal à cela et vous pouvez stipuler vos conditions d'embauche même pour quelques jours. « Et si je concluais un accord pour l'embaucher une fois l'année écoulée ? » Il a dit : 'Ne me demandez pas de comptes pour ce qui s'est passé.'\""
    },
    {
        "hadithnumber": 3871,
        "text": "\"Ô Banu Harithah, une calamité t'est arrivée.\" Ils ont dit : « Qu'est-ce qu'il y a ? Il a dit : « Le Messager d'Allah a interdit la location de terres. » Nous avons dit : « Ô Messager d'Allah, et si nous le louions en échange d'une partie du grain ? Il a répondu : « Non ». Il a déclaré : « Nous le louions en échange de paille. » Il a répondu : « Non ». \"Nous le louions en échange de ce qui était planté au bord d'un ruisseau et qui servait à l'irrigation.\" Il a dit : \"Non. Cultivez-le (vous-même) ou donnez-le à votre frère.\""
    },
    {
        "hadithnumber": 3872,
        "text": "\"Rafi' bin Khadij est venu vers nous et nous a dit : 'Le Messager d'Allah vous a interdit Al-Haql. Al-Haql est le troisième et le quatrième. Et Al-Muzabanah. Al-Muzabanah consiste à acheter ce qui se trouve au sommet des palmiers dattiers en échange d'un certain nombre de Wasqs de dattes séchées.'\""
    },
    {
        "hadithnumber": 3873,
        "text": "\" Rafi' bin Khadij est venu vers nous et a dit : \" Le Messager d'Allah a interdit quelque chose qui nous était bénéfique, mais l'obéissance au Messager d'Allah est meilleure pour vous. Il vous a interdit Al-Haql (location de terre en échange d'un tiers ou d'un quart du produit) et dit : Celui qui possède une terre, qu'il la donne (à quelqu'un d'autre pour la cultiver) ou la laisse. Et il a interdit Al-Muzabanah. Al-Muzabanah signifie quand un homme a beaucoup de dattiers et qu'un autre homme vient le prendre en échange d'un certain nombre de Wasqs de dattes séchées.'\""
    },
    {
        "hadithnumber": 3874,
        "text": "\" Rafi' bin Khadij est venu vers nous et je n'étais pas sûr de ce qu'il voulait dire. Il a dit : \" Le Messager d'Allah vous a interdit quelque chose qui vous était bénéfique, mais l'obéissance au Messager d'Allah est meilleure pour vous que ce qui vous profite. Le Messager d'Allah vous a interdit Al-Haql. Al-Haql signifie le métayage de la terre en échange d'un tiers ou d'un quart (du rendement). son frère (de le cultiver) ou de le laisser le quitter. Et il vous a interdit Al-Muzabanah Al-Muzabanah signifie quand un homme possède un grand nombre de dattiers et dit : Prenez-le en échange (d'un certain nombre) de Wasqs de dattes séchées cette année.'\""
    },
    {
        "hadithnumber": 3875,
        "text": "\"Rafi' bin Khadij a dit : 'Le Messager d'Allah vous a interdit quelque chose qui nous était bénéfique, mais l'obéissance au Messager d'Allah est plus bénéfique pour nous. Il a dit : 'Celui qui a une terre, qu'il la cultive, et s'il n'est pas en mesure de le faire, qu'il la donne à son frère pour qu'il la cultive.'\""
    },
    {
        "hadithnumber": 3876,
        "text": "\"J'ai pris Tawus par la main et je l'ai amené à Ibn Rafi' bin Khadij, et il lui a dit, racontant de son père, que le Messager d'Allah avait interdit la location de terres. Tawus a rejeté cela et a dit : 'J'ai entendu Ibn 'Abbas (dire) qu'il ne voyait rien de mal à cela.'\""
    },
    {
        "hadithnumber": 3877,
        "text": "\" Rafi' bin Khadij a dit : \" Le Messager d'Allah nous a interdit de faire quelque chose qui nous était bénéfique (mais nous respectons et obéissons aux ordres du Messager d'Allah). Il nous a interdit de louer des terres en échange d'une partie de ses produits. \""
    },
    {
        "hadithnumber": 3878,
        "text": "\"Le Prophète passa par le pays d'un homme parmi les Ansar dont il savait qu'il était dans le besoin et dit : 'A qui est ce pays ?' Il a dit : « Un tel et un tel ; il nous l'a donné en échange d'un loyer. Il dit : \"Pourquoi ne l'a-t-il pas donné à son frère ?\""
    },
    {
        "hadithnumber": 3879,
        "text": "\"Le Messager d'Allah a interdit Al-Haql (location de terres en échange d'un tiers ou d'un quart de la production).\""
    },
    {
        "hadithnumber": 3880,
        "text": "\"Le Messager d'Allah est venu vers nous et nous a interdit quelque chose qui nous avait été bénéfique. Il a dit : 'Celui qui possède une terre, qu'il la cultive ou la donne à quelqu'un d'autre (pour la cultiver), ou la laisse.'\""
    },
    {
        "hadithnumber": 3881,
        "text": "\"Le Messager d'Allah est venu vers nous et nous a interdit quelque chose qui nous avait été bénéfique, mais l'ordre du Messager d'Allah est meilleur pour nous. Il a dit : 'Celui qui possède une terre, qu'il la cultive ou la laisse ou la donne (à quelqu'un d'autre pour qu'il la cultive).'\""
    },
    {
        "hadithnumber": 3882,
        "text": "\"Tawus considérait qu'il n'aimait pas louer des terres contre de l'or et de l'argent, mais il ne voyait rien de mal à les louer en échange d'un tiers ou d'un quart (du rendement). Moudjahid lui dit : 'Allez voir Ibn Rafi' bin Khadij et écoutez son Hadith.' Il dit : « Par Allah, si j'avais su que le Messager d'Allah l'avait interdit, je ne l'aurais pas fait. Mais mon Hadith vient de quelqu'un qui est plus compétent que lui. Ibn 'Abbas (a dit) que le Messager d'Allah a dit : \" Si l'un de vous devait donner sa terre à son frère (pour la cultiver), ce serait mieux que de prendre une part convenue du rendement. \"'\""
    },
    {
        "hadithnumber": 3883,
        "text": "\"Celui qui possède une terre, qu'il la cultive. S'il ne peut pas la cultiver, qu'il la donne à son frère musulman et ne la partage pas avec lui.\""
    },
    {
        "hadithnumber": 3884,
        "text": "Le Messager d'Allah a dit : « Quiconque possède une terre, qu'il la cultive ou la donne à son frère, et ne la lui donne pas en location. »"
    },
    {
        "hadithnumber": 3885,
        "text": "\"Certains gens possédaient des terres supplémentaires qu'ils louaient en échange de la moitié du rendement, ou d'un tiers ou d'un quart. Le Messager d'Allah a dit : 'Celui qui possède une terre, qu'il la cultive, ou qu'il la donne à son frère pour qu'il la cultive ou la garde (sans la cultiver).'\""
    },
    {
        "hadithnumber": 3886,
        "text": "\"Le Messager d'Allah s'est adressé à nous et a dit : 'Quiconque possède une terre, qu'il la cultive ou la donne à quelqu'un d'autre pour qu'il la cultive, et qu'il ne la loue pas.'\""
    },
    {
        "hadithnumber": 3887,
        "text": "\"Qu'il a interdit de louer des terres.\""
    },
    {
        "hadithnumber": 3888,
        "text": "Il a été rapporté de Jabir que le Prophète a interdit Al-Mukhabarah, Al-Muzabanah et Al-Muhaqalah, ainsi que la vente de fruits jusqu'à ce qu'ils soient bons à manger (assez mûrs), sauf dans le cas d'Al-'Araya."
    },
    {
        "hadithnumber": 3889,
        "text": "Il a été rapporté de Jabir que le Prophète a interdit Al-Muhaqalah, Al-Muzabanah, Al-Mukhabarah et les exceptions lors de la vente, à moins qu'elles ne soient bien définies."
    },
    {
        "hadithnumber": 3890,
        "text": "\"Quiconque possède une terre, qu'il la cultive ou qu'il la donne à son frère pour qu'il la cultive, et ne la loue pas à son frère.\""
    },
    {
        "hadithnumber": 3891,
        "text": "\"Le Prophète a interdit Al-Haql et c'est Al-Muzabanah.\""
    },
    {
        "hadithnumber": 3892,
        "text": "\"Al-Mukhadarah signifie vendre des fruits avant qu'ils ne mûrissent et Al-Mukhabarah signifie vendre des raisins en échange d'un certain nombre de Sa's.\""
    },
    {
        "hadithnumber": 3893,
        "text": "\"Le Messager d'Allah a interdit Al-Muhaqalah et Al-Muzabanah.\""
    },
    {
        "hadithnumber": 3894,
        "text": "\"Le Messager d'Allah a interdit Al-Muhaqalah et Al-Muzabanah.\""
    },
    {
        "hadithnumber": 3895,
        "text": "Il a été rapporté par Rafi' bin Khadij que le Messager d'Allah a interdit Al-Muhaqalah et Al-Muzabanah."
    },
    {
        "hadithnumber": 3896,
        "text": "\"J'ai interrogé Al-Qasim à propos d'Al-Muzara'ah, alors il a rapporté de Rafi' bin Khadij que le Messager d'Allah a interdit Al-Muhaqalah et Al-Muzabanah.\""
    },
    {
        "hadithnumber": 3897,
        "text": "Rafi' bin Khadij a dit que le Messager d'Allah a interdit la location de terres."
    },
    {
        "hadithnumber": 3898,
        "text": "\" Mon oncle paternel m'a envoyé avec un de ses esclaves à Sa'eed bin Al-Musayyab pour l'interroger sur Al-Muzara'ah. Il a dit : 'Ibn 'Umar n'y a rien vu de mal, jusqu'à ce qu'il entende le Hadith de Rafi' bin Khadij. Puis il l'a rencontré, et Rafi' a dit : \" Le Prophète est venu à Banu Harithah et a vu des récoltes. Il dit : « Comme les récoltes de Zubair sont bonnes. » Ils ont dit : « Ce n'est pas celui de Zubair. Il dit : « La terre n'appartient-elle pas à Zubair ? Ils ont répondu : « Non (ce n'est pas le sien), mais il le loue. » Le Messager d'Allah a dit : « Prenez vos récoltes et donnez-lui ce qu'il a dépensé. » Nous avons donc pris nos récoltes et lui avons donné ce qu'il avait dépensé."
    },
    {
        "hadithnumber": 3899,
        "text": "\"Le Messager d'Allah a interdit Al-Muhaqalah et Al-Muzabanah et a dit : 'Trois seulement peuvent cultiver : Un homme qui possède une terre qu'il cultive ; un homme à qui on a donné une terre et qui cultive ce qui lui a été donné ; et un homme qui prend une terre en location contre de l'or ou de l'argent.'\""
    },
    {
        "hadithnumber": 3900,
        "text": "\"Le Messager d'Allah a interdit Al-Muhaqalah.\" Sa'eed a dit : \"Et il a raconté quelque chose de similaire.\" Et Sufyan Ath-Thawri l'a rapporté de Tariq."
    },
    {
        "hadithnumber": 3901,
        "text": "\"J'ai entendu Sa'eed bin Al-Musayyab dire : 'La culture de la terre n'est pas autorisée sauf dans trois cas : la terre que l'on possède, la terre qui lui est donnée, ou la terre que l'on loue en échange d'or et d'argent.'\""
    },
    {
        "hadithnumber": 3902,
        "text": "Il a été rapporté par Sa'eed bin Al-Musayyab que le Messager d'Allah a interdit Al-Muhaqalah et Al-Muzabanah."
    },
    {
        "hadithnumber": 3903,
        "text": "\"À l'époque du Messager d'Allah, les propriétaires terriens louaient leurs terres arables en échange de tout ce qui poussait sur les rives des ruisseaux pour l'irrigation. Ils sont venus voir le Messager d'Allah et lui ont soumis un différend concernant de telles questions, et le Messager d'Allah leur a interdit de louer des terres à de telles conditions et a dit : \" Louez-les contre de l'or ou de l'argent. \" \""
    },
    {
        "hadithnumber": 3904,
        "text": "« À l'époque du Messager d'Allah, nous louions la terre sur la base d'Al-Muhaqalah, nous la louions donc en échange d'un tiers ou d'un quart du rendement, ou d'une quantité spécifiée de nourriture (produits). Un jour, un homme parmi mes oncles paternels est venu et a dit : « Le Messager d'Allah m'a interdit de faire quelque chose qui nous était bénéfique, mais l'obéissance à Allah et à Son Messager est plus bénéfique pour nous. Il nous a interdit de louer des terres sur la base de Al-Muhaqalah et de le louer en échange d'un tiers ou d'un quart du rendement et d'une quantité spécifiée de nourriture (produits). Et il a ordonné au propriétaire foncier de le cultiver (lui-même) ou de le donner à quelqu'un d'autre pour qu'il le cultive. Il n'aimait pas le louer ou quoi que ce soit d'autre."
    },
    {
        "hadithnumber": 3905,
        "text": "\" Ya'la bin Al-Hakim m'a écrit (en disant) : 'J'ai entendu Sulaiman bin Yasar raconter le récit de Rafi' bin Khadij, qui a dit : 'Nous avions l'habitude de louer des terres sur la base d'Al-Muhaqalah, en les louant en échange d'un tiers ou d'un quart du rendement et d'une quantité spécifiée de nourriture (produits).''\""
    },
    {
        "hadithnumber": 3906,
        "text": "\"Nous avions l'habitude de louer des terres sur la base d'Al-Muhaqalah à l'époque du Messager d'Allah.\" Il a raconté qu'un de ses oncles paternels est venu vers eux et leur a dit : « Le Messager d'Allah m'a interdit de faire quelque chose qui nous était bénéfique, mais l'obéissance à Allah et à Son Messager est plus bénéfique. Nous avons dit : « Qu'est-ce que c'est ? Il a dit : « Le Messager d'Allah a dit : « Quiconque possède une terre, qu'il la cultive (lui-même) ou qu'il la donne à son frère pour qu'il la cultive, et ne la loue pas en échange d'un tiers ou d'un quart du rendement ni d'une quantité spécifiée de nourriture (produits). »"
    },
    {
        "hadithnumber": 3907,
        "text": "\"Mon oncle paternel m'a raconté qu'ils louaient des terres à l'époque du Messager d'Allah en échange de ce qui poussait au bord des ruisseaux et d'une part de la récolte stipulée par le propriétaire de la terre. Mais le Messager d'Allah nous l'a interdit.\" J'ai (Hanzalah) dit à Rafi' : « Que diriez-vous de le louer en échange de Dinars et de Dirhams ? Rafi' a déclaré : \"Il n'y a rien de mal à (le louer) pour des dinars et des dirhams.\""
    },
    {
        "hadithnumber": 3908,
        "text": "\" J'ai interrogé Rafi' bin Khadij sur la location de terres en échange de dinars et d'argent. Il a répondu : \" Il n'y a rien de mal à cela. À l'époque du Messager d'Allah, ils se louaient des terres en échange de ce qui poussait sur les rives des ruisseaux et là où émergeaient les sources - dont certaines zones pouvaient donner de bons produits et d'autres n'en donnaient pas du tout - et les gens ne louaient pas de terres d'une autre manière. Cela était donc interdit. Mais en ce qui concerne les baux dont le rendement est connu et garanti, il n'y a rien. ce n'est pas bien avec ça.'\""
    },
    {
        "hadithnumber": 3909,
        "text": "\"J'ai interrogé Rafi' bin Khadij sur la location de terres. Il a répondu : 'Le Messager d'Allah a interdit la location de terres.' J'ai dit : « Pour l'or ou l'argent ? Il a répondu : « Non, il a plutôt interdit de le louer en échange de ce que la terre produit. Quant à l’or et à l’argent, il n’y a rien de mal à cela."
    },
    {
        "hadithnumber": 3910,
        "text": "\"J'ai demandé à Rafi ben Khadij s'il pouvait louer des terres incultes en échange d'or et d'argent. Il a répondu : '(C'est) permis et il n'y a rien de mal à cela. C'est le dû de la terre.'\""
    },
    {
        "hadithnumber": 3911,
        "text": "\"Le Messager d'Allah nous a interdit de louer nos terres. A cette époque, il n'y avait ni or ni argent. Un homme louait sa terre en échange de ce qui poussait au bord des ruisseaux et à l'endroit où émergeaient les sources, et en échange de quelque chose de spécifique.\""
    },
    {
        "hadithnumber": 3912,
        "text": "Il a été rapporté d'Az-Zuhri que Salim bin 'Abdullah a raconté quelque chose de similaire."
    },
    {
        "hadithnumber": 3913,
        "text": "\"Ô Ibn Khadij, que racontes-tu du Messager d'Allah à propos de la location de terres ?\" Rafi dit à Abdullah : « J'ai entendu deux de mes oncles, qui étaient présents à Badr, dire aux gens de la maison que le Messager d'Allah avait interdit de louer des terres. Abdullah a déclaré: \"Je savais qu'à l'époque du Messager d'Allah, les terres étaient louées.\" Ensuite, Abdullah s'est inquiété du fait que le Messager d'Allah avait décrété quelque chose et qu'il n'en était pas au courant, alors il a arrêté de louer des terres."
    },
    {
        "hadithnumber": 3914,
        "text": "\"Nous avons entendu dire que Rafi bin Khadij racontait que ses oncles paternels - dont il disait qu'ils étaient présents à Badr - (ont dit) que le Messager d'Allah avait interdit la location de terres.\""
    },
    {
        "hadithnumber": 3915,
        "text": "\"Az-Zuhri a dit : 'Ibn Al-Musayyab disait : 'Il n'y a rien de mal à louer des terres en échange d'or et d'argent, et Rafi bin Khadij racontait que le Messager d'Allah l'avait interdit.''\""
    },
    {
        "hadithnumber": 3916,
        "text": "\"Le Messager d'Allah a interdit la location de terres.\" Ibn Shihab a dit : « Après cela, on a demandé à Rafi : « Comment ont-ils loué la terre ? Il a déclaré : « En échange d'une quantité déterminée de nourriture (produits), et il était stipulé que nous aurions tout ce qui poussait sur les rives des ruisseaux et des sources. »"
    },
    {
        "hadithnumber": 3917,
        "text": "\"Nous savions qu'il possédait des terres arables qu'il louait à l'époque du Messager d'Allah en échange de ce qui poussait au bord des cours d'eau, et d'une certaine quantité de paille, je ne sais pas combien cela représentait.\" Ibn Awn l'a rapporté de Nafi mais il a dit : « De certains de ses oncles paternels »."
    },
    {
        "hadithnumber": 3918,
        "text": "\"Ibn 'Umar avait l'habitude de louer un terrain, puis il a entendu quelque chose de Rafi' bin Khadij. Il m'a pris par la main et est parti à Rafi', et j'étais avec lui. Rafi' lui a raconté de la part de certains de ses oncles paternels, que le Messager d'Allah a interdit de louer des terres, alors 'Abd Allah a arrêté (de faire cela) par la suite. \""
    },
    {
        "hadithnumber": 3919,
        "text": "Il a été rapporté d'Ibn 'Umar qu'il louait des terres jusqu'à ce que Rafi' lui raconte, de la part de certains de ses oncles paternels, que le Messager d'Allah avait interdit de louer des terres. Alors il a arrêté de faire ça par la suite."
    },
    {
        "hadithnumber": 3920,
        "text": "\"Le Messager d'Allah interdisait la location de terres arables.\" Alors Ibn 'Umar a arrêté (de faire cela) par la suite. Lorsqu'on lui a posé des questions à ce sujet, il a répondu : « Rafi' bin Khadij a dit que le Prophète l'avait interdit. »"
    },
    {
        "hadithnumber": 3921,
        "text": "\"Il est sorti vers lui (et l'a rencontré) à Al-Balat, et j'étais avec lui. Il lui a posé des questions (à ce sujet) et il a dit : 'Oui, le Messager d'Allah a interdit de louer des terres arables.' Alors 'Abdullah a arrêté de le louer. »"
    },
    {
        "hadithnumber": 3922,
        "text": "\"Un homme a dit à Ibn 'Umar que Rafi' bin Khadij avait rapporté un Hadith concernant la location de terres. Lui et moi, ainsi que l'homme qui lui avait dit cela, sommes allés à Rafi', et il nous a dit que le Messager d'Allah avait interdit la location de terres. Alors 'Abd Allah a arrêté de louer des terres. \""
    },
    {
        "hadithnumber": 3923,
        "text": "Il a été rapporté de Nafi' que Rafi' bin Khadij a dit à 'Abdullah bin 'Umar que le Messager d'Allah avait interdit de louer des terres arables."
    },
    {
        "hadithnumber": 3924,
        "text": "\"Ibn 'Umar avait l'habitude de louer ses terres en échange d'une partie de ses produits. Puis il a entendu que Rafi' bin Khadij avait mis en garde contre cela. Il a dit : 'Le Messager d'Allah a interdit cela.' Il a déclaré : « Nous louions nos terres avant de connaître Rafi ». Puis il (Ibn 'Umar) est devenu incertain, alors il a posé sa main sur mon épaule et nous sommes allés voir Rafi'. 'Abd Allah lui dit : 'As-tu entendu le Prophète interdire la location de terres ?' Rafi' a dit : 'J'ai entendu le Prophète dire : Ne louez pas de terre en échange de quoi que ce soit.'\""
    },
    {
        "hadithnumber": 3925,
        "text": "Il a été rapporté par Rafi' bin Khadij que le Messager d'Allah a interdit la location de terres."
    },
    {
        "hadithnumber": 3926,
        "text": "\"J'ai entendu Ibn 'Umar dire : 'Nous avions l'habitude de vendre du grain avant qu'il ne soit mûr et avant qu'il soit évident qu'il était exempt de maladie et de brûlure (au moyen d'Al-Mukhabarah). Nous n'avons rien vu de mal à cela, jusqu'à ce que Rafi' bin Khadij dise que le Messager d'Allah avait interdit Al-Mukhabarah.'\""
    },
    {
        "hadithnumber": 3927,
        "text": "\"Je témoigne que j'ai entendu Ibn 'Umar poser des questions sur Al-Khibr (l'accord avec Al-Mukhabarah) et il a dit : 'Nous n'avons rien vu de mal à cela, jusqu'à ce qu'Ibn Khadij nous dise plus tôt qu'il a entendu le Messager d'Allah interdire Al-Khibr.'\" Hammad bin Zaid était d'accord avec eux deux."
    },
    {
        "hadithnumber": 3928,
        "text": "\"J'ai entendu Ibn 'Umar dire : 'Nous n'avons rien vu de mal avec Al-Khibr jusqu'à l'année dernière, lorsque Rafi' a dit que le Prophète d'Allah l'avait interdit.'\""
    },
    {
        "hadithnumber": 3929,
        "text": "Il a été rapporté par Jabir bin 'Abdullah que le Prophète a interdit la location de terres."
    },
    {
        "hadithnumber": 3930,
        "text": "\"Le Messager d'Allah a interdit Al-Mukhabarah, Al-Muhaqalah et Al-Muzabanah.\""
    },
    {
        "hadithnumber": 3931,
        "text": "Il a été rapporté d'Ibn 'Umar et Jabir que le Messager d'Allah a interdit de vendre des fruits jusqu'à ce qu'il soit clair qu'ils étaient exempts de défauts, et (il a interdit de) Al-Mukhabara ; louer un terrain en échange d'un tiers ou d'un quart (du rendement)."
    },
    {
        "hadithnumber": 3932,
        "text": "« Louez-vous vos terres arables ? J'ai dit : \"Oui, ô Messager d'Allah. Nous le louons en échange d'un quart et en échange (d'un certain nombre) de Wasqs d'orge.\" Le Messager d'Allah a dit : « Ne faites pas cela. Cultivez-le (vous-mêmes), ou prêtez-le, ou gardez-le. »"
    },
    {
        "hadithnumber": 3933,
        "text": "\"Zuhair bin Rafi' est venu vers nous et a dit : 'Le Messager d'Allah m'a interdit de faire quelque chose qui nous convenait.' J'ai dit : « Qu'est-ce que c'était ? » Il dit : « L'ordre du Messager d'Allah est vrai. Il m'a demandé : Que fais-tu de ta terre ? J'ai dit : Nous le louons moyennant un quart (du rendement) et un certain nombre de Wasqs de dattes ou d'orge. Il a dit : Ne faites pas cela. Cultivez-le, donnez-le à quelqu'un d'autre pour qu'il le cultive ou gardez-le.'\""
    },
    {
        "hadithnumber": 3934,
        "text": "\"Aujourd'hui, le Messager d'Allah a interdit quelque chose qui vous convenait, mais suivre son ordre est un acte d'obéissance (à Allah) et est bon. Il a interdit Al-Haql.\""
    },
    {
        "hadithnumber": 3935,
        "text": "\"J'ai entendu Usaid bin Rafi' bin Khadij Al-Ansari dire qu'ils n'autorisaient pas Al-Muhaqalah, qui est une terre cultivée en échange d'une partie de ses produits.\""
    },
    {
        "hadithnumber": 3936,
        "text": "\"J'étais orphelin sous la garde de mon grand-père Rafi' bin Khadij. J'ai atteint la puberté et je suis devenu un homme, et j'ai accompli le Hajj avec lui. Mon frère 'Imran bin Sahl bin Rafi' bin Khadij est venu et a dit : 'Ô mon père, nous avons loué notre terre à une telle (une femme) pour deux cents dirhams.' Il dit : « Ô mon fils, laisse cela (ne le fais pas), car Allah te donnera une autre provision. Le Messager d'Allah a interdit la location de terres.'\""
    },
    {
        "hadithnumber": 3937,
        "text": "\"Zaid bin Thabit a dit : 'Qu'Allah pardonne à Rafi' bin Khadij. Par Allah, j'ai plus de connaissances que lui en matière de Hadith. Nous étions deux hommes qui se sont battus et le Messager d'Allah a dit : Si c'est ainsi que cela se passe entre vous, alors ne louez pas de terre. Et il a seulement entendu les mots : Ne louez pas de terre.'\""
    },
    {
        "hadithnumber": 3938,
        "text": "\"Muhammad avait l'habitude de dire : 'À mon avis, la terre est comme la richesse mise dans un contrat de Mudarabah (société en commandite). Tout ce qui est valable en ce qui concerne la richesse mise dans une société en commandite de Mudarabah, est valable en ce qui concerne la terre, et tout ce qui n'est pas valable en ce qui concerne la richesse mise dans une société en commandite de Mudarabah, alors cela n'est pas valable en ce qui concerne la terre.'\" Il a dit : \"Il ne voyait rien de mal à donner toute sa terre au laboureur sur la base qu'il travaillerait avec elle. \" lui-même, ou avec ses enfants, ses aides et ses bœufs, et qu'il ne dépenserait rien pour cela ; toutes les dépenses devaient être payées par le propriétaire du terrain."
    }
]