[
    {
        "hadithnumber": 1187,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Said ibn al-Musayyab et Sulayman ibn Yasar et Ibn Shihab disaient tous qu'une femme qui divorçait pour une compensation avait la même idda qu'une femme divorcée - trois périodes. Malik a dit qu'une femme qui se rachetait ne pouvait pas retourner à son mari sauf par un nouveau mariage. Si quelqu'un l'épousait et se séparait ensuite d'elle avant d'avoir eu des rapports avec elle, il n'y avait pas d'idda contre elle du récent mariage, et elle restait sur sa première idda. Malik a dit : \"C'est le meilleur de ce que j'ai entendu sur le sujet.\" Malik a dit : \"Si, quand une femme offre de compenser son mari, il la divorce sur-le-champ, alors cette compensation est confirmée pour lui. S'il ne répond pas, et qu'ensuite à une date ultérieure, il la divorce, il n'a pas droit à cette compensation.\""
    },
    {
        "hadithnumber": 1188,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que Sahl ibn Sad as-Saidi lui a dit que Uwaymir al-Ajlani vint à Asim ibn Adi al-Ansari et lui dit : \"Asim ! Que penses-tu qu'un homme qui trouve un autre homme avec sa femme devrait faire ? Devrait-il le tuer et ensuite être tué lui-même, ou que devrait-il faire ? Asim ! Demande au Messager d'Allah, paix et bénédictions sur lui, à ce sujet pour moi.\" Asim interrogea le Messager d'Allah, paix et bénédictions sur lui, à ce sujet. Le Messager d'Allah, paix et bénédictions sur lui, fut révolté par les questions et les réprouva jusqu'à ce que ce qu'il entendait du Messager d'Allah, paix et bénédictions sur lui, fût intolérable pour Asim. Quand Asim retourna à son peuple, Uwaymir vint à lui et dit : \"Asim ! Qu'est-ce que le Messager d'Allah, paix et bénédictions sur lui, t'a dit ?\" Asim dit à Uwaymir : \"Tu ne m'as apporté rien de bon. Le Messager d'Allah, paix et bénédictions sur lui, a été révolté par la question que je lui ai posée.\" Uwaymir dit : \"Par Allah ! Je ne m'arrêterai pas avant de l'interroger à ce sujet !\" Uwaymir se leva et alla au Messager d'Allah, paix et bénédictions sur lui, au milieu des gens et dit : \"Messager d'Allah ! Que penses-tu qu'un homme qui trouve un autre homme avec sa femme devrait faire ? Devrait-il le tuer et ensuite être tué lui-même, ou que devrait-il faire ?\" Le Messager d'Allah, paix et bénédictions sur lui, dit : \"Quelque chose a été révélé à ton sujet et au sujet de ta femme, alors va et amène-la.\" Sahl continua : \"Ils se maudirent mutuellement en présence du Messager, paix et bénédictions sur lui, et j'étais présent avec les gens. Quand ils eurent fini de se maudire, Uwaymir dit : 'J'aurai menti à son sujet, Messager d'Allah, si je la garde,' et il prononça le divorce trois fois avant que le Messager d'Allah, paix et bénédictions sur lui, ne lui ordonne de le faire.\" Malik a dit que Ibn Shihab a dit : \"C'est ainsi que la sunna d'un couple se maudissant mutuellement fut établie (lian).\""
    },
    {
        "hadithnumber": 1189,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Abdullah ibn Umar, qu'un homme maudit sa femme au temps du Messager d'Allah, paix et bénédictions sur lui, et désavoua son enfant. Le Messager d'Allah, paix et bénédictions sur lui, les sépara et donna l'enfant à la femme. Malik a dit : \"Allah le Béni, l'Exalté, a dit : 'Et quant à ceux qui lancent des accusations contre leurs propres épouses, sans avoir d'autres témoins qu'eux-mêmes, le témoignage de l'un d'eux devra être une quadruple attestation par Allah qu'il est du nombre des véridiques, et la cinquième attestation est que la malédiction d'Allah tombe sur lui s'il est du nombre des menteurs. Et le châtiment sera écarté d'elle si elle atteste quatre fois par Allah qu'il est certainement du nombre des menteurs, et la cinquième attestation est que la colère d'Allah soit sur elle, s'il était du nombre des véridiques.' (Sourate 24 versets 6-9). Malik a dit : \"La sunna chez nous est que ceux qui se maudissent mutuellement ne doivent jamais être remariés. Si l'homme se qualifie de menteur (c'est-à-dire retire son accusation), il est flagellé avec la peine hadd, et l'enfant lui est donné, et sa femme ne peut jamais retourner à lui. Il n'y a aucun doute ou dispute à ce sujet parmi nous.\" Malik a dit : \"Si un homme se sépare de sa femme par un divorce irrévocable par lequel il ne peut pas retourner à elle, et qu'Ensuite il nie la paternité de l'enfant qu'elle porte, alors qu'elle prétend qu'il est le père, et qu'il est possible par le timing qu'il le soit, il doit la maudire, et l'enfant n'est pas reconnu comme le sien.\" Malik a dit : \"C'est ce qui est fait parmi nous, et c'est ce que j'ai entendu des gens de science.\" Malik a dit qu'un homme qui accusait sa femme après l'avoir divorcée trois fois alors qu'elle était enceinte, et qu'il avait d'abord accepté d'être le père mais prétendait ensuite qu'il l'avait vue commettre l'adultère avant de se séparer d'elle, était flagellé avec la peine hadd, et ne la maudissait pas. S'il niait la paternité de son enfant après l'avoir divorcée trois fois, et qu'il ne l'avait pas accepté auparavant, alors il la maudissait. Malik a dit : \"C'est ce que j'ai entendu.\" Malik a dit : \"L'esclave est dans la même position que l'homme libre en ce qui concerne les accusations et l'invocation de malédictions mutuelles (lian). Il agit dans le lian comme l'homme libre agit bien qu'il n'y ait pas de hadd appliqué pour calomnie d'une esclave.\" Malik a dit : \"L'esclave musulmane et la femme libre chrétienne et juive font aussi le lian quand un musulman libre épouse l'une d'elles et a des rapports avec elle. C'est parce qu'Allah - qu'Il soit béni et Exalté, a dit dans Son Livre : 'Quant à ceux qui accusent leurs femmes,' et ce sont leurs femmes. C'est ce qui est fait parmi nous. Malik a dit qu'un homme qui faisait le lian avec sa femme, et s'arrêtait ensuite et se qualifiait de menteur après un ou deux serments et qu'il ne s'était pas maudit lui-même dans le cinquième, devait être flagellé avec la peine hadd, mais ils n'avaient pas à être séparés. Malik a dit que si un homme divorçait de sa femme et qu'après trois mois la femme disait : \"Je suis enceinte,\" et qu'il niait la paternité, alors il devait faire le lian. Malik a dit que le mari d'une esclave qui prononçait le lian sur elle et l'achetait ensuite, ne devait pas avoir de rapports avec elle, même s'il la possédait. La sunna qui a été transmise au sujet d'un couple qui se maudissait mutuellement dans le lian était qu'ils ne devaient jamais retourner l'un à l'autre. Malik a dit que lorsqu'un homme prononçait le lian contre sa femme avant d'avoir consommé le mariage, elle n'avait que la moitié de la dot.\""
    },
    {
        "hadithnumber": 1200,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Abd ar-Rahman ibn Awf divorça de sa femme, et lui donna une compensation sous la forme d'une esclave."
    },
    {
        "hadithnumber": 1202,
        "text": "Yahya m'a rapporté de Malik que Ibn Shihab a dit : \"Toute femme divorcée a une compensation.\" Malik a dit : \"J'ai aussi entendu la même chose de al-Qasim ibn Muhammad.\" Malik a dit : \"Il n'y a pas de limite fixée parmi nous quant à la petitesse ou la grandeur de la compensation.\""
    },
    {
        "hadithnumber": 1208,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar a dit : \"Si un homme donne à son esclave la permission de se marier, le divorce est dans la main de l'esclave, et personne d'autre n'a de pouvoir sur son divorce. Rien n'est retenu contre un homme qui prend l'esclave de son esclave mâle ou l'esclave de son esclave femelle.\""
    },
    {
        "hadithnumber": 1217,
        "text": "Yahya m'a rapporté de Malik, de al-Fudayl ibn Abi Abdullah, le mawla de al-Mahri, que al-Qasim ibn Muhammad et Salim ibn Abdullah ont dit : \"Quand une femme est divorcée et commence sa troisième période, elle est clairement séparée de lui et est libre de se remarier.\""
    },
    {
        "hadithnumber": 1218,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Said ibn al-Musayyab et Ibn Shihab et Sulayman ibn Yasar disaient tous : \"L'idda de la femme avec un divorce khul est de trois périodes.\""
    },
    {
        "hadithnumber": 1219,
        "text": "Yahya m'a rapporté de Malik qu'il a entendu Ibn Shihab dire : \"L'idda de la femme divorcée est comptée par les cycles menstruels même si elle est éloignée.\" (La raison pour laquelle l'idda est normalement comptée par le cycle menstruel est de voir si la femme est enceinte ou non)."
    },
    {
        "hadithnumber": 1226,
        "text": "Yahya m'a rapporté de Malik qu'il a entendu Ibn Shihab dire : \"La femme qui est absolument divorcée ne quitte pas sa maison jusqu'à ce qu'elle soit libre de se remarier. Elle n'a pas d'entretien sauf si elle est enceinte. Dans cette circonstance, le mari dépense pour elle jusqu'à ce qu'elle accouche.\" Malik a dit : \"C'est ce qui est fait parmi nous.\""
    },
    {
        "hadithnumber": 1227,
        "text": "Malik a dit : \"Ce qui est fait parmi nous quand un esclave divorce d'une esclave alors qu'elle est esclave et qu'elle est ensuite affranchie, est que son idda est l'idda d'une esclave, et son affranchissement ne change pas son idda qu'il puisse encore revenir à elle ou non. Son idda n'est pas modifiée.\" Malik a ajouté : \"La peine hadd qu'un esclave encourt est la même que cela. Quand il est affranchi après avoir encouru mais avant que la punition n'ait été exécutée, son hadd est le hadd de l'esclave.\" Malik a dit : \"Quand un homme libre divorce d'une esclave trois fois, son idda est de deux périodes. Quand un esclave divorce d'une femme libre deux fois, son idda est de trois périodes.\" Malik a dit au sujet d'un homme qui avait une esclave comme épouse, et il l'acheta et l'affranchit : \"Son idda est l'idda d'une esclave, c'est-à-dire deux périodes, tant qu'il n'a pas eu de rapports avec elle. S'il a eu des rapports avec elle après l'avoir achetée et avant de l'avoir affranchie, elle doit seulement attendre qu'une période soit passée.\" Yahya m'a rapporté de Malik, de Yahya ibn Said et de Yazid ibn Abdullah ibn Qusayt al-Laythi, que Said ibn al-Musayyab a dit : \"Umar ibn al-Khattab a dit : 'Si une femme est divorcée et a une ou deux périodes et ensuite arrête d'avoir ses règles, elle doit attendre neuf mois. S'il est clair qu'elle est enceinte, c'est cela. Sinon, elle doit faire une idda de trois mois après les neuf, et ensuite elle est libre de se marier.\""
    },
    {
        "hadithnumber": 1228,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, que Said ibn al-Musayyab a dit : \"Le divorce appartient aux hommes, et les femmes ont l'idda.\""
    },
    {
        "hadithnumber": 1229,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que Said ibn al-Musayyab a dit : \"L'idda de la femme qui saigne constamment est un an.\" Malik a dit : \"Ce qui est fait parmi nous au sujet d'une femme divorcée dont les périodes s'arrêtent quand son mari la divorce est qu'elle attend neuf mois. Si elle n'a pas eu de période en eux, elle a une idda de trois mois. Si elle a une période avant la fin des trois mois, elle accepte la période. Si neuf autres mois passent sans qu'elle ait une période, elle fait une idda de trois mois. Si elle a une deuxième période avant la fin de ces trois mois, elle accepte la période. Si neuf mois passent alors sans une période, elle fait une idda de trois mois. Si elle a une troisième période, l'idda de la période est complète. Si elle n'a pas de période, elle attend trois mois, et ensuite elle est libre de se marier. Son mari peut revenir à elle avant qu'elle ne devienne libre de se marier à moins qu'il n'ait rendu son divorce irrévocable.\" Malik a dit : \"La sunna chez nous est que quand un homme divorce de sa femme et a l'option de revenir à elle, et qu'elle fait une partie de son idda et qu'ensuite il revient à elle et se sépare ensuite d'elle avant d'avoir eu des rapports avec elle, elle n'ajoute pas à ce qui est passé de son idda. Son mari s'est fait du tort à lui-même et a erré s'il est revenu à elle et n'avait pas besoin d'elle.\" Malik a dit : \"Ce qui est fait parmi nous est que si une femme devient musulmane alors que son mari est un kafir et qu'ensuite il devient musulman, il a droit à elle tant qu'elle est dans son idda. Si son idda est finie, il n'a aucun accès à elle. S'il la remarie après la fin de son idda, cependant, ce n'est pas compté comme un divorce. L'Islam l'a retirée de lui sans divorce.\""
    },
    {
        "hadithnumber": 1231,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Umar ibn al-Khattab, Abdullah ibn Umar, Abdullah ibn Masud, Salim ibn Abdullah, al-Qasim ibn Muhammad, Ibn Shihab, et Sulayman ibn Yasar disaient tous : \"Si un homme a fait le vœu de divorcer de sa femme avant de l'épouser et qu'ensuite il rompt son vœu, le divorce est obligatoire pour lui quand il l'épouse.\""
    },
    {
        "hadithnumber": 1233,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que Said ibn al-Musayyab a dit : \"Si quelqu'un épouse une femme et ne peut pas avoir de rapports avec elle, une échéance d'un an est fixée pour lui pour avoir des rapports avec elle. S'il ne le fait pas, ils sont séparés.\""
    },
    {
        "hadithnumber": 1242,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Said ibn al-Musayyab disait : \"Si un homme ne trouve pas les moyens de dépenser pour sa femme, ils doivent être séparés.\" Malik a dit : \"C'est ce que j'ai vu les gens de science faire dans notre ville.\""
    },
    {
        "hadithnumber": 1248,
        "text": "Yahya m'a rapporté de Malik, de Humayd ibn Qays al-Makki, de Amr ibn Shuayb, de Said ibn al-Musayyab, que Umar ibn al-Khattab renvoyait les veuves du désert et les empêchait de faire le hajj."
    },
    {
        "hadithnumber": 1250,
        "text": "Yahya m'a rapporté de Malik que Hisham ibn Urwa a dit au sujet d'une bédouine dont le mari mourait, qu'elle devait rester où son peuple restait. Malik a dit : \"C'est ce qui est fait parmi nous.\""
    },
    {
        "hadithnumber": 1251,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar a dit : \"Le seul endroit où une femme dont le mari est mort et une femme qui est absolument divorcée peuvent passer la nuit est dans leurs maisons.\""
    },
    {
        "hadithnumber": 1252,
        "text": "Yahya m'a rapporté de Malik que Yahya ibn Said a dit qu'il avait entendu al-Qasim ibn Muhammad dire que Zayd ibn Abd al-Malik séparait certains hommes et leurs femmes qui étaient des esclaves qui avaient donné des enfants à des hommes qui étaient morts, parce qu'ils les avaient épousées après une ou deux périodes menstruelles. Il les séparait jusqu'à ce qu'elles aient fait une idda de quatre mois et dix jours. Al-Qasim ibn Muhammad a dit : \"Gloire à Allah ! Allah dit dans Son Livre : 'Ceux d'entre vous qui meurent, laissant des femmes,' elles ne sont pas des femmes.\""
    },
    {
        "hadithnumber": 1253,
        "text": "Malik m'a rapporté de Nafi que Abdullah ibn Umar disait : \"L'idda d'une umm walad quand son maître meurt est une période menstruelle.\""
    },
    {
        "hadithnumber": 1254,
        "text": "Malik a dit : \"C'est ce qui est fait parmi nous.\" Malik a ajouté : \"Si elle n'a pas de période menstruelle, son idda est de trois mois.\""
    },
    {
        "hadithnumber": 1255,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Said ibn al-Musayyab et Sulayman ibn Yasar disaient : \"L'idda d'une esclave quand son mari meurt est de deux mois et cinq jours.\""
    },
    {
        "hadithnumber": 1256,
        "text": "Yahya m'a rapporté la même chose de Malik, de Ibn Shihab. Malik a dit, au sujet d'un esclave qui divorçait d'une esclave mais ne le rendait pas absolu : \"Il peut revenir à elle. S'il meurt ensuite alors qu'elle est encore dans l'idda de son divorce, elle fait l'idda d'une esclave dont le mari meurt, et c'est deux mois et cinq jours. Si elle a été affranchie et qu'il peut revenir à elle, et qu'elle ne choisit pas de se séparer après avoir été affranchie, et qu'il meurt alors qu'elle est dans l'idda du divorce, elle fait l'idda d'une femme libre dont le mari est mort, quatre mois et dix jours. C'est parce que l'idda de veuvage lui est tombée dessus alors qu'elle était libre, donc son idda est l'idda d'une femme libre.\" Malik a dit : \"C'est ce qui est fait parmi nous.\""
    },
    {
        "hadithnumber": 1257,
        "text": "Yahya m'a rapporté de Malik, de Rabia ibn Abi Abd ar-Rahman, de Muhammad ibn Yahya ibn Habban, que Ibn Muhayriz a dit : \"Je suis entré dans la mosquée et j'ai vu Abu Said al-Khudri et donc je me suis assis près de lui et je l'ai interrogé sur le coït interrompu. Abu Said al-Khudri a dit : 'Nous sommes sortis avec le Messager d'Allah, paix et bénédictions sur lui, lors de l'expédition des Banu al-Mustaliq. Nous avons fait prisonniers certains Arabes, et nous désirions les femmes car le célibat était dur pour nous. Nous voulions la rançon, alors nous voulions pratiquer le coït interrompu. Nous avons dit : 'Allons-nous pratiquer le coït interrompu alors que le Messager d'Allah, paix et bénédictions sur lui, est parmi nous avant de lui demander ?' Nous l'avons interrogé à ce sujet et il a dit : 'Vous n'avez pas à ne pas le faire. Il n'y a pas d'âme qui doit venir à l'existence jusqu'au Jour de la Résurrection sans qu'elle ne vienne à l'existence'.\""
    },
    {
        "hadithnumber": 1258,
        "text": "Yahya m'a rapporté de Malik, de Abu'n-Nadr, le mawla de Umar ibn Ubaydullah, de Amir ibn Sad ibn Abi Waqqas, de son père, qu'il pratiquait le coït interrompu."
    },
    {
        "hadithnumber": 1259,
        "text": "Yahya m'a rapporté de Malik, de Abu'n-Nadr, le mawla de Umar ibn Ubaydullah, de Ibn Aflah, le mawla de Abu Ayyub al-Ansari, d'une umm walad de Abu Ayyub al-Ansari, qu'il pratiquait le coït interrompu."
    },
    {
        "hadithnumber": 1260,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar ne pratiquait pas le coït interrompu et pensait que c'était désapprouvé."
    },
    {
        "hadithnumber": 1282,
        "text": "Yahya m'a rapporté de Malik que Yahya ibn Said a dit qu'il a entendu Said ibn al-Musayyab dire : \"L'allaitement n'est que tant que l'enfant est dans le berceau. Sinon, cela ne cause pas de relations de chair et de sang.\""
    },
    {
        "hadithnumber": 1287,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Dinar, de Sulayman ibn Yasar et de Urwa ibn az-Zubayr, de A'isha mère des croyants, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Ce qui est haram par la naissance est haram par l'allaitement.\""
    }
]