[
    {
        "hadithnumber": 929,
        "text": "Yahya m'a rapporté de Malik, de Abd ar-Rahman ibn al-Qasim, de son père, de A'isha mère des croyants, que Safiyya bint Huyy commença à avoir ses règles et elle le mentionna au Messager d'Allah, paix et bénédictions sur lui, et il demanda : \"Nous retardera-t-elle ?\" et on lui dit : \"Elle a déjà fait le tawaf al-ifada,\" et il dit : \"Alors elle ne nous retardera pas.\""
    },
    {
        "hadithnumber": 930,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Abi Bakr ibn Hazm, de son père, de Amra bint Abd ar-Rahman, que A'isha mère des croyants a dit au Messager d'Allah, paix et bénédictions sur lui : \"Messager d'Allah, Safiyya bint Huyy a commencé ses règles,\" et le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Peut-être qu'elle nous retardera. A-t-elle fait le tawaf de la Maison avec vous ?\" Ils dirent : \"Bien sûr.\" Il dit : \"Alors vous êtes libres de partir.\""
    },
    {
        "hadithnumber": 932,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, de son père, de A'isha mère des croyants, que le Messager d'Allah, paix et bénédictions sur lui, mentionna Safiyya bint Huyy et on lui dit qu'elle avait commencé ses règles. Le Messager d'Allah, paix et bénédictions sur lui, dit : \"Peut-être qu'elle nous retardera.\" Ils dirent : \"Messager d'Allah, elle a fait le tawaf,\" et le Messager d'Allah, paix et bénédictions sur lui, dit : \"Alors elle ne nous retardera pas.\" Malik a dit que Hisham a dit que Urwa a dit que A'isha a dit : \"Nous avons rendu cela public, alors pourquoi les gens font-ils rester leurs femmes à leur désagrément ? Si c'était comme ils disent, plus de six mille femmes menstruées seraient encore à Mina le matin, toutes ayant déjà fait le tawaf al-ifada.\""
    },
    {
        "hadithnumber": 933,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Abi Bakr, de son père, que Abu Salama ibn Abd ar-Rahman lui a dit que Umm Sulaym bint Milhan demanda conseil au Messager d'Allah, paix et bénédictions sur lui, une fois qu'elle avait commencé à avoir ses règles, ou avait donné naissance à un enfant après avoir fait le tawaf al-ifada le Jour du Sacrifice. Le Messager d'Allah, paix et bénédictions sur lui, lui donna la permission de partir. Malik a dit : \"Une femme ayant ses règles à Mina reste jusqu'à ce qu'elle ait fait le tawaf de la Maison. Il n'y a pas d'échappatoire à cela pour elle. Si elle a déjà fait le tawaf al-ifada et qu'elle commence à avoir ses règles ensuite, elle peut partir pour son pays, puisque la permission pour les femmes menstruées de partir nous a été transmise du Messager d'Allah, paix et bénédictions sur lui.\" Il a ajouté : \"Si une femme commence ses règles à Mina avant de faire le tawaf al-ifada, et que la période dure plus longtemps que d'habitude, elle doit rester plus longtemps que le temps que le saignement retiendrait habituellement les femmes.\""
    },
    {
        "hadithnumber": 938,
        "text": "Malik a dit : \"J'entends toujours dire que lorsqu'une personne en ihram tue une autruche, un chameau est dû.\" Malik a dit : \"Je pense que pour un œuf d'autruche, un dixième du prix d'un chameau est dû de la même manière qu'il y a un esclave mâle ou femelle nouveau-né pour l'enfant à naître d'une femme libre. La valeur de l'esclave nouveau-né est de cinquante dinars, et c'est un dixième de ce que serait le prix du sang pour la mère. Les oiseaux de la famille des aigles, les aigles ou faucons ou vautours comptent comme du gibier pour lequel un prix est payé tout comme un prix est payé pour tout gibier qu'une personne en ihram tue. Pour tout ce pour quoi une pénalité est payée, l'évaluation est la même, que l'animal soit vieux ou jeune. L'analogie de cela est que le prix du sang pour l'homme libre jeune et vieux est considéré comme le même.\" Yahya m'a rapporté de Malik, de Zayd ibn Aslam, qu'un homme vint à Umar ibn al-Khattab et dit : \"Amir al-muminin, j'ai tué des sauterelles avec mon fouet alors que j'étais en ihram,\" et Umar lui dit : \"Donne une poignée de nourriture.\""
    },
    {
        "hadithnumber": 944,
        "text": "Malik a dit, concernant quelqu'un qui souhaite porter des vêtements qu'une personne en ihram ne doit pas porter, ou couper ses cheveux, ou toucher du parfum sans nécessité, parce qu'il trouve facile de payer la compensation : \"Personne ne doit faire de telles choses. Elles ne sont permises qu'en cas de nécessité, et une compensation est due par quiconque les fait.\" On demanda à Malik si le coupable pouvait choisir pour lui-même la méthode de compensation qu'il fait, et on lui demanda quel genre d'animal devait être sacrifié, et combien de nourriture devait être donnée, et combien de jours devaient être jeûnés, et si la personne pouvait retarder l'un de ceux-ci, ou s'ils devaient être faits immédiatement. Il répondit : \"Chaque fois qu'il y a des alternatives dans le Livre d'Allah pour la kaffara, le coupable peut choisir de faire l'une des alternatives qu'il préfère. Quant au sacrifice - un mouton, et quant au jeûne - trois jours. Quant à la nourriture - nourrir six pauvres, pour chaque pauvre deux mudds, par le premier mudd, le mudd du Prophète, paix et bénédictions sur lui.\" Malik a dit : \"J'ai entendu l'un des gens de science dire : 'Quand une personne en ihram jette quelque chose et touche du gibier involontairement et le tue, elle doit payer une compensation. De la même manière, quelqu'un en dehors du Haram qui jette quoi que ce soit dans le Haram et touche du gibier qu'il n'avait pas l'intention de toucher, le tuant, doit payer une compensation, parce que l'intentionnel et l'erreur sont dans la même position dans cette affaire'.\" Malik a dit, concernant des gens qui tuent du gibier ensemble alors qu'ils sont en ihram ou dans le Haram : \"Je pense que chacun d'eux doit une part complète. Si un animal sacrificiel est décidé pour eux, chacun d'eux en doit un, et si le jeûne est décidé pour eux, le jeûne complet est dû par chacun d'eux. L'analogie de cela est un groupe de personnes qui tuent un homme par erreur et la kaffara pour cela est que chaque personne parmi eux doit libérer un esclave ou jeûner deux mois consécutifs.\" Malik a dit : \"Quiconque lapide ou chasse du gibier après avoir lapidé la jamra et rasé sa tête mais avant d'avoir accompli le tawaf al-ifada, doit une compensation pour ce gibier, parce qu'Allah le Béni, l'Exalté a dit : 'Et quand vous quittez l'ihram, alors chassez', et des restrictions demeurent pour quelqu'un qui n'a pas fait le tawaf al-ifada concernant le fait de toucher du parfum et des femmes.\" Malik a dit : \"La personne en ihram ne doit rien pour les plantes qu'elle coupe dans le Haram et il ne nous est pas parvenu que quiconque ait donné une décision de quoi que ce soit pour cela, mais ô combien est mauvais ce qu'elle a fait !\" Malik a dit, concernant quelqu'un qui ignorait, ou qui a oublié le jeûne de trois jours dans le hajj, ou qui était malade pendant ceux-ci et ne les a donc pas jeûnés jusqu'à ce qu'il soit retourné dans sa communauté : \"Il doit offrir un animal sacrificiel (hady) s'il peut en trouver un et sinon il doit jeûner les trois jours parmi son peuple et les sept restants après cela.\" Yahya m'a rapporté de Malik, de Ibn Shihab, de Isa ibn Talha, que Abdullah ibn Amr ibn al-As a dit : \"Le Messager d'Allah, paix et bénédictions sur lui, s'arrêta pour les gens à Mina, et ils l'interrogèrent et un homme vint et lui dit : 'Messager d'Allah, je n'étais pas clair sur ce qu'il fallait faire et je me suis rasé avant de sacrifier', et le Messager d'Allah, paix et bénédictions sur lui, dit : 'Sacrifie, et ne t'inquiète pas.' Puis un autre vint à lui et dit : 'Messager d'Allah, je n'étais pas clair sur ce qu'il fallait faire et j'ai sacrifié avant de jeter les pierres.' Il conseilla : 'Jette, et ne t'inquiète pas'.\" Amr continua, disant que le Messager d'Allah, paix et bénédictions sur lui, ne fut interrogé sur rien fait avant ou après sans qu'il dise : \"Fais-le, et ne t'inquiète pas.\""
    },
    {
        "hadithnumber": 954,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Abdullah ibn Abbas disait que la zone entre le coin de la Pierre Noire et la porte de la Kaaba était appelée al-Multazam."
    },
    {
        "hadithnumber": 957,
        "text": "Malik a dit, concernant une femme qui n'avait jamais été au hajj : \"Si elle n'a pas de mahram, ou si elle en a un, mais qu'il ne peut pas venir avec elle, elle n'abandonne pas le fait qu'Allah a rendu le hajj obligatoire pour elle. Qu'elle aille dans un groupe de femmes.\" Yahya m'a rapporté de Malik, de Ibn Shihab, de Urwa ibn az-Zubayr, que A'isha mère des croyants disait : \"Quelqu'un accomplissant le hajj at-tamattu qui n'a pas d'animal sacrificiel jeûne (trois jours) à partir du moment où il entre en ihram pour le hajj jusqu'au Jour d'Arafa, et s'il ne jeûne pas alors, il jeûne les jours de Mina.\" Yahya m'a rapporté de Malik, de Ibn Shihab, de Salim ibn Abdullah, que Abdullah ibn Umar disait la même chose concernant cela, comme les mots de A'isha, qu'Allah l'Exalté soit satisfait d'elle."
    },
    {
        "hadithnumber": 974,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, qu'il a entendu Said ibn al-Musayyab dire : \"Quand les gens dans les expéditions militaires divisaient le butin, ils rendaient un chameau égal à dix moutons.\" Malik a dit au sujet du travailleur payé dans les expéditions militaires : \"S'il est présent à la bataille et est avec les gens dans la bataille et qu'il est un homme libre, il a sa part. S'il n'est pas présent, il n'a pas de part.\" Malik a résumé : \"Je pense que le butin n'est divisé que parmi les hommes libres qui ont été présents à la bataille.\""
    },
    {
        "hadithnumber": 975,
        "text": "Malik a dit au sujet des soldats ennemis qui ont été trouvés sur le rivage d'une terre musulmane, et qu'ils prétendaient qu'ils étaient des marchands et que la mer les avait poussés à terre, alors que les Musulmans n'étaient capables de vérifier rien de cela sauf que leurs navires étaient endommagés, ou qu'ils avaient soif et avaient débarqué sans la permission des Musulmans : \"Je pense que c'est à l'imam de donner son opinion sur eux, et je ne pense pas que la taxe d'un cinquième soit prélevée sur eux.\" Malik a dit : \"Je ne vois aucun mal à ce que les Musulmans mangent tout ce qu'ils trouvent comme nourriture en territoire ennemi avant que le butin ne soit divisé.\" Malik a dit : \"Je pense que tous chameaux, bétail et moutons (pris comme butin) sont considérés comme de la nourriture que les Musulmans peuvent manger en territoire ennemi. S'ils ne pouvaient pas être mangés avant que les gens ne se soient rassemblés pour la division et que le butin n'ait été distribué parmi eux, cela serait nuisible pour l'armée. Je ne vois aucune objection à manger de telles choses dans des limites acceptables. Je ne pense pas, cependant, que quiconque devrait en stocker pour le ramener à sa famille.\" On demanda à Malik s'il était correct pour un homme qui obtenait de la nourriture en territoire ennemi et en mangeait une partie et faisait des provisions pour qu'il en reste à garder et à manger avec sa famille, ou à vendre avant d'être arrivé dans son pays et à utiliser son prix. Il dit : \"S'il le vend pendant qu'il est en expédition militaire, je pense qu'il devrait mettre son prix dans le butin des Musulmans. S'il le ramène dans son pays, je ne vois aucune objection à ce qu'il le mange et l'utilise si c'est une petite chose insignifiante.\" Yahya m'a rapporté de Malik qu'il lui est parvenu qu'un esclave de Abdullah ibn Umar s'échappa et l'un de ses chevaux s'égara, et les idolâtres les saisirent. Puis les Musulmans les reprirent, et ils furent rendus à Abdullah ibn Umar, avant que la division du butin n'ait lieu. J'ai entendu Malik dire au sujet de la propriété musulmane qui avait été saisie par l'ennemi : \"Si elle est remarquée avant la distribution, alors elle est rendue à son propriétaire. Tout ce qui a déjà été distribué n'est rendu à personne.\" Malik, lorsqu'on lui demanda au sujet d'un homme dont le jeune esclave mâle fut pris par les idolâtres et ensuite les Musulmans le reprirent, dit : \"Le propriétaire a plus droit à lui sans avoir à payer son prix ou sa valeur ou avoir à subir de perte avant que la distribution n'ait lieu. Si la distribution a déjà eu lieu, alors je pense que l'esclave appartient à son maître pour son prix si le maître le veut de retour.\" Concernant une umm walad d'un homme musulman qui a été prise par les idolâtres et ensuite reprise par les Musulmans et allouée dans la distribution du butin et ensuite reconnue par son maître après la distribution, Malik a dit : \"Elle ne doit pas être réduite en esclavage. Je pense que l'Imam devrait payer une rançon pour elle pour son maître. S'il ne le fait pas, alors son maître doit payer une rançon pour elle et ne pas la laisser. Je ne pense pas qu'elle devrait être faite esclave par quiconque la prend et les rapports avec elle ne sont pas halal. Elle est dans la position d'une femme libre parce que son maître serait tenu de payer une compensation si elle blessait quelqu'un et donc elle est dans la même position (qu'une épouse). Il ne doit pas laisser la mère de son fils être réduite en esclavage ni les rapports avec elle ne peuvent être rendus halal.\" On demanda à Malik au sujet d'un homme qui allait en territoire ennemi pour payer une rançon ou pour commercer, et il acheta un homme libre ou un esclave, ou ils lui furent donnés. Il dit : \"Quant à l'homme libre, le prix pour lequel il l'achète est une dette contre l'homme et il n'est pas fait esclave. Si le captif lui est donné gratuitement, il est libre et ne doit rien à moins que l'homme ait donné quelque chose en récompense pour lui. C'est une dette contre l'homme libre, de la même manière que si une rançon avait été payée pour lui. Quant à un esclave, son ancien maître peut choisir de le reprendre et de payer son prix à l'homme qui l'a acheté ou il peut choisir de le laisser, comme il le souhaite. S'il a été donné à l'homme, l'ancien maître a plus droit à lui, et il ne doit rien pour lui à moins que l'homme ait donné quelque chose pour lui en récompense. Quoi qu'il ait donné pour lui est une perte contre le maître s'il le veut de retour.\""
    },
    {
        "hadithnumber": 1008,
        "text": "Yahya m'a rapporté de Malik que Rabia ibn Abi Abd ar-Rahman a dit : \"Des biens furent envoyés à Abu Bakr as-Siddiq de Bahreïn. Il dit : 'Si quelqu'un avait une promesse ou un engagement avec le Messager d'Allah, paix et bénédictions sur lui, qu'il vienne à moi.' Alors Jabir ibn Abdullah vint à lui, et il lui donna trois fois autant que ce qui remplirait les deux mains.\""
    },
    {
        "hadithnumber": 1009,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, de Ubaydullah ibn Abdullah ibn Utba ibn Masud, de Abdullah ibn Abbas, que Sad ibn Ubada interrogea le Messager d'Allah, paix et bénédictions sur lui, et dit : \"Ma mère est morte alors qu'elle avait encore un vœu qu'elle n'avait pas accompli.\" Le Messager d'Allah, paix et bénédictions sur lui, dit : \"Accomplis-le pour elle.\""
    },
    {
        "hadithnumber": 1017,
        "text": "Yahya m'a rapporté de Malik, de Talha ibn Abi al-Malik al-Ayli, de al-Qasim ibn Muhammad ibn as-Siddiq, de A'isha, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Quiconque fait le vœu d'obéir à Allah, qu'il Lui obéisse. Quiconque fait le vœu de désobéir à Allah, qu'il ne Lui désobéisse pas.\" Yahya a dit qu'il avait entendu Malik dire : \"Le sens de la déclaration du Prophète, paix et bénédictions sur lui, 'Quiconque fait le vœu de désobéir à Allah, qu'il ne Lui désobéisse pas' est que par exemple un homme qui fait le vœu que, s'il parle à une telle personne, il marchera jusqu'en Syrie, en Égypte, ou toute autre chose de ce genre qui n'est pas considérée comme ibada, n'est sous aucune obligation par rien de cela, même s'il a parlé à l'homme ou a rompu quoi que ce soit qu'il a juré, parce qu'Allah ne demande pas l'obéissance dans de telles choses. Il ne doit accomplir que les choses dans lesquelles il y a obéissance à Allah.\""
    },
    {
        "hadithnumber": 1022,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar faisait une kaffara pour un serment rompu en nourrissant dix pauvres. Chaque personne recevait un mudd de blé. Il libérait parfois un esclave s'il avait répété le serment."
    },
    {
        "hadithnumber": 1028,
        "text": "Yahya m'a rapporté de Malik, de Amr ibn al-Harith, de Ubayd ibn Fayruz, de al-Bara ibn Azib, que l'on demanda au Messager d'Allah, paix et bénédictions sur lui, quels animaux devaient être évités comme sacrifices. Il indiqua avec sa main et dit : \"Quatre.\" Al-Bara pointa avec sa main et dit : \"Ma main est plus courte que la main du Messager d'Allah, paix et bénédictions sur lui. Un animal boiteux dont la boiterie est évidente, un animal borgne qui est clairement borgne, un animal qui est clairement malade, et un animal émacié qui n'a pas de graisse sur lui.\""
    },
    {
        "hadithnumber": 1029,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar se gardait des animaux et des chameaux qui étaient jeunes ou avaient des défauts physiques comme sacrifices. Malik a dit : \"C'est ce que j'aime le mieux de ce que j'ai entendu.\""
    },
    {
        "hadithnumber": 1033,
        "text": "Yahya m'a rapporté de Malik, de Abu'z-Zubayr al-Makki, de Jabir ibn Abdullah, que le Messager d'Allah, paix et bénédictions sur lui, a interdit que la viande des animaux sacrificiels soit mangée après trois jours. Puis plus tard il a dit : \"Mangez, donnez en sadaqa, pourvoyez à vous-mêmes et stockez.\""
    },
    {
        "hadithnumber": 1038,
        "text": "Yahya m'a rapporté de Malik que Ibn Shihab a dit : \"Le Messager d'Allah, paix et bénédictions sur lui, n'a sacrifié qu'un chameau ou une vache pour lui-même et sa famille.\" Malik a dit : \"Je ne sais pas lequel d'entre eux Ibn Shihab a dit.\""
    },
    {
        "hadithnumber": 1041,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar ne sacrifiait pas pour l'enfant dans le ventre. Malik a dit : \"Le sacrifice est une sunna, et ce n'est pas obligatoire. Je préfère que quiconque a le prix de l'animal ne l'abandonne pas.\""
    },
    {
        "hadithnumber": 1042,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, que son père a dit : \"Le Messager d'Allah, paix et bénédictions sur lui, fut interrogé : 'Messager d'Allah ! Des gens du désert nous apportent de la viande, et nous ne savons pas si le nom d'Allah a été mentionné dessus ou non.' Le Messager d'Allah, paix et bénédictions sur lui, a dit : 'Mentionnez le nom d'Allah dessus et mangez.'\" Malik a dit : \"C'était au début de l'Islam.\""
    },
    {
        "hadithnumber": 1047,
        "text": "Yahya m'a rapporté de Malik que Abdullah ibn Abbas disait : \"Vous pouvez manger tout ce qui a eu sa veine jugulaire coupée.\""
    },
    {
        "hadithnumber": 1048,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, que Said ibn al-Musayyab a dit : \"Il n'y a aucun mal dans tout ce que vous abattez avec un tranchant, tant que vous êtes forcé de le faire par nécessité.\""
    },
    {
        "hadithnumber": 1056,
        "text": "Yahya m'a rapporté de Malik qu'il a entendu Nafi dire que Abdullah ibn Umar a dit : \"Qu'il en mange ou non.\""
    },
    {
        "hadithnumber": 1063,
        "text": "Yahya m'a rapporté de Malik, de Ismail ibn Abi Hakim, de Abiyda ibn Sufyan al-Hadrami, de Abu Hurayra, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Manger des animaux avec des crocs est haram.\" Malik a dit : \"C'est la coutume parmi nous.\""
    },
    {
        "hadithnumber": 1071,
        "text": "Yahya m'a rapporté de Malik, de Rabia ibn Abi Abd ar-Rahman, que Muhammad ibn Ibrahim ibn al-Harith at-Taymi a dit : \"J'ai entendu mon père dire que la aqiqa était désirable, même si ce n'était qu'un moineau.\""
    },
    {
        "hadithnumber": 1072,
        "text": "Yahya m'a rapporté de Malik qu'il a entendu qu'il y avait eu une aqiqa pour Hasan et Husayn, les fils de Ali ibn Abi Talib."
    },
    {
        "hadithnumber": 1076,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Sulayman ibn Yasar a dit : \"Umar ibn al-Khattab, Uthman ibn Affan, et Zayd ibn Thabit donnaient au grand-père un tiers avec les frères et sœurs germains.\" Malik a dit : \"La manière généralement convenue de faire les choses parmi nous et ce que j'ai vu les gens de science faire dans notre ville est que le grand-père paternel n'hérite rien du tout avec le père. On lui donne un sixième comme part fixe avec le fils et le petit-fils par un fils. En dehors de cela, quand le défunt ne laisse pas de mère ou de tante paternelle, on commence par quiconque a une part fixe, et on leur donne leurs parts. S'il reste un sixième de la propriété, on donne au grand-père un sixième comme part fixe.\" Malik a dit : \"Quand quelqu'un partage avec le grand-père et les frères et sœurs germains dans une part spécifiée, on commence par quiconque partage avec eux parmi les gens des parts fixes. On leur donne leurs parts. Ce qui reste après cela appartient au grand-père et aux frères et sœurs germains. Ensuite on voit laquelle est la plus favorable des deux alternatives pour la portion du grand-père. Soit un tiers lui est alloué ainsi qu'aux frères et sœurs pour le diviser entre eux, et il reçoit une part comme s'il était l'un des frères et sœurs, ou bien il prend un sixième de tout le capital. Quelle que soit la meilleure portion pour le grand-père, elle lui est donnée. Ce qui reste après cela va aux frères et sœurs germains. Le mâle reçoit la portion de deux femelles sauf dans un cas particulier. La division dans ce cas est différente de la précédente. Ce cas est quand une femme meurt et laisse un mari, une mère, une sœur germaine et un grand-père. Le mari reçoit une moitié, la mère reçoit un tiers, le grand-père reçoit un sixième, et la sœur germaine reçoit une moitié. Le sixième du grand-père et la moitié de la sœur sont joints et divisés en tiers. Le mâle reçoit la part de deux femelles. Par conséquent, le grand-père a deux tiers, et la sœur a un tiers.\" Malik a dit : \"L'héritage des demi-frères et sœurs par le père avec le grand-père quand il n'y a pas de frères et sœurs germains avec eux, est comme l'héritage des frères et sœurs germains (dans la même situation). Les mâles sont les mêmes que leurs mâles et les femelles sont les mêmes que leurs femelles. Quand il y a à la fois des frères et sœurs germains et des demi-frères et sœurs par le père, les frères et sœurs germains incluent dans leur nombre le nombre de demi-frères et sœurs par le père, pour limiter l'héritage du grand-père, c'est-à-dire, s'il n'y avait qu'un frère germain avec le grand-père. Ils partageraient, après l'allocation des parts fixes, le reste de l'héritage entre eux également. S'il y avait aussi deux demi-frères par le père, leur nombre est ajouté à la division de la somme, qui serait alors divisée en quatre. Un quart allant au grand-père et trois quarts allant aux frères et sœurs germains qui annexent les parts techniquement allouées aux demi-frères et sœurs par le père. Ils n'incluent pas le nombre de demi-frères et sœurs par la mère, parce que s'il n'y avait que des demi-frères et sœurs par le père, ils n'hériteraient rien avec le grand-père et tout le capital appartiendrait au grand-père, et donc les frères et sœurs n'auraient rien après la portion du grand-père. Cela appartient aux frères et sœurs germains plus qu'aux demi-frères et sœurs par le père, et les demi-frères et sœurs par le père n'ont rien avec eux à moins que les frères et sœurs germains ne consistent en une sœur. S'il y a une sœur germaine, elle inclut le grand-père avec les demi-frères et sœurs par son père dans la division, quel que soit leur nombre. Tout ce qui reste pour elle et ces demi-frères et sœurs par le père va à elle plutôt qu'à eux jusqu'à ce qu'elle ait eu sa part complète, qui est la moitié du capital total. S'il y a un surplus au-delà de la moitié de tout le capital dans ce qu'elle et les demi-frères et sœurs par le père acquièrent, cela va à eux. Le mâle a la portion de deux femelles. S'il ne reste rien, ils n'ont rien.\""
    },
    {
        "hadithnumber": 1078,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, que al-Qasim ibn Muhammad a dit : \"Deux grands-mères vinrent à Abu Bakr as-Siddiq, et il voulut donner le sixième à celle qui était du côté de la mère, et un homme des Ansar dit : 'Quoi ? Omets-tu celle de qui il hériterait si elle mourait alors qu'il était vivant ?' Abu Bakr divisa le sixième entre elles.\""
    },
    {
        "hadithnumber": 1079,
        "text": "Yahya m'a rapporté de Malik, de Abdu Rabbih ibn Said, que Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham ne donnait une part fixe qu'à deux grands-mères (ensemble). Malik a dit : \"La manière généralement convenue de faire les choses parmi nous dans laquelle il n'y a pas de dispute et que j'ai vu les gens de science faire dans notre ville, est que la grand-mère maternelle n'hérite rien du tout avec la mère. En dehors de cela, on lui donne un sixième comme part fixe. La grand-mère paternelle n'hérite rien avec la mère ou le père. En dehors de cela, on lui donne un sixième comme part fixe.\" Si à la fois la grand-mère paternelle et la grand-mère maternelle sont vivantes, et que le défunt n'a pas de père ou de mère en dehors d'elles, Malik a dit : \"J'ai entendu que si la grand-mère maternelle est la plus proche des deux, alors elle a un sixième au lieu de la grand-mère paternelle. Si la grand-mère paternelle est plus proche, ou qu'elles sont dans la même position par rapport au défunt, le sixième est divisé également entre elles.\" Malik a dit : \"Aucune des grand-parentes femelles sauf ces deux-là n'a d'héritage parce que j'ai entendu que le Messager d'Allah, paix et bénédictions sur lui, a donné un héritage à la grand-mère, et ensuite Abu Bakr a demandé à ce sujet jusqu'à ce que quelqu'un de fiable rapporte du Messager d'Allah, paix et bénédictions sur lui, qu'il avait fait de la grand-mère une héritière et lui avait donné une part. Une autre grand-mère vint à Umar ibn al-Khattab, et il dit : 'Je ne suis pas homme à ajouter aux parts fixes. S'il y a deux de vous ensemble, c'est entre vous. Si l'une de vous est laissée seule avec, c'est à elle'.\" Malik a dit : \"Nous ne connaissons personne qui ait fait d'autres que les deux grands-mères héritières depuis le début de l'Islam jusqu'à ce jour.\""
    },
    {
        "hadithnumber": 1082,
        "text": "Yahya m'a rapporté de Malik que Muhammad ibn Abi Bakr ibn Hazm a entendu son père dire plusieurs fois : \"Umar ibn al-Khattab disait : 'C'est une merveille que la tante paternelle soit héritée et n'hérite pas'.\""
    }
]