[
    {
        "hadithnumber": 1084,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que Ali ibn Husayn ibn Ali ibn Abi Talib lui a dit que Aqil et Talib héritèrent de Abu Talib, et Ali n'hérita pas de lui. Ali a dit : \"À cause de cela, nous avons abandonné notre portion de ash-Shab.\" (Une maison appartenant aux Banu Hashim)."
    },
    {
        "hadithnumber": 1088,
        "text": "Yahya m'a rapporté de Malik, de Rabia ibn Abi Abd ar-Rahman, de plus d'un des gens de science de cette époque, que ceux qui furent tués le Jour du Chameau, le Jour de Siffin, le Jour de al-Harra, et le Jour de Qudayd n'héritaient pas les uns des autres. Aucun d'eux n'héritait quoi que ce soit de son compagnon à moins qu'il ne fût connu qu'il avait été tué avant son compagnon. Malik a dit : \"C'est la manière de faire sur laquelle il n'y a pas de dispute, et dont aucun des gens de science dans notre ville ne doute. La procédure avec deux héritiers mutuels qui sont noyés, ou tués d'une autre manière, quand on ne sait pas lequel d'entre eux est mort le premier est la même - aucun d'eux n'hérite quoi que ce soit de son compagnon. Leur héritage va à quiconque reste de leurs héritiers. Ils sont hérités par les vivants.\" Malik a dit : \"Personne ne devrait hériter de quelqu'un d'autre quand il y a un doute, et on ne devrait hériter de l'autre que quand il y a certitude de connaissance et de témoins. C'est parce qu'un homme et son mawla que son père a affranchi pourraient mourir au même moment. Les fils de l'homme libre pourraient dire : 'Notre père a hérité du mawla.' Ils ne devraient pas hériter du mawla sans connaissance ou témoignage qu'il est mort le premier. Les personnes vivantes ayant le plus droit à son wala' héritent de lui.\" Malik a dit : \"Un autre exemple est deux frères germains qui meurent. L'un d'eux a des enfants et l'autre non. Ils ont un demi-frère par leur père. On ne sait pas lequel d'entre eux est mort le premier, donc l'héritage de celui sans enfant va à son demi-frère par le père. Les enfants du frère germain n'ont rien.\" Malik a dit : \"Un autre exemple est quand une tante paternelle et le fils de son frère meurent, ou bien la fille du frère et son oncle paternel. On ne sait pas lequel d'entre eux est mort le premier. L'oncle paternel n'hérite rien de la fille de son frère, et le fils du frère n'hérite rien de sa tante paternelle.\""
    },
    {
        "hadithnumber": 1089,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Urwa ibn az-Zubayr disait au sujet de l'enfant du lian et de l'enfant de la fornication, que s'ils mouraient, la mère héritait de son droit d'eux selon le Livre d'Allah, le Puissant, le Majestueux ! Les frères et sœurs par la mère avaient leurs droits. Le reste était hérité par les anciens maîtres de la mère si elle était une esclave affranchie. Si elle était une femme libre par origine, elle héritait de son dû et les frères et sœurs par la mère héritaient de leur dû, et le reste allait aux Musulmans. Malik a dit : \"J'ai entendu la même chose que cela de Sulayman ibn Yasar.\" Malik a dit : \"C'est ce que j'ai vu les gens de science faire dans notre ville.\""
    },
    {
        "hadithnumber": 1091,
        "text": "Yahya m'a rapporté de Malik, de Muhammad ibn Yahya ibn Habban, de al-Araj, de Abu Hurayra, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Ne demandez pas une femme en mariage quand un autre musulman l'a déjà fait.\""
    },
    {
        "hadithnumber": 1092,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Abdullah ibn Umar, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Ne demandez pas une femme en mariage quand un autre musulman l'a déjà fait.\" Malik a dit : \"L'explication de la déclaration du Messager d'Allah, paix et bénédictions sur lui, selon ce que nous pensons - et Allah sait mieux - est que 'Ne demandez pas une femme en mariage quand un autre musulman l'a déjà fait' signifie que quand un homme a demandé une femme en mariage, et qu'elle s'est inclinée vers lui et qu'ils se sont mis d'accord sur une dot, qu'elle a suggérée et dont ils sont mutuellement satisfaits, il est interdit à un autre homme de demander cette femme en mariage. Cela ne signifie pas que quand un homme a demandé une femme en mariage, et que sa demande ne lui convient pas et qu'elle ne s'incline pas vers lui, personne d'autre ne peut la demander en mariage. C'est une porte vers la misère pour les gens.\""
    },
    {
        "hadithnumber": 1099,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, que Said ibn al-Musayyab avait dit que Umar ibn al-Khattab a dit : \"Si un homme épouse une femme qui est folle, ou a la lèpre ou la lèpre blanche, sans être informé de sa condition par son tuteur, et qu'il a des relations sexuelles avec elle, elle garde sa dot en entier. Son mari a des dommages-intérêts contre son tuteur.\" Malik a dit : \"Le mari a des dommages-intérêts contre son tuteur quand le tuteur est son père, frère, ou quelqu'un qui est censé avoir connaissance de sa condition. Si le tuteur qui la donne en mariage est un neveu, un mawla ou un membre de sa tribu qui n'est pas censé avoir connaissance de sa condition, il n'y a pas de dommages-intérêts contre lui, et la femme rend ce qu'elle a pris de sa dot, et le mari lui laisse tout montant qui est jugé équitable.\""
    },
    {
        "hadithnumber": 1100,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que la fille de Ubaydullah ibn Umar dont la mère était la fille de Zayd ibn al-Khattab, épousa le fils de Abdullah ibn Umar. Il mourut et n'avait pas encore consommé le mariage ni spécifié sa dot. Sa mère voulut la dot, et Abdullah ibn Umar dit : \"Elle n'a pas droit à une dot. Si elle avait eu droit à une dot, nous ne l'aurions pas gardée et nous ne lui ferions pas d'injustice.\" La mère refusa d'accepter cela. Zayd ibn Thabit fut amené pour juger entre eux et il décida qu'elle n'avait pas de dot, mais qu'elle héritait."
    },
    {
        "hadithnumber": 1102,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, de Said ibn al-Musayyab, que Umar ibn al-Khattab décida au sujet de la femme qui était épousée par un homme et dont le mariage avait été consommé, que la dot était obligatoire."
    },
    {
        "hadithnumber": 1103,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que Zayd ibn Thabit a dit : \"Quand un homme emmène sa femme dans sa maison et cohabite avec elle, alors la dot est obligatoire.\""
    },
    {
        "hadithnumber": 1104,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Said ibn al-Musayyab a dit : \"Quand un homme vient à sa femme dans sa chambre, il est cru. Quand elle vient à lui dans sa chambre, elle est crue.\" Malik a commenté : \"Je pense que cela fait référence aux rapports sexuels. Quand il entre chez elle dans sa chambre et qu'elle dit : 'Il a eu des rapports avec moi' et qu'il dit : 'Je ne l'ai pas touchée', il est cru. Quand elle entre chez lui dans sa chambre et qu'il dit : 'Je n'ai pas eu de rapports avec elle' et qu'elle dit : 'Il a eu des rapports avec moi', elle est crue.\""
    },
    {
        "hadithnumber": 1121,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, de Abu Abd ar-Rahman, que Zayd ibn Thabit a dit que si un homme divorçait de son esclave trois fois et l'achetait ensuite, elle n'était pas halal pour lui jusqu'à ce qu'elle ait épousé un autre mari."
    },
    {
        "hadithnumber": 1126,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que az-Zubayr ibn al-Awwam a dit la même chose. Malik a dit que si un homme avait des relations sexuelles avec une esclave qu'il possédait, et qu'il voulait ensuite aussi avoir des relations avec sa sœur, la sœur n'était pas halal pour un homme jusqu'à ce que les rapports avec l'esclave aient été rendus haram pour lui par mariage, affranchissement, kitaba, ou quelque chose de ce genre - par exemple, s'il l'avait mariée à son esclave ou quelqu'un d'autre que son esclave."
    },
    {
        "hadithnumber": 1128,
        "text": "Yahya m'a rapporté de Malik que Abd ar-Rahman ibn al-Mujabbir a dit que Salim ibn Abdullah donna à son fils une esclave et dit : \"Ne t'approche pas d'elle, car je la voulais, et je n'ai pas agi envers elle.\""
    },
    {
        "hadithnumber": 1129,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, que Abu Nahshal ibn al-Aswad a dit à al-Qasim ibn Muhammad : \"J'ai vu une de mes esclaves découverte au clair de lune, et donc je me suis assis sur elle comme un homme s'assoit sur une femme. Elle a dit qu'elle avait ses règles, alors je me suis levé et je ne me suis pas approché d'elle après cela. Puis-je la donner à mon fils pour avoir des rapports avec elle ?\" Al-Qasim interdit cela."
    },
    {
        "hadithnumber": 1130,
        "text": "Yahya m'a rapporté de Malik, de Ibrahim ibn Abi Abla, de Abd al-Malik ibn Marwan, qu'il donna une esclave à un de ses amis, et plus tard lui demanda à son sujet. Il dit : \"J'avais l'intention de la donner à mon fils pour faire telle et telle chose avec elle.\" Abd al-Malik dit : \"Marwan était plus scrupuleux que toi. Il donna une esclave à son fils, et ensuite il dit : 'Ne t'approche pas d'elle, car j'ai vu sa jambe découverte'.\""
    },
    {
        "hadithnumber": 1131,
        "text": "Malik a dit : \"Il n'est pas halal d'épouser une esclave chrétienne ou juive parce qu'Allah le Béni, l'Exalté, a dit dans Son Livre : 'Et (vous sont permises) les femmes vertueuses d'entre les croyantes, et les femmes vertueuses d'entre les gens qui ont reçu le Livre avant vous', (Sourate 5 verset 5) et ce sont des femmes libres parmi les Chrétiens et les Juifs. Allah, le Béni, l'Exalté, a dit dans Son Livre : 'Et quiconque parmi vous n'a pas les moyens d'épouser des femmes libres (non esclaves) croyantes, eh bien (il peut épouser) une femme parmi celles de vos esclaves croyantes.' (Sourate 4 verset 25). Malik a dit : \"À notre avis, Allah a rendu le mariage avec les esclaves croyantes halal, et Il n'a pas rendu halal le mariage avec les esclaves chrétiennes et juives parmi les Gens du Livre.\" Malik a dit : \"L'esclave chrétienne et juive sont halal pour leur maître par droit de possession, mais les rapports avec une esclave mage ne sont pas halal par le droit de possession.\" Yahya m'a rapporté de Malik, de Ibn Shihab, que Said ibn al-Musayyab a dit : \"Les muhsanat parmi les femmes sont celles qui ont des maris.\" Cela faisait référence au fait qu'Allah a rendu la fornication haram."
    },
    {
        "hadithnumber": 1135,
        "text": "Yahya m'a rapporté de Malik qu'il a entendu Rabia ibn Abd ar-Rahman dire qu'un esclave pouvait épouser quatre femmes. Malik a dit : \"C'est le meilleur de ce que j'ai entendu au sujet de l'affaire.\" Malik a dit : \"L'esclave diffère du muhallil si l'esclave reçoit la permission de son maître pour son ex-femme. Si son maître ne lui donne pas la permission, il les sépare. Le muhallil est séparé dans tous les cas s'il a l'intention de rendre la femme halal par le mariage.\" Malik a dit : \"Quand un esclave est possédé par sa femme ou qu'un mari possède sa femme, la possession de chacun d'eux est rendue nulle sans divorce. Si un homme, par exemple, est marié à une esclave, et qu'il l'achète ensuite, il doit divorcer d'elle comme une évidence. Ils peuvent alors se remarier. S'ils se remarient ensuite, cette séparation n'était pas un divorce.\" Malik a dit : \"Quand un esclave est affranchi par sa femme qui le possède et qu'elle est dans la période d'idda de lui, ils ne peuvent revenir l'un à l'autre qu'après qu'elle ait fait un autre mariage.\""
    },
    {
        "hadithnumber": 1156,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar disait que des déclarations comme \"Je me coupe de toi\", ou \"Tu es abandonnée\", étaient considérées comme trois prononciations de divorce. Malik a dit que toute déclaration forte telle que celles-ci ou d'autres étaient considérées comme trois prononciations de divorce pour une femme dont le mariage avait été consommé. Dans le cas d'une femme dont le mariage n'avait pas été consommé, on demandait à l'homme de faire un serment sur sa religion, quant à savoir s'il avait l'intention d'une ou trois prononciations de divorce. S'il avait l'intention d'une prononciation, on lui demandait de faire un serment par Allah pour le confirmer, et il devenait un prétendant parmi d'autres prétendants, parce qu'une femme dont le mariage avait été consommé nécessitait trois prononciations de divorce pour la rendre inaccessible au mari, tandis qu'une seule prononciation était nécessaire pour rendre une femme dont le mariage n'avait pas été consommé inaccessible. Malik a ajouté : \"C'est le meilleur de ce que j'ai entendu au sujet de l'affaire.\""
    },
    {
        "hadithnumber": 1158,
        "text": "Yahya m'a rapporté de Malik qu'il a entendu Ibn Shihab dire que si un homme disait à sa femme : \"Tu es libre de moi, et je suis libre de toi,\" cela comptait comme trois prononciations de divorce comme si c'était un divorce 'irrévocable'. Malik a dit que si un homme faisait toute déclaration forte telle que celles-ci à sa femme, cela comptait comme trois prononciations de divorce pour une femme dont le mariage avait été consommé, ou c'était inscrit comme une sur trois pour une femme dont le mariage n'avait pas été consommé, selon ce que l'homme souhaitait. S'il disait qu'il n'avait l'intention que d'un seul divorce, il le jurait et il devenait l'un des prétendants parce que, alors qu'une femme dont le mariage avait été consommé était rendue inaccessible par trois prononciations de divorce, la femme dont le mariage n'avait pas été consommé était rendue inaccessible par une seule prononciation. Malik a dit : \"C'est le meilleur de ce que j'ai entendu.\""
    },
    {
        "hadithnumber": 1165,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Abdullah ibn Umar et Abu Hurayra furent interrogés sur un homme qui donnait à sa femme pouvoir sur elle-même, et elle le lui rendit sans rien faire avec. Ils dirent qu'il n'y avait pas de divorce. (c'est-à-dire que le fait que l'homme donne à sa femme pouvoir sur elle-même n'était pas interprété comme un désir de divorce de sa part)."
    },
    {
        "hadithnumber": 1166,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, que Said ibn al-Musayyab a dit : \"Si un homme donne à sa femme autorité sur elle-même, et qu'elle ne se sépare pas de lui et reste avec lui, il n'y a pas de divorce.\" Malik a dit qu'une femme dont le mari lui donnait pouvoir sur elle-même et qu'ils se séparaient alors qu'elle ne le voulait pas, n'avait aucun pouvoir de révoquer le divorce. Elle n'avait pouvoir sur elle-même que tant qu'ils restaient ensemble."
    },
    {
        "hadithnumber": 1167,
        "text": "Yahya m'a rapporté de Malik, de Jafar ibn Muhammad, de son père, que Ali ibn Abi Talib a dit : \"Quand un homme fait un vœu de s'abstenir de rapports sexuels, le divorce ne se produit pas immédiatement. Si quatre mois passent, il doit déclarer son intention et soit il est divorcé soit il révoque son vœu.\" Malik a dit : \"C'est ce qui est fait parmi nous.\""
    },
    {
        "hadithnumber": 1168,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar disait : \"Quand un homme fait un vœu de s'abstenir de rapports sexuels avec sa femme et que quatre mois sont passés, il doit déclarer son intention et soit il est divorcé soit il révoque son vœu. Le divorce ne se produit pas jusqu'à ce que quatre mois soient passés et qu'il continue à s'abstenir.\""
    },
    {
        "hadithnumber": 1169,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que Said al-Musayyab et Abu Bakr ibn Abd ar-Rahman disaient au sujet d'un homme qui faisait un vœu de s'abstenir de rapports sexuels avec sa femme : \"Si quatre mois passent, c'est un divorce. Le mari peut revenir à sa femme tant qu'elle est dans son idda.\""
    },
    {
        "hadithnumber": 1170,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Marwan ibn al-Hakam décida au sujet d'un homme qui avait fait un vœu de s'abstenir de rapports sexuels avec sa femme, que quand quatre mois étaient passés, c'était un divorce et il pouvait revenir à elle tant qu'elle était dans son idda. Malik ajouta : \"C'était aussi l'opinion de Ibn Shihab.\" Malik a dit que si un homme faisait un vœu de s'abstenir de rapports sexuels avec sa femme et qu'à la fin de quatre mois il déclarait son intention de continuer à s'abstenir, il était divorcé. Il pouvait revenir à sa femme, mais s'il n'avait pas de rapports avec elle avant la fin de son idda, il n'avait aucun accès à elle et il ne pouvait pas revenir à elle à moins qu'il n'ait une excuse - maladie, emprisonnement, ou une excuse similaire. Son retour à elle la maintenait comme sa femme. Si son idda passait et qu'ensuite il l'épousait après cela et n'avait pas de rapports avec elle jusqu'à ce que quatre mois soient passés et qu'il déclarait son intention de continuer à s'abstenir, le divorce lui était appliqué par le premier vœu. Si quatre mois passaient, et qu'il n'était pas revenu à elle, il n'avait pas d'idda contre elle ni accès parce qu'il l'avait épousée et ensuite divorcée avant de la toucher. Malik a dit qu'un homme qui faisait un vœu de s'abstenir de rapports sexuels avec sa femme et continuait à s'abstenir après quatre mois et la divorçait donc, mais revenait ensuite et ne la touchait pas et quatre mois étaient complétés avant que son idda ne soit complétée, n'avait pas à déclarer son intention et le divorce ne lui tombait pas dessus. S'il avait des rapports avec elle avant la fin de son idda, il avait droit à elle. Si son idda passait avant qu'il n'ait eu des rapports avec elle, il n'avait aucun accès à elle. C'est ce que Malik préférait de ce qu'il avait entendu sur le sujet. Malik a dit que si un homme faisait un vœu de s'abstenir de rapports sexuels avec sa femme et la divorçait ensuite, et que les quatre mois du vœu étaient complétés avant la complétion de l'idda du divorce, cela comptait comme deux prononciations de divorce. S'il déclarait son intention de continuer à s'abstenir et que l'idda du divorce finissait avant les quatre mois, le vœu d'abstention n'était pas un divorce. C'était parce que les quatre mois étaient passés et qu'elle n'était pas à lui ce jour-là. Malik a dit : \"Si quelqu'un fait un vœu de ne pas avoir de rapports avec sa femme pour un jour ou un mois et attend ensuite jusqu'à ce que plus de quatre mois soient passés, ce n'est pas un ila. L'ila ne s'applique qu'à quelqu'un qui fait un vœu de plus de quatre mois. Quant à celui qui fait le vœu de ne pas avoir de rapports avec sa femme pour quatre mois ou moins que cela, je ne pense pas que ce soit un ila parce que quand le terme entre dans lequel il s'arrête, il sort de son serment et il n'a pas à déclarer son intention.\" Malik a dit : \"Si quelqu'un fait le vœu à sa femme de ne pas avoir de rapports avec elle jusqu'à ce que son enfant ait été sevré, ce n'est pas un ila. J'ai entendu que Ali ibn Abi Talib fut interrogé à ce sujet et il ne pensait pas que c'était un ila.\""
    },
    {
        "hadithnumber": 1172,
        "text": "Yahya m'a rapporté de Malik qu'il avait interrogé Ibn Shihab sur l'ila de l'esclave. Il a dit que c'était comme l'ila de l'homme libre, et que cela mettait une obligation sur lui. L'ila de l'esclave était de deux mois."
    },
    {
        "hadithnumber": 1173,
        "text": "Yahya m'a rapporté de Malik, de Said ibn Amr ibn Sulaym az-Zuraqi, qu'il interrogea al-Qasim ibn Muhammad sur un homme qui rendait le divorce conditionnel à son mariage avec une femme, c'est-à-dire que s'il l'épousait, il divorcerait automatiquement d'elle. Al-Qasim ibn Muhammad a dit : \"Si un homme épouse une femme qu'il a faite comme le dos de sa mère, c'est-à-dire qu'il l'a rendue haram pour lui, Umar ibn al-Khattab lui a ordonné de ne pas s'approcher d'elle s'il l'épousait jusqu'à ce qu'il ait fait la kaffara pour avoir prononcé le dhihar.\""
    },
    {
        "hadithnumber": 1174,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu qu'un homme demanda à al-Qasim ibn Muhammad et Sulayman ibn Yasar au sujet d'un homme qui prononçait le dhihar de sa femme avant de l'avoir épousée. Ils dirent : \"S'il l'épouse, il ne doit pas la toucher avant d'avoir fait la kaffara pour avoir prononcé le dhihar.\""
    },
    {
        "hadithnumber": 1182,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Said ibn al-Musayyab disait que si un homme épousait une femme, et qu'il était fou ou avait un défaut physique, elle avait le droit de choix. Si elle le souhaitait, elle pouvait rester, et si elle le souhaitait, elle pouvait se séparer de lui."
    },
    {
        "hadithnumber": 1186,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Rubayyi bint Muawwidh ibn Afra vint avec son oncle paternel à Abdullah ibn Umar et lui dit qu'elle avait divorcé de son mari pour une compensation au temps de Uthman ibn Affan, et il entendit parler de cela et ne désapprouva pas. Abdullah ibn Umar dit : \"Son idda est l'idda d'une femme divorcée.\""
    }
]