[
    {
        "hadithnumber": 1220,
        "text": "Mu'aiqib a dit : Ils ont interrogé l'Apôtre (ﷺ) sur le retrait des (cailloux) dans la prière, après quoi il a dit : Si vous le faites, faites-le une seule fois."
    },
    {
        "hadithnumber": 1350,
        "text": "Ka'b b. 'Ujra a rapporté que le Messager d'Allah (ﷺ) a dit : Il y a certaines éjaculations dont ceux qui répètent ou qui exécutent à la fin de chaque prière ne seront jamais déçus : « Gloire à Allah » trente-trois fois, « Louange à Allah » trente-trois fois et « Allah est le plus grand » trente-quatre fois."
    },
    {
        "hadithnumber": 1354,
        "text": "Abu Huraira a rapporté que le Messager d'Allah (ﷺ) avait l'habitude d'observer le silence pendant une courte période entre le takbir (au moment de l'ouverture de la prière) et la récitation du Coran. Je lui dis : Messager d'Allah, pour qui je donnerais mon père et ma mère en rançon, que récites-tu pendant ta période de silence entre le takbir et la récitation ? Il dit : Je dis (ces mots) : \"Ô Allah, ôte de moi mes péchés comme Tu as éloigné l'Orient de l'Occident. Ô Allah, purifie-moi des péchés comme un vêtement blanc est purifié de la saleté. Ô Allah ! lave mes péchés avec de la neige, de l'eau et de la glace.\""
    },
    {
        "hadithnumber": 1365,
        "text": "Abu Qatada a rapporté : Le Messager d'Allah (ﷺ) a dit : Quand l'Iqama est prononcé, ne vous levez pas avant de m'avoir vu. Ibn Hatim se demandait s'il avait été dit : « Quand l'Iqama est prononcé » ou « Quand l'appel est lancé »."
    },
    {
        "hadithnumber": 1718,
        "text": "A'isha, l'épouse du Messager d'Allah (ﷺ), a déclaré qu'entre le moment où le Messager d'Allah (ﷺ) avait terminé la prière 'Isha' qui est appelée 'Atama par les gens, il avait l'habitude de prier onze rak'ahs, de prononcer la salutation à la fin de toutes les deux rak'ahs et d'observer le Witr avec une seule. Et lorsque le Mu'adhdhin eut terminé l'appel (pour la) prière de l'aube et qu'il vit clairement l'aube et que le Mu'adhdhin était venu vers lui, il se leva et pria deux courtes rak'ahs. Puis il s'allongea sur le côté droit jusqu'à ce que le Mu'adhdhin vienne vers lui pour le lqama. (Ce hadith a été rapporté avec la même chaîne de transmetteurs par Ibn Shihab, mais aucune mention n'y est faite de l'Iqama)"
    },
    {
        "hadithnumber": 2045,
        "text": "Ibn 'Abbas a rapporté : Je rends témoignage au Messager d'Allah (ﷺ) offrant une prière devant Kbutba. Il (après avoir dit la prière) délivra la Kutba, et il trouva que les femmes ne pouvaient pas l'entendre, alors il vint vers eux et les exhorta et leur prêcha et leur ordonna de faire l'aumône, et Bilal avait tendu son tissu et les femmes jetaient des bagues, des boucles d'oreilles et d'autres choses. Ce hadith a été rapporté sous l'autorité d'Ayyub avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 2046,
        "text": "Ibn 'Abbas a rapporté : Je rends témoignage au Messager d'Allah (ﷺ) offrant une prière devant Kbutba. Il (après avoir dit la prière) délivra la Kutba, et il trouva que les femmes ne pouvaient pas l'entendre, alors il vint vers eux et les exhorta et leur prêcha et leur ordonna de faire l'aumône, et Bilal avait tendu son tissu et les femmes jetaient des bagues, des boucles d'oreilles et d'autres choses. Ce hadith a été rapporté sous l'autorité d'Ayyub avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 2057,
        "text": "Ibn 'Abbas a rapporté que le Messager d'Allah (ﷺ) est sorti le jour d'Adha ou Fitr et a observé deux rak'ahs, et n'a pas observé la prière (à cet endroit) avant et après cela. Il est ensuite venu vers les femmes avec Bilal et leur a ordonné de faire l'aumône et les femmes ont commencé à donner leurs bagues et leurs colliers. Ce hadith a été rapporté sous l'autorité de Shu'ba avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 2058,
        "text": "Ibn 'Abbas a rapporté que le Messager d'Allah (ﷺ) est sorti le jour d'Adha ou Fitr et a observé deux rak'ahs, et n'a pas observé la prière (à cet endroit) avant et après cela. Il est ensuite venu vers les femmes avec Bilal et leur a ordonné de faire l'aumône et les femmes ont commencé à donner leurs bagues et leurs colliers. Ce hadith a été rapporté sous l'autorité de Shu'ba avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 2093,
        "text": "A'isha a rapporté que le Messager d'Allah (ﷺ) a récité fort dans la prière de l'éclipse et qu'il a observé quatre rak'ahs sous la forme de deux rak'ahs et quatre prosternations. Zuhri a dit : Kathir b. 'Abbas a rapporté sous l'autorité d'Ibn 'Abbas que le Messager d'Allah (ﷺ) a observé quatre rak'ahs et quatre prosternations en deux rak'ahs."
    },
    {
        "hadithnumber": 2100,
        "text": "Jabir b. 'Abdullah a rapporté : Le soleil s'est éclipsé lors d'une journée extrêmement chaude du vivant du Messager d'Allah (ﷺ). Le Messager d'Allah (ﷺ) a prié avec ses compagnons. Il a prolongé son qiyam (posture debout dans la prière) jusqu'à ce qu'ils (ses compagnons) commencent à tomber. Il a ensuite observé un long ruku'. Il releva la tête (et resta debout longtemps) puis observa un long ruku'. Il releva ensuite (la tête et se leva) pendant un long moment puis fit deux prosternations. Il s'est ensuite levé et a fait ainsi et a ainsi observé quatre ruku et quatre prosternations (en deux rak'ahs) puis a dit : Toutes ces choses m'ont été apportées dans lesquelles vous serez amené à entrer. Le paradis m'a été apporté au point que (j'en étais si proche) que si j'avais (l'intention) d'en cueillir une grappe (de raisin). Je l'aurais eu, sinon il (le Saint Prophète) a dit : J'avais l'intention d'en tirer un tas mais ma main n'a pas pu l'atteindre. L'enfer m'a aussi été amené et j'y ai vu une femme appartenant à la tribu d'Israël qui était tourmentée à cause d'un chat qu'elle avait attaché, mais qui ne lui donnait pas de nourriture ni ne le laissait libre de manger les créatures de la terre ; et j'ai vu Abu Thumama 'Amr b. Malik qui traînait ses intestins en Enfer. Ils (les Arabes) disaient que le soleil et la lune ne s'éclipsent qu'à la mort d'un grand personnage ; mais (en réalité) ces deux éléments (le soleil et la lune) font partie des signes d'Allah qui vous sont montrés ; ainsi, quand il y a une éclipse, observez la prière jusqu'à ce qu'elle (le soleil ou la lune) s'éclaire. Ce hadith a été rapporté par Hisham avec la même chaîne d'émetteurs, sauf ceci : « J'ai vu une femme brune avec une queue et une voix forte », mais il n'a fait aucune mention de « parmi les Bani Israël »."
    },
    {
        "hadithnumber": 2101,
        "text": "Jabir b. 'Abdullah a rapporté : Le soleil s'est éclipsé lors d'une journée extrêmement chaude du vivant du Messager d'Allah (ﷺ). Le Messager d'Allah (ﷺ) a prié avec ses compagnons. Il a prolongé son qiyam (posture debout dans la prière) jusqu'à ce qu'ils (ses compagnons) commencent à tomber. Il a ensuite observé un long ruku'. Il releva la tête (et resta debout longtemps) puis observa un long ruku'. Il releva ensuite (la tête et se leva) pendant un long moment puis fit deux prosternations. Il s'est ensuite levé et a fait ainsi et a ainsi observé quatre ruku et quatre prosternations (en deux rak'ahs) puis a dit : Toutes ces choses m'ont été apportées dans lesquelles vous serez amené à entrer. Le paradis m'a été apporté au point que (j'en étais si proche) que si j'avais (l'intention) d'en cueillir une grappe (de raisin). Je l'aurais eu, sinon il (le Saint Prophète) a dit : J'avais l'intention d'en tirer un tas mais ma main n'a pas pu l'atteindre. L'enfer m'a aussi été amené et j'y ai vu une femme appartenant à la tribu d'Israël qui était tourmentée à cause d'un chat qu'elle avait attaché, mais qui ne lui donnait pas de nourriture ni ne le laissait libre de manger les créatures de la terre ; et j'ai vu Abu Thumama 'Amr b. Malik qui traînait ses intestins en Enfer. Ils (les Arabes) disaient que le soleil et la lune ne s'éclipsent qu'à la mort d'un grand personnage ; mais (en réalité) ces deux éléments (le soleil et la lune) font partie des signes d'Allah qui vous sont montrés ; ainsi, quand il y a une éclipse, observez la prière jusqu'à ce qu'elle (le soleil ou la lune) s'éclaire. Ce hadith a été rapporté par Hisham avec la même chaîne d'émetteurs, sauf ceci : « J'ai vu une femme brune avec une queue et une voix forte », mais il n'a fait aucune mention de « parmi les Bani Israël »."
    },
    {
        "hadithnumber": 2104,
        "text": "Asma' a dit : Je suis venue voir 'Aïcha alors que les gens étaient debout (en prière) et elle priait aussi. J'ai dit : à quoi sert cet enthousiasme du peuple ? Et le reste du hadith a été raconté comme un seul hadith (rapporté ci-dessus). 'Urwa a dit : Ne dites pas Kasafat-ush-Shamsu, mais dites Khasafat-ush-Shamsu"
    },
    {
        "hadithnumber": 2105,
        "text": "Asma' a dit : Je suis venue voir 'Aïcha alors que les gens étaient debout (en prière) et elle priait aussi. J'ai dit : à quoi sert cet enthousiasme du peuple ? Et le reste du hadith a été raconté comme un seul hadith (rapporté ci-dessus). 'Urwa a dit : Ne dites pas Kasafat-ush-Shamsu, mais dites Khasafat-ush-Shamsu"
    },
    {
        "hadithnumber": 2149,
        "text": "Abdallah b. Abu Mulaika a rapporté : J'étais assis à côté d'Ibn 'Umar, et nous attendions le cercueil d'Umm Aban, fille de 'Uthman, et il y avait aussi 'Amr b. 'Outhman. Pendant ce temps, Ibn 'Abbas arriva, conduit par un guide. Je conçois qu'il fut informé de la place d'Ibn 'Umar. Alors il est venu jusqu'à s'asseoir à mes côtés. Pendant que j'étais entre eux (Ibn 'Abbas et Ibn 'Umar), un bruit (de lamentations) est venu de la maison. Sur ce, Ibn 'Umar a dit (c'est-à-dire qu'il a fait remarquer à 'Amr qu'il devait se lever et les interdire, car) : J'ai entendu le Messager d'Allah (ﷺ) dire : Les morts sont punis à cause des lamentations de sa famille. 'Abdullah l'a rendu général (ce qui a été dit pour une occasion particulière). Ibn 'Abbas a dit : Lorsque nous étions avec le Commandeur des croyants, 'Umar b. Khattab, nous avons atteint Baida', et il y avait un homme à l'ombre de l'arbre. Il m'a dit : Va me dire qui est cette personne. Alors je suis allé et j'ai découvert qu'il était Suhaib. Je suis revenu vers lui et lui ai dit : Tu m'as ordonné de découvrir pour toi qui c'était, et c'est Suhaib. Il (Hadrat 'Umar) a dit : Ordonne-lui de nous voir. J'ai dit : Il a de la famille avec lui. Il a dit : (Cela n'a aucune importance) même s'il a de la famille avec lui. Alors il (le narrateur) lui a dit de voir (le commandant des croyants et son groupe). Lorsque nous sommes arrivés (à Médine), le commandant des croyants n'a pas tardé à être blessé, et Suhaib est venu en pleurant et en criant : Hélas pour le frère, hélas pour le compagnon. Sur ce, 'Umar dit : Ne saviez-vous pas, ou n'avez-vous pas entendu, que le Messager d'Allah (ﷺ) a dit : « Le mort est puni à cause des lamentations de sa famille » ? Puis 'Abdullah l'a rendu général et 'Umar l'a raconté à certaines occasions. Alors je ('Abdullah b. Abu Mulaika) me suis levé et suis allé voir 'A'isha et lui ai raconté ce qu'Ibn 'Umar avait dit. Sur ce, elle dit : Je jure par Allah que le Messager d'Allah (ﷺ) n'a jamais dit que les morts seraient punis à cause des lamentations de sa famille (pour lui). Ce qu'il a dit, c'est qu'Allah augmenterait le châtiment de l'incroyant à cause des lamentations de sa famille à son sujet. En vérité, c'est Allah qui a provoqué les rires et les pleurs. Aucun porteur d'un fardeau ne portera le fardeau d'un autre. Ibn Abu Mulaika a dit qu'al-Qasim b. Muhammad a dit que lorsque les paroles de 'Umar et Ibn 'Umar furent transmises à 'A'isha, elle dit : Vous me l'avez raconté de la part de ceux qui ne sont ni des menteurs ni ceux soupçonnés de mentir mais (parfois) entendent des tromperies."
    },
    {
        "hadithnumber": 2150,
        "text": "Abdallah b. Abu Mulaika a dit : La fille de 'Uthman b. 'Affan est mort à La Mecque. Nous sommes venus l'assister (enterrement). Ibn 'Umar et Ibn 'Abbas étaient également présents et j'étais assis entre eux. Il a ajouté : Je me suis (d'abord assis) à côté de l'un d'eux, puis l'autre est venu et il s'est assis à côté de moi. 'Abd Allah b. 'Umar dit à 'Amr b. 'Outhman qui était assis en face de lui : N'empêcheras-tu pas les gens de se lamenter, car le Messager d'Allah (ﷺ) avait dit : « Le mort est puni à cause des lamentations de sa famille à son sujet » ? Ibn 'Abbas a ensuite dit qu'Umar avait l'habitude de dire quelque chose de cette nature, puis il a raconté en disant : Je suis parti de La Mecque avec 'Umar jusqu'à ce que nous atteignions al-Baida' et il y avait un groupe de cavaliers à l'ombre d'un arbre. Il (m'a dit) : Va découvrir qui est ce parti. J'ai jeté un coup d'œil et il y avait Suhaib (dans cette fête). Alors je l'en ai informé ('Umar). Il dit : Appelle-le-moi. Je suis donc retourné à Suhaib et lui ai dit : Allez rencontrer le Commandeur des croyants. Quand 'Umar fut blessé, Suhaib arriva au mur : Hélas, pour le frère ! hélas pour le compagnon ! 'Umar a dit : Ô Suhaib, est-ce que tu pleures pour moi, alors que le Messager d'Allah (ﷺ) a dit : « Les morts seraient punis à cause des lamentations des (membres de sa famille) » ? Ibn 'Abbas a dit : Quand 'Umar est mort, j'en ai fait mention à 'A'isha. Elle dit : Qu'Allah ait pitié de 'Umar ! Je jure par Allah que le Messager d'Allah (ﷺ) n'a jamais dit qu'Allah punirait le croyant à cause des pleurs (de l'un des membres de sa famille), mais il a dit qu'Allah augmenterait le châtiment de l'incroyant à cause des pleurs de sa famille à son sujet. 'A'isha a dit : Le Coran vous suffit (quand il dit) : « Aucun porteur de fardeau ne portera le fardeau d'autrui » (vi. 164). Sur ce, Ibn 'Abbas dit : Allah est Celui qui a provoqué les rires et les pleurs. Ibn Abu Mulaika a dit : Par Allah, Ibn 'Umar n'a rien dit"
    },
    {
        "hadithnumber": 2225,
        "text": "Il est rapporté sous l'autorité d'Ibn Abu Laila que tandis que Qais b. Sa'd et Sahl b. Hunaif était tous les deux à Qadislyya, une bière est passée à côté d'eux et ils se sont tous deux levés. On leur a dit que c'était le cercueil d'un des habitants du pays (non musulman). Ils ont dit qu'une bière était passée devant le Prophète (ﷺ) et qu'il s'est levé. On lui a dit qu'il (le mort) était juif. Là-dessus, il remarqua : N'était-il pas un être humain ou n'avait-il pas une âme ? Et dans le hadith rapporté par 'Amr b. Murra avec la même chaîne d'émetteurs, (les mots) sont : \" Il y avait une bière devant nous."
    },
    {
        "hadithnumber": 2232,
        "text": "Joubaïr b. Nufair dit : Je l'ai entendu de 'Auf b. Malik que le Prophète (ﷺ) a dit la prière sur le cadavre, et je me suis souvenu de sa prière : \" Ô Allah ! pardonne-lui, aie pitié de lui, donne-lui la paix et l'absout. Reçois-le avec honneur et agrandis sa tombe ; lave-le avec de l'eau, de la neige et de la grêle. Purifie-le de ses fautes comme tu purifierais un vêtement blanc de l'impureté. Récompense-le avec une demeure plus excellente que sa demeure, avec une famille meilleure que sa famille, et avec un conjoint meilleur que le sien. compagnon. Admets-le au Jardin, et protège-le du tourment de la tombe et du tourment du Feu. » ('Auf bin Malik) a dit : Je désirais sincèrement être ce cadavre"
    },
    {
        "hadithnumber": 2243,
        "text": "Abu'l-Hayyaj al-Asadi a raconté qu'Ali (b. Abu Talib) lui a dit : Ne devrais-je pas t'envoyer dans la même mission que celle que le Messager d'Allah (ﷺ) m'a envoyé ? Ne laissez pas une image sans l'effacer, ni une haute tombe sans la niveler. Ce hadith a été rapporté par Habib avec la même chaîne d'émetteurs et il a dit : (Ne laissez pas) une photo sans l'effacer"
    },
    {
        "hadithnumber": 2892,
        "text": "Ibn Abbas (qu'Allah soit satisfait d'eux) a rapporté : Alors qu'une personne se tenait à 'Arafat avec le Messager d'Allah (ﷺ), il est tombé de son chameau et s'est cassé le cou. Cela a été mentionné au Messager d'Allah (ﷺ), sur quoi il a dit : Lavez-le avec de l'eau mélangée aux feuilles du lote et enveloppez-le dans deux (morceaux de) tissu et ne le parfumez pas ni ne couvrez-lui la tête ; (Ayyub a dit) car Allah le ressusciterait le Jour de la Résurrection dans l'état de prononcer Talbiya. ('Amr. cependant dit) : En vérité, Allah le ressusciterait le Jour de la Résurrection en prononçant Talbiya. Saïd b. Jubair a rapporté ce hadith sous l'autorité d'Ibn 'Abbas (qu'Allah soit satisfait d'eux) selon lequel une personne se tenait aux côtés du Messager d'Allah (ﷺ) alors qu'elle était en état d'Ihram. Le reste du hadith est le même"
    },
    {
        "hadithnumber": 2893,
        "text": "Ibn Abbas (qu'Allah soit satisfait d'eux) a rapporté : Alors qu'une personne se tenait à 'Arafat avec le Messager d'Allah (ﷺ), il est tombé de son chameau et s'est cassé le cou. Cela a été mentionné au Messager d'Allah (ﷺ), sur quoi il a dit : Lavez-le avec de l'eau mélangée aux feuilles du lote et enveloppez-le dans deux (morceaux de) tissu et ne le parfumez pas ni ne couvrez-lui la tête ; (Ayyub a dit) car Allah le ressusciterait le Jour de la Résurrection dans l'état de prononcer Talbiya. ('Amr. cependant dit) : En vérité, Allah le ressusciterait le Jour de la Résurrection en prononçant Talbiya. Saïd b. Jubair a rapporté ce hadith sous l'autorité d'Ibn 'Abbas (qu'Allah soit satisfait d'eux) selon lequel une personne se tenait aux côtés du Messager d'Allah (ﷺ) alors qu'elle était en état d'Ihram. Le reste du hadith est le même"
    },
    {
        "hadithnumber": 2978,
        "text": "Imran b. Husain (qu'Allah l'agrée) a rapporté : Nous avons accompli le Tamattu' (Hajj et 'Umra combinés) en compagnie du Messager d'Allah (ﷺ), et rien n'a été révélé dans le Coran (concernant l'abrogation de cette pratique), et tout ce qu'une personne (Hadhrat 'Umar) a dit était son opinion personnelle. 'Imran b. Husain a rapporté ce hadith (dans ces mots également) : \" L'Apôtre d'Allah (ﷺ) a accompli le Hajj Tamattu' et nous l'avons également accompli avec lui."
    },
    {
        "hadithnumber": 2979,
        "text": "Imran b. Husain (qu'Allah l'agrée) a rapporté : Nous avons accompli le Tamattu' (Hajj et 'Umra combinés) en compagnie du Messager d'Allah (ﷺ), et rien n'a été révélé dans le Coran (concernant l'abrogation de cette pratique), et tout ce qu'une personne (Hadhrat 'Umar) a dit était son opinion personnelle. 'Imran b. Husain a rapporté ce hadith (dans ces mots également) : \" L'Apôtre d'Allah (ﷺ) a accompli le Hajj Tamattu' et nous l'avons également accompli avec lui."
    },
    {
        "hadithnumber": 3023,
        "text": "Abu Sa'id (qu'Allah l'agrée) a rapporté : Nous sommes sortis avec le messager d'Allah (ﷺ) prononçant à haute voix la Talbiya pour le Hajj. Lorsque nous sommes arrivés à La Mecque, il nous a ordonné de changer cela (Ihram pour le Hajj) en celui de la Omra, sauf celui qui avait amené l'animal sacrificiel avec lui. Quand c'était le jour de Tarwiya (8 Dhul-Hijja) et que nous sommes allés à Mini, nous avons (encore) prononcé Talbiya pour le Hajj."
    },
    {
        "hadithnumber": 3028,
        "text": "Anas (qu'Allah l'agrée) a rapporté : J'ai entendu le Messager d'Allah (ﷺ) prononcer Talbiya pour les deux simultanément, Talbiya pour la 'Umra et le Hajj. Talbiya pour l'Uwra et le Hajj (il a accompli le Hajj et l'Umra en tant que Qarin). Dans une autre version, les mots sont : J'ai entendu le Messager d'Allah (ﷺ) prononcer Talbiya pour la Omra et le Hajj (simultanément)"
    },
    {
        "hadithnumber": 3029,
        "text": "Anas (qu'Allah l'agrée) a rapporté : J'ai entendu le Messager d'Allah (ﷺ) prononcer Talbiya pour les deux simultanément, Talbiya pour la 'Umra et le Hajj. Talbiya pour l'Uwra et le Hajj (il a accompli le Hajj et l'Umra en tant que Qarin). Dans une autre version, les mots sont : J'ai entendu le Messager d'Allah (ﷺ) prononcer Talbiya pour la Omra et le Hajj (simultanément)"
    },
    {
        "hadithnumber": 3087,
        "text": "Oussama b. Zaid (qu'Allah l'agrée) a rapporté : J'étais assis derrière le Messager d'Allah (ﷺ) sur l'animal à cheval d'Arafat. Alors que le Messager d'Allah (ﷺ) atteignait le côté gauche de la montagne située près de Muzdalifa, il fit s'agenouiller le chameau et lui fit de l'eau, puis revint. J'ai versé de l'eau et lui a effectué de légères ablutions. J'ai alors dit : Messager d'Allah, c'est l'heure de la prière. Sur ce, le Messager d'Allah (ﷺ) a dit : La prière vous attend (à la station suivante, Muzdalifa). Le Messager d'Allah (que la paix soit sur lui) a continué son chemin jusqu'à ce qu'il arrive à Muzdalifa et a observé la prière. Ensuite, al-Fadl (qu'Allah l'agrée) s'est assis derrière le Messager d'Allah (ﷺ) et a atteint (Muzdalifa) le matin. Kuraib a dit : 'Abdullah b. 'Abbas (qu'Allah soit satisfait d'eux) a rapporté d'al-Fadl (qu'Allah l'agrée) que le Messager d'Allah (ﷺ) a continué à prononcer Talbiya jusqu'à ce qu'il atteigne al-Jamara (al-'Aqaba)"
    },
    {
        "hadithnumber": 3092,
        "text": "Abd al-Rahman b. Yazid a rapporté que 'Abdullah (b. Mas'ud) a prononcé Talbiya alors qu'il revenait du rassemblement du peuple (à Muzdalifa). Il a été dit : Il pourrait être un Bédouin (ne connaissant pas correctement les rituels du Hajj et, par conséquent, prononçant Talbia à ce stade), sur quoi Abdallah a dit : Les gens ont-ils oublié (cette Sunna du Saint Prophète) ou se sont-ils égarés ? Je l'ai entendu, sur qui Sibrah al-Baqara a été révélée, prononcer Talbiya à l'endroit même"
    },
    {
        "hadithnumber": 3093,
        "text": "Abd al-Rahman b. Yazid a rapporté que 'Abdullah (b. Mas'ud) a prononcé Talbiya alors qu'il revenait du rassemblement du peuple (à Muzdalifa). Il a été dit : Il pourrait être un Bédouin (ne connaissant pas correctement les rituels du Hajj et, par conséquent, prononçant Talbia à ce stade), sur quoi Abdallah a dit : Les gens ont-ils oublié (cette Sunna du Saint Prophète) ou se sont-ils égarés ? Je l'ai entendu, sur qui Sibrah al-Baqara a été révélée, prononcer Talbiya à l'endroit même"
    },
    {
        "hadithnumber": 3108,
        "text": "Abdallah b. Yazid al-Khatmi a rapporté sous l'autorité d'Abu Ayyub (qu'Allah soit satisfait de lui) qu'il a prié le coucher du soleil et les prières « Isha » (ensemble) à Muzdalifa en compagnie du Messager d'Allah (ﷺ) à l'occasion du pèlerinage d'adieu."
    },
    {
        "hadithnumber": 3109,
        "text": "Abdallah b. Yazid al-Khatmi a rapporté sous l'autorité d'Abu Ayyub (qu'Allah soit satisfait de lui) qu'il a prié le coucher du soleil et les prières « Isha » (ensemble) à Muzdalifa en compagnie du Messager d'Allah (ﷺ) à l'occasion du pèlerinage d'adieu."
    },
    {
        "hadithnumber": 3222,
        "text": "A'isha (qu'Allah l'agrée) a rapporté : Safiyyah bint Huyayy est entrée dans la période des règles après avoir effectué le Tawaf Ifada. J'ai fait mention de ses règles au Messager d'Allah (ﷺ), après quoi celles d'Allah. Le Messager (ﷺ) a fait remarquer : Eh bien, alors elle nous retiendra. J'ai dit : Messager d'Allah. elle a exécuté le Tawif Ifada et fait le tour de la maison, et c'est après cela qu'elle est entrée dans la période des règles. Sur ce, le Messager d'Allah (ﷺ) a dit : (S'il en est ainsi), alors continuez"
    },
    {
        "hadithnumber": 3223,
        "text": "Ce hadith est rapporté (de 'A'isha) sous l'autorité d'Ibn Shihab avec la même chaîne de transmetteurs (et les mots sont) : Safiyyah bint Huyayy, l'épouse de l'Apôtre d'Allah (ﷺ), est entrée dans la période des règles à l'occasion du pèlerinage d'adieu après avoir accompli le Tawaf Ifada en état de propreté ; le reste du hadith est le même"
    },
    {
        "hadithnumber": 3224,
        "text": "Abd al-Rahman b. al Qasim a rapporté sous l'autorité de 'A'isha (qu'Allah soit satisfait d'elle) qu'elle a mentionné au Messager d'Allah (ﷺ) que Safiyyah était entrée dans la période des règles. Le reste du hadith est le même"
    },
    {
        "hadithnumber": 3225,
        "text": "A'isha (qu'Allah l'agrée) a rapporté : Nous craignions que Safiyyah puisse entrer dans la période des règles avant d'accomplir le Tawaf Ifada. Le Messager d'Allah (ﷺ) est venu vers nous et a dit : Safiyyah va-t-elle nous retenir ? Sur ce, nous avons dit : Elle a exécuté le Tawaf Ifada. Il (le Saint Prophète) a dit : Alors il n'y a plus de détention (pour nous) maintenant"
    },
    {
        "hadithnumber": 3226,
        "text": "A'isha (qu'Allah l'agrée) a dit au Messager d'Allah (ﷺ) : La messagère d'Allah, Safiyyah bint Huyayy est entrée en état de règles, sur quoi le Messager d'Allah (ﷺ) a dit : Peut-être qu'elle va nous retenir. N'a-t-elle pas parcouru la Maison avec vous (c'est-à-dire si elle n'a pas exécuté le Tawaf Ifada) ? Ils ont dit : Oui. Il dit : Alors ils devraient partir"
    },
    {
        "hadithnumber": 3227,
        "text": "A'isha (qu'Allah l'agrée) a rapporté que le Messager d'Allah (ﷺ) était enclin à faire avec Safiyyah ce qu'un homme est enclin à faire avec sa femme. Ils dirent : Messager d'Allah, elle est entrée en état de règles, sur quoi il dit : (Eh bien) elle va nous retenir. Elles (ses épouses) dirent : Messager d'Allah, elle a exécuté le Tawaf Ziyara (Tawaf Ifada) le jour de Nahr. Sur ce, il dit : Alors elle devrait continuer avec vous"
    },
    {
        "hadithnumber": 3228,
        "text": "A'isha (qu'Allah l'agrée) a rapporté : Lorsque l'Apôtre d'Allah (ﷺ) a décidé de marcher (pour le voyage de retour), il a trouvé Safiyyah à la porte de sa tente, triste et abattue. Il a fait remarquer. Stérile, crâne rasé, vous allez nous arrêter, puis vous avez dit : Avez-vous effectué le Tawaf Ifada le jour de Nahr ? Elle répondit par l'affirmative, après quoi il dit : Alors continuez votre route."
    },
    {
        "hadithnumber": 3229,
        "text": "Ce hadith est rapporté par 'A'isha (qu'Allah l'agrée) à travers une autre chaîne de transmetteurs, mais aucune mention n'est faite de \"triste et abattu\"."
    },
    {
        "hadithnumber": 3499,
        "text": "Abu Musa a rapporté que le Messager d'Allah (ﷺ) a dit à propos de celui qui a émancipé une esclave, puis l'a épousée, que pour lui il y a deux récompenses"
    },
    {
        "hadithnumber": 3695,
        "text": "Ibn 'Abbas (Allah be pleased with them) reported. I had always been anxious to ask 'Umar (Allah be pleased with him) about the two ladies amongst the wives of Allah's Prophet (may peace be upon Lim) about whom Allah, the Exalted, said:\" If you both turn in repentance to Allah, then indeed your hearts are inclined (to this)\" (Ixvi. 4), until 'Umar (Allah be pleased with him) set out for Hajj and I also went along with him. And as we were going along a path, 'Umar (Allah be pleased with hiyn) went aside and I also went aside with him with a jug (of water). He answered the call of nature, and then came to me and I poured water over his hands and he performed ablution I said: Commander of the Faithful, who are the two ladies amongst the wives of Allah's Prophet (ﷺ) about whom Allah, the Exalted and Majestic, said: 'If you both turn to Allah in repentance, then indeed your heart are inclined to it\"? 'Umar (Allah he pleased with him) said: How strange is it for you, Ibn 'Abbas! (Zuhri said: By Allah, he disliked what he asked about, but did not keep it a secret.) He ('Umar) said: They are Hafsa and 'A'isha; and he then began to narrate the hadith and said: We were such people among the Quraish who dominated women, and as we reached Medina we found there people who were dominated by their women, and our women began to learn (the habits) of their women. He further said: And my house was situated in the suburb of Aledina in the tribe of Banu Umayya b. Zaid. One day I became angry with my wife and she retorted upon me. I did not like that she should retort upon me. She said: You disapprove of my retorting upon you By Allah, the wives of Allah's Apostle (ﷺ) retort upon him, and one of them detaches herself from him for the day until the night. So I ('Umar) went out and visited Hafsa and said: Do you retort upon Allah's Messenger (ﷺ)? She said: Yes. I said; Does any one of you detach herself from him from the day to the night? She said: Yes. He said: She who did like it amongst you in fact failed and incurred loss. Does everyone amongst you not fear the wrath of Allah upon her due to the wrath of His Messenger (ﷺ), and (as a result thereof) she may perish? So do not retort upon Allah's Messenger (ﷺ) and do not ask him for anything, but ask me that which you desire, (and the frank behaviour) of your companion may not mislead you, if she is more graceful and is dearer to Allah's Messenger (ﷺ) than you (meaning 'A'isha) (Allah be pleased with her). He (Hadrat 'Umar further) said: I had a compalaion from the Ansar and, we used to remain in the company of the Messenger (ﷺ) turn by turn. He remained there for a day while I remained there on the other day, and he brought me the news about the revelation and other (matter), and I brought him (the news) like this. And we discussed that the Ghassanids were shoeing the horses in order to attack us. Id y companion once attended (the Apostle). and then came to me at night and knocked at my door and called me, and I came out to him, and he said: A matter of great importance has happened. I said: What is that? Have the Ghassanids come? He said: No, but even more serious and more significant than that: the Prophet (ﷺ) has divorced his wives. I said: Hafsa has failed and has incurred loss. and I feared that it would happen. When it was dawn I observed the dawn prayer and dressed myself, and then came there (in the house of the Holy Prophet) and visited Hafsa, and she was weeping. I said: Has Allah's Messenger (ﷺ) divorced you (all)? She said: I do not know. He has, however, separated himself in his attic. I came to a black servant and said to him: Seek permission for 'Umar. He went in and then came to me and said: I made mention of you to him, but he kept quiet. I then went to the pulpit and sat there, and there was a group of people sitting by it and some of then were weeping. I sat there for some time, until I was overpowered (by that very idea) which was in my mind. I then came back to the boy and said to him: Seek permission for Umar. He went in and came to me and said: I made mention of you to him but he kept quiet. I was about to turn back when the boy called me and said: Go in; permission has been granted to you. I went in and greeted Allah's Messenger (ﷺ) and he was reclining against the couch of mat and it had left its marks upon his side. I said: Messenger of Allah, have you divorced your wives? He raised his head towards me and said: No. I said: Allah is the Greatest. Messenger of Allah, I wish if you had seen how we the people of Quraish had domination over women but when we came to Medina we found people whom their women dominated. So our women began to learn from their women. One dily I became angry with my wife and she began to retort upon me. I did not approve that she should retort upon me. She said: You do not like that I should retort upon you, but, by Allah. the wives of Allah's Apostle (ﷺ) retort upon him and any one of them separates herself from him for a day until night. I said: He who did that amongst them in fact failed and incurred loss. Does any of them feel sate from the wrath of Allahupon her due to the wrath of Allah's Messenger (ﷺ), and she has certainly perished. Allah's Messtnger (ﷺ) smiled, I said: Messenger of Allah, I visited Hafsa and said: (The behaviour) of your companion ('A'isha) may not mislead you, If she is more graceful than you and is dearer to Allah's Messenger (ﷺ) than you. Allah's Messenger (ﷺ) smiled for the second time. I said: Allah's Messenger, way I talk to you about agreeable things? He said: Yes. I sat down and lifted my head (to see things) in the house and, by Allah, I did not see anything significant besides three hides. I said: Messenger of Allah, supplicate the Lord that He should make (life) prosperous for your Ummah as He has made plentiful for the people of Persia and Rome (in spite of the fact) that they do no, worship Allah, the Exalted and Majestic, whereupon he (Allah's Messenger) sat up an I then said: Ibn Khattab, do you doubt that they are a nation whom their nice things have been given immediately in the life of this world. I said: Allah's Messenger! seek pardon for me. And he (Allah's Messenger) had taken an oath that he would not visit them for a month due to extreme annoyance with them until Allah showed His displeasure to him (Allah's Messenger). Zuhri said: 'Urwa informed me that 'A'Isha (Allah be pleased with her) said: When twenty-nine nights were over, Allah's Messenger (ﷺ) visited me, and he began (his visit) with me. I said: Messenger of Allah, you had taken an oath that you would not visit us for a month, while you have visited after I have counted only twenty-nine (nights). Thereupon he said: The month may also be of twenty-nine (days). He then said: 'A'isha, I am going to talk to you about a matter, and you should not be hasty in it (and do not give your final decision) until you have consulted your parents. He then recited this verse to me:\" O Prophet, say to your wives\" till he reached\" mighty reward\" (xxxiii. 28). 'A'isha (Allah be pleased with her) said: By Allah, he knew that my parents would not allow me to separate from him. I said: Is there any need to consult my parents in this matter? I in fact choose Allah and His Messenger (ﷺ) and the abode in the Hereafter. Ma'mar said: Ayyub reported to me that 'A'isha said: Don't inform your wives that I have chosen you, whereupon Allah's Apostle (ﷺ) said: Verily Allah has sent me as a conveyer of message, and He has not sent me as a source of hardship (to others). Qatada said:\" Saghat qulubukum\" means\" Your hearts have inclined"
    },
    {
        "hadithnumber": 3725,
        "text": "Zainab (bint Abu Salama) (qu'Allah l'agrée) a rapporté : Je suis allée à Umm Habiba, l'épouse de l'apôtre d'Allah (ﷺ), lorsque son père Abu Sufyan était décédé. Umm Habiba a envoyé chercher un parfum contenant du jaune ou quelque chose d'autre, et elle l'a appliqué sur une fille, puis l'a frotté sur ses joues et a ensuite dit : Par Allah, je n'ai besoin de parfum que pour le fait que j'ai entendu le Messager d'Allah (ﷺ) dire sur la chaire : « Il n'est pas permis à une femme croyant en Allah et dans l'au-delà de pleurer les morts au-delà de trois jours, mais (en cas de décès) du mari, il est permis pendant quatre mois et dix. jours.\" Zainab a dit : J'ai ensuite rendu visite à Zainab, suggérant Jahsh (qu'Allah l'agrée) lorsque son frère est mort et elle a envoyé chercher du parfum et l'a appliqué, puis a dit : Par Allah, je ne ressens aucun besoin du parfum mais j'ai entendu le Messager d'Allah (ﷺ) dire sur la chaire : « Il n'est pas permis à une femme croyant en Allah et au Cisjordanie de pleurer les morts au-delà de trois jours, sauf dans le cas de son mari (pour qui elle peut pleurer) pendant quatre mois. et dix jours. » Zainab (qu'Allah l'agrée) a dit : J'ai entendu ma mère Umm Salama (qu'Allah l'agrée) dire : Une femme est venue voir le Messager d'Allah (ﷺ) et a dit : Le Messager d'Allah. J'ai une fille dont le mari est décédé et qui a développé des problèmes aux yeux ; faut-il lui appliquer du collyre ? Sur ce, le Messager d'Allah (ﷺ) a dit : Non (en le répétant deux ou trois fois, en disant seulement : NON \" tout le temps). Puis il a dit : Cela ne fait que quatre bouches et dix jours, alors que dans la période préislamique, aucun de vous ne jetait les excréments avant un an. Humaid a dit : J'ai dit à Zainab : Qu'est-ce que ce jet d'excréments jusqu'à ce qu'un an soit écoulé ? Zainab a dit : Quand le mari d'une femme est mort, elle est entrée dans une hutte et l'a revêtue. les pires vêtements, et elle ne s'est pas parfumée ou quelque chose comme ça avant un an. Ensuite, un animal comme un âne, ou une chèvre, ou un oiseau, lui a été amené et elle a frotté sa main dessus, et il se trouve que celui sur lequel elle a frotté sa main est mort. Elle est alors sortie de sa maison et on lui a donné de la bouse et elle l'a jetée et ensuite elle a utilisé n'importe quoi comme du parfum ou autre chose comme elle voulait."
    },
    {
        "hadithnumber": 3726,
        "text": "Zainab (bint Abu Salama) (qu'Allah l'agrée) a rapporté : Je suis allée à Umm Habiba, l'épouse de l'apôtre d'Allah (ﷺ), lorsque son père Abu Sufyan était décédé. Umm Habiba a envoyé chercher un parfum contenant du jaune ou quelque chose d'autre, et elle l'a appliqué sur une fille, puis l'a frotté sur ses joues et a ensuite dit : Par Allah, je n'ai besoin de parfum que pour le fait que j'ai entendu le Messager d'Allah (ﷺ) dire sur la chaire : « Il n'est pas permis à une femme croyant en Allah et dans l'au-delà de pleurer les morts au-delà de trois jours, mais (en cas de décès) du mari, il est permis pendant quatre mois et dix. jours.\" Zainab a dit : J'ai ensuite rendu visite à Zainab, suggérant Jahsh (qu'Allah l'agrée) lorsque son frère est mort et elle a envoyé chercher du parfum et l'a appliqué, puis a dit : Par Allah, je ne ressens aucun besoin du parfum mais j'ai entendu le Messager d'Allah (ﷺ) dire sur la chaire : « Il n'est pas permis à une femme croyant en Allah et au Cisjordanie de pleurer les morts au-delà de trois jours, sauf dans le cas de son mari (pour qui elle peut pleurer) pendant quatre mois. et dix jours. » Zainab (qu'Allah l'agrée) a dit : J'ai entendu ma mère Umm Salama (qu'Allah l'agrée) dire : Une femme est venue voir le Messager d'Allah (ﷺ) et a dit : Le Messager d'Allah. J'ai une fille dont le mari est décédé et qui a développé des problèmes aux yeux ; faut-il lui appliquer du collyre ? Sur ce, le Messager d'Allah (ﷺ) a dit : Non (en le répétant deux ou trois fois, en disant seulement : NON \" tout le temps). Puis il a dit : Cela ne fait que quatre bouches et dix jours, alors que dans la période préislamique, aucun de vous ne jetait les excréments avant un an. Humaid a dit : J'ai dit à Zainab : Qu'est-ce que ce jet d'excréments jusqu'à ce qu'un an soit écoulé ? Zainab a dit : Quand le mari d'une femme est mort, elle est entrée dans une hutte et l'a revêtue. les pires vêtements, et elle ne s'est pas parfumée ou quelque chose comme ça avant un an. Ensuite, un animal comme un âne, ou une chèvre, ou un oiseau, lui a été amené et elle a frotté sa main dessus, et il se trouve que celui sur lequel elle a frotté sa main est mort. Elle est alors sortie de sa maison et on lui a donné de la bouse et elle l'a jetée et ensuite elle a utilisé n'importe quoi comme du parfum ou autre chose comme elle voulait."
    },
    {
        "hadithnumber": 3727,
        "text": "Zainab (bint Abu Salama) (qu'Allah l'agrée) a rapporté : Je suis allée à Umm Habiba, l'épouse de l'apôtre d'Allah (ﷺ), lorsque son père Abu Sufyan était décédé. Umm Habiba a envoyé chercher un parfum contenant du jaune ou quelque chose d'autre, et elle l'a appliqué sur une fille, puis l'a frotté sur ses joues et a ensuite dit : Par Allah, je n'ai besoin de parfum que pour le fait que j'ai entendu le Messager d'Allah (ﷺ) dire sur la chaire : « Il n'est pas permis à une femme croyant en Allah et dans l'au-delà de pleurer les morts au-delà de trois jours, mais (en cas de décès) du mari, il est permis pendant quatre mois et dix. jours.\" Zainab a dit : J'ai ensuite rendu visite à Zainab, suggérant Jahsh (qu'Allah l'agrée) lorsque son frère est mort et elle a envoyé chercher du parfum et l'a appliqué, puis a dit : Par Allah, je ne ressens aucun besoin du parfum mais j'ai entendu le Messager d'Allah (ﷺ) dire sur la chaire : « Il n'est pas permis à une femme croyant en Allah et au Cisjordanie de pleurer les morts au-delà de trois jours, sauf dans le cas de son mari (pour qui elle peut pleurer) pendant quatre mois. et dix jours. » Zainab (qu'Allah l'agrée) a dit : J'ai entendu ma mère Umm Salama (qu'Allah l'agrée) dire : Une femme est venue voir le Messager d'Allah (ﷺ) et a dit : Le Messager d'Allah. J'ai une fille dont le mari est décédé et qui a développé des problèmes aux yeux ; faut-il lui appliquer du collyre ? Sur ce, le Messager d'Allah (ﷺ) a dit : Non (en le répétant deux ou trois fois, en disant seulement : NON \" tout le temps). Puis il a dit : Cela ne fait que quatre bouches et dix jours, alors que dans la période préislamique, aucun de vous ne jetait les excréments avant un an. Humaid a dit : J'ai dit à Zainab : Qu'est-ce que ce jet d'excréments jusqu'à ce qu'un an soit écoulé ? Zainab a dit : Quand le mari d'une femme est mort, elle est entrée dans une hutte et l'a revêtue. les pires vêtements, et elle ne s'est pas parfumée ou quelque chose comme ça avant un an. Ensuite, un animal comme un âne, ou une chèvre, ou un oiseau, lui a été amené et elle a frotté sa main dessus, et il se trouve que celui sur lequel elle a frotté sa main est mort. Elle est alors sortie de sa maison et on lui a donné de la bouse et elle l'a jetée et ensuite elle a utilisé n'importe quoi comme du parfum ou autre chose comme elle voulait."
    },
    {
        "hadithnumber": 3730,
        "text": "Ce hadith a été rapporté par Zainab de sa mère et de Zainab, l'épouse de l'apôtre d'Allah (ﷺ), ou d'une autre dame parmi les épouses du Prophète (ﷺ)"
    },
    {
        "hadithnumber": 3792,
        "text": "Abu Huraira (qu'Allah l'agrée) rapporte que l'Apôtre d'Allah (ﷺ) a dit : Celui qui a pris l'esclave affranchi comme son allié sans le consentement de son précédent maître, la malédiction d'Allah et celle de Ses anges et celle de l'humanité entière sera sur lui, et ses actes obligatoires ou ses actes supercrogatoires ne seront pas acceptés de sa part le Jour de la Résurrection. Ce hadith est raconté à travers la même chaîne de transmetteurs, mais avec un léger changement de mots"
    },
    {
        "hadithnumber": 3842,
        "text": "Ibn Umar (qu'Allah soit satisfait d'eux) a rapporté que le Messager d'Allah (ﷺ) a dit : Celui qui achète des céréales alimentaires ne devrait pas les vendre avant d'en prendre possession. Il (le narrateur) a dit : Nous avions l'habitude d'acheter des céréales alimentaires dans les caravanes en gros, mais le Messager d'Allah (ﷺ) nous a interdit de les revendre jusqu'à ce que nous les ayons déplacées vers un autre endroit."
    },
    {
        "hadithnumber": 4251,
        "text": "Ce hadith a été rapporté sous l'autorité de 'Uqba b. Amir Juhani. mais ici aucune mention n'a été faite de\" pieds nus"
    },
    {
        "hadithnumber": 4252,
        "text": "Ce hadith a été rapporté sous l'autorité de 'Uqba b. Amir Juhani. mais ici aucune mention n'a été faite de\" pieds nus"
    },
    {
        "hadithnumber": 4435,
        "text": "Ce hadith a été rapporté sous l'autorité de Zuhri avec la même chaîne de transmetteurs."
    },
    {
        "hadithnumber": 4504,
        "text": "Zaïd b. Khalid al-Juhani a rapporté que le Messager d'Allah (ﷺ) a été interrogé sur le ramassage des objets égarés, sur quoi il a répondu : Faites-en l'annonce pendant un an, mais s'il n'est pas reconnu (par le propriétaire), alors reconnaissez son gros et sa sangle, puis mangez-le ; et si son propriétaire vient, donnez-le-lui. Ce hadith a été rapporté sous l'autorité d'Al-Dahhak b. Uthman avec la même chaîne d'émetteurs mais avec une légère variation de mots"
    },
    {
        "hadithnumber": 4505,
        "text": "Zaïd b. Khalid al-Juhani a rapporté que le Messager d'Allah (ﷺ) a été interrogé sur le ramassage des objets égarés, sur quoi il a répondu : Faites-en l'annonce pendant un an, mais s'il n'est pas reconnu (par le propriétaire), alors reconnaissez son gros et sa sangle, puis mangez-le ; et si son propriétaire vient, donnez-le-lui. Ce hadith a été rapporté sous l'autorité d'Al-Dahhak b. Uthman avec la même chaîne d'émetteurs mais avec une légère variation de mots"
    },
    {
        "hadithnumber": 4521,
        "text": "Il a été rapporté par Sulaiman b. Buraida par l'intermédiaire de son père que lorsque le Messager d'Allah (ﷺ) nommait quelqu'un comme chef d'une armée ou d'un détachement, il l'exhortait particulièrement à craindre Allah et à être bon envers les musulmans qui étaient avec lui. Il disait : Combattez au nom d'Allah et dans le chemin d'Allah. Combattez ceux qui ne croient pas en Allah. Faites une guerre sainte, ne détournez pas le butin ; ne rompez pas votre engagement ; et ne mutilez pas les cadavres ; ne tuez pas les enfants. Lorsque vous rencontrez vos ennemis polythéistes, invitez-les à trois plans d’action. S’ils réagissent à l’une de ces réponses, vous l’acceptez également et vous vous abstenez de leur faire du mal. Invitez-les à (accepter) l’Islam ; s’ils vous répondent, acceptez-le et cessez de vous battre contre eux. Invitez-les ensuite à migrer de leurs terres vers le pays des Muhajireen et informez-les que, s'ils le font, ils auront tous les privilèges et obligations des Muhajireen. S'ils refusent d'émigrer, dites-leur qu'ils auront le statut de musulmans bédouins et seront soumis aux commandements d'Allah comme les autres musulmans, mais qu'ils n'obtiendront aucune part du butin de guerre ou du Fai', sauf lorsqu'ils combattront réellement avec les musulmans (contre les mécréants). S'ils refusent d'accepter l'Islam, exigez-leur la Jizya. S’ils acceptent de payer, acceptez-le et ne vous accrochez pas. S'ils refusent de payer l'impôt, demandez l'aide d'Allah et combattez-les. Lorsque vous assiégez un fort et que les assiégés vous demandent protection au nom d'Allah et de Son Prophète, ne leur accordez pas la garantie d'Allah et de Son Prophète, mais accordez-leur votre propre garantie et celle de vos compagnons, car c'est un moindre péché de méconnaître la sécurité donnée par vous ou vos compagnons que de violer la sécurité accordée au nom d'Allah et de Son Prophète. Lorsque vous assiégez un fort et que les assiégés veulent que vous les laissiez sortir conformément à l'ordre d'Allah, ne les laissez pas sortir conformément à Son ordre, mais faites-le selon votre (propre) ordre, car vous ne savez pas si vous pourrez ou non exécuter l'ordre d'Allah à leur égard."
    },
    {
        "hadithnumber": 4522,
        "text": "Il a été rapporté par Sulaiman b. Buraida par l'intermédiaire de son père que lorsque le Messager d'Allah (ﷺ) nommait quelqu'un comme chef d'une armée ou d'un détachement, il l'exhortait particulièrement à craindre Allah et à être bon envers les musulmans qui étaient avec lui. Il disait : Combattez au nom d'Allah et dans le chemin d'Allah. Combattez ceux qui ne croient pas en Allah. Faites une guerre sainte, ne détournez pas le butin ; ne rompez pas votre engagement ; et ne mutilez pas les cadavres ; ne tuez pas les enfants. Lorsque vous rencontrez vos ennemis polythéistes, invitez-les à trois plans d’action. S’ils réagissent à l’une de ces réponses, vous l’acceptez également et vous vous abstenez de leur faire du mal. Invitez-les à (accepter) l’Islam ; s’ils vous répondent, acceptez-le et cessez de vous battre contre eux. Invitez-les ensuite à migrer de leurs terres vers le pays des Muhajireen et informez-les que, s'ils le font, ils auront tous les privilèges et obligations des Muhajireen. S'ils refusent d'émigrer, dites-leur qu'ils auront le statut de musulmans bédouins et seront soumis aux commandements d'Allah comme les autres musulmans, mais qu'ils n'obtiendront aucune part du butin de guerre ou du Fai', sauf lorsqu'ils combattront réellement avec les musulmans (contre les mécréants). S'ils refusent d'accepter l'Islam, exigez-leur la Jizya. S’ils acceptent de payer, acceptez-le et ne vous accrochez pas. S'ils refusent de payer l'impôt, demandez l'aide d'Allah et combattez-les. Lorsque vous assiégez un fort et que les assiégés vous demandent protection au nom d'Allah et de Son Prophète, ne leur accordez pas la garantie d'Allah et de Son Prophète, mais accordez-leur votre propre garantie et celle de vos compagnons, car c'est un moindre péché de méconnaître la sécurité donnée par vous ou vos compagnons que de violer la sécurité accordée au nom d'Allah et de Son Prophète. Lorsque vous assiégez un fort et que les assiégés veulent que vous les laissiez sortir conformément à l'ordre d'Allah, ne les laissez pas sortir conformément à Son ordre, mais faites-le selon votre (propre) ordre, car vous ne savez pas si vous pourrez ou non exécuter l'ordre d'Allah à leur égard."
    },
    {
        "hadithnumber": 4680,
        "text": "Il a été rapporté sous l'autorité d'Anas que, le jour de Hunain. Umm Sulaim a sorti un poignard qu'elle avait en sa possession. Abiu Talha la vit et dit : Messager d'Allah, voici Umm Sulaim. Elle tient un poignard. Le Messager d'Allah (ﷺ) lui a demandé : Pourquoi tenez-vous ce poignard ? Elle dit : Je l'ai pris pour pouvoir déchirer le ventre d'un polythéiste qui s'approche de moi. Le Messager d'Allah (ﷺ) a commencé à sourire (à ces mots). Elle dit : Messager d'Allah, tue tous ces gens-autres que nous-que tu as déclaré libres (le jour de la conquête de la Mecque). (Ils ont embrassé l’Islam parce que) ils ont été vaincus par vos mains (et en tant que tel, leur Islam n’est pas fiable). Le Messager d'Allah (ﷺ) a dit : Umm Sulaim. Dieu est suffisant (contre les méfaits des polythéistes) et Il sera gentil avec nous (vous n'avez donc pas besoin de porter ce poignard)"
    },
    {
        "hadithnumber": 4681,
        "text": "Il a été rapporté sous l'autorité d'Anas que, le jour de Hunain. Umm Sulaim a sorti un poignard qu'elle avait en sa possession. Abiu Talha la vit et dit : Messager d'Allah, voici Umm Sulaim. Elle tient un poignard. Le Messager d'Allah (ﷺ) lui a demandé : Pourquoi tenez-vous ce poignard ? Elle dit : Je l'ai pris pour pouvoir déchirer le ventre d'un polythéiste qui s'approche de moi. Le Messager d'Allah (ﷺ) a commencé à sourire (à ces mots). Elle dit : Messager d'Allah, tue tous ces gens-autres que nous-que tu as déclaré libres (le jour de la conquête de la Mecque). (Ils ont embrassé l’Islam parce que) ils ont été vaincus par vos mains (et en tant que tel, leur Islam n’est pas fiable). Le Messager d'Allah (ﷺ) a dit : Umm Sulaim. Dieu est suffisant (contre les méfaits des polythéistes) et Il sera gentil avec nous (vous n'avez donc pas besoin de porter ce poignard)"
    },
    {
        "hadithnumber": 4725,
        "text": "Cette tradition a été racontée à travers davantage ; plus d'une chaîne d'émetteurs"
    },
    {
        "hadithnumber": 4726,
        "text": "Cette tradition a été racontée à travers davantage ; plus d'une chaîne d'émetteurs"
    },
    {
        "hadithnumber": 4747,
        "text": "Il a été rapporté sous l'autorité d'Abou Huraira que le Saint Prophète (ﷺ) a dit : Celui qui m'obéit obéit à Dieu, et celui qui me désobéit désobéit à Dieu. Celui qui obéit au commandant (nommé par moi) m'obéit, et celui qui désobéit au commandant me désobéit. La même tradition transmise par différentes personnes omet la portion : Et dont le commandant désobéit me désobéit"
    },
    {
        "hadithnumber": 4748,
        "text": "Il a été rapporté sous l'autorité d'Abou Huraira que le Saint Prophète (ﷺ) a dit : Celui qui m'obéit obéit à Dieu, et celui qui me désobéit désobéit à Dieu. Celui qui obéit au commandant (nommé par moi) m'obéit, et celui qui désobéit au commandant me désobéit. La même tradition transmise par différentes personnes omet la portion : Et dont le commandant désobéit me désobéit"
    },
    {
        "hadithnumber": 4780,
        "text": "Cette tradition a été racontée par la même autorité à travers une chaîne de transmetteurs différente. Une autre version de la tradition rapportée sous l'autorité de Shu'ba n'inclut pas les mots : « Il prit le Messager d'Allah (ﷺ) à part."
    },
    {
        "hadithnumber": 4781,
        "text": "Cette tradition a été racontée par la même autorité à travers une chaîne de transmetteurs différente. Une autre version de la tradition rapportée sous l'autorité de Shu'ba n'inclut pas les mots : « Il prit le Messager d'Allah (ﷺ) à part."
    },
    {
        "hadithnumber": 4819,
        "text": "Il a été rapporté sous l'autorité de Sa'id b. Musayyab qui a dit : Mon père était l'un de ceux qui ont juré fidélité au Messager d'Allah (ﷺ) près de l'arbre. Lorsque nous sommes passés par là l’année prochaine avec l’intention d’accomplir le Hajj, la place de l’arbre nous était cachée. Si vous pouviez le souligner clairement, vous sauriez (certainement) mieux. Il a également été rapporté sous l'autorité de Sa'id b. Musayyib qui a appris de son père qu'ils étaient avec le Messager d'Allah (ﷺ) l'année de l'Arbre (c'est-à-dire l'année de la fidélité à l'agrément de Dieu juré sous l'arbre à Hudaibiya), mais l'année suivante, ils ont oublié l'endroit de l'arbre"
    },
    {
        "hadithnumber": 4820,
        "text": "Il a été rapporté sous l'autorité de Sa'id b. Musayyab qui a dit : Mon père était l'un de ceux qui ont juré fidélité au Messager d'Allah (ﷺ) près de l'arbre. Lorsque nous sommes passés par là l’année prochaine avec l’intention d’accomplir le Hajj, la place de l’arbre nous était cachée. Si vous pouviez le souligner clairement, vous sauriez (certainement) mieux. Il a également été rapporté sous l'autorité de Sa'id b. Musayyib qui a appris de son père qu'ils étaient avec le Messager d'Allah (ﷺ) l'année de l'Arbre (c'est-à-dire l'année de la fidélité à l'agrément de Dieu juré sous l'arbre à Hudaibiya), mais l'année suivante, ils ont oublié l'endroit de l'arbre"
    },
    {
        "hadithnumber": 4905,
        "text": "La tradition ci-dessus a également été racontée à travers deux chaînes d'émetteurs différentes sous l'autorité d'Abu Sa'id Khudri et Yahya, respectivement."
    },
    {
        "hadithnumber": 4906,
        "text": "La tradition ci-dessus a également été racontée à travers deux chaînes d'émetteurs différentes sous l'autorité d'Abu Sa'id Khudri et Yahya, respectivement."
    },
    {
        "hadithnumber": 4968,
        "text": "La tradition ci-dessus a été racontée à travers une autre chaîne de transmetteurs"
    },
    {
        "hadithnumber": 4969,
        "text": "Il a été rapporté (à travers une chaîne de transmission différente) sous l'autorité de Jabir qui a dit : Le Messager d'Allah (ﷺ) a interdit à un homme de venir dans sa famille comme un visiteur nocturne (inattendu), doutant de leur fidélité et espionnant leurs erreurs."
    },
    {
        "hadithnumber": 4970,
        "text": "Cette tradition a été rapportée par une autre chaîne. 'Abdurahman, l'un des sous-narrateurs, a déclaré \"Je ne sais pas si c'est dans le hadith ou non\", signifiant (les mots) \"doutant de leur fidélité et espionnant leurs erreurs\"."
    },
    {
        "hadithnumber": 4971,
        "text": "Une version de la tradition racontée sous l'autorité de Jabir (mais par une chaîne de transmetteurs différente) mentionne qu'il n'est pas souhaitable de venir chez soi comme un visiteur de nuit, mais ne contient pas les mots : « Douter de leur fidélité ou espionner leurs erreurs."
    },
    {
        "hadithnumber": 5112,
        "text": "Thauban, l'esclave affranchi du Messager d'Allah (ﷺ), a rapporté : Le Messager d'Allah (ﷺ) m'a dit à l'occasion du Hajjat-al-Wada' (le pèlerinage d'adieu) : Rendre la chair utilisable. Je l'ai donc rendu utilisable (pour lui) et il l'a mangé constamment jusqu'à ce qu'il atteigne Médine. Ce hadith a été rapporté sous l'autorité de Yabya b. Hamza avec la même chaîne d'émetteurs, mais il n'a pas dit : A l'occasion du Hajjat-al-Wada"
    },
    {
        "hadithnumber": 5113,
        "text": "Thauban, l'esclave affranchi du Messager d'Allah (ﷺ), a rapporté : Le Messager d'Allah (ﷺ) m'a dit à l'occasion du Hajjat-al-Wada' (le pèlerinage d'adieu) : Rendre la chair utilisable. Je l'ai donc rendu utilisable (pour lui) et il l'a mangé constamment jusqu'à ce qu'il atteigne Médine. Ce hadith a été rapporté sous l'autorité de Yabya b. Hamza avec la même chaîne d'émetteurs, mais il n'a pas dit : A l'occasion du Hajjat-al-Wada"
    },
    {
        "hadithnumber": 5204,
        "text": "Jabir b. 'Abd Allah a rapporté que le Messager d'Allah (ﷺ) a interdit (la préparation) du Nabidh dans un pichet vert, dans un pot vernis, dans une souche creuse, et lorsque le Messager d'Allah (ﷺ) n'a rien trouvé pour préparer le Nabidh dans cela (c'est-à-dire une outre d'eau), il lui a été préparé dans un grand bol en pierre."
    },
    {
        "hadithnumber": 5207,
        "text": "Abdallah b. Buraida, sous l'autorité de son père, rapporta que le Messager d'Allah (ﷺ) avait dit : Je t'avais interdit de préparer le Nabidh sauf dans une outre. Mais maintenant vous pouvez boire dans tous les vases, mais ne buvez pas ce qui est enivrant."
    },
    {
        "hadithnumber": 5208,
        "text": "Ibn Buraida, sous l'autorité de son père, a rapporté que le Messager d'Allah (ﷺ) a dit : Je vous avais interdit (de la préparation du Nabidh) et de le boire dans certains récipients, (mais maintenant vous pouvez le faire si vous le souhaitez) car ce ne sont pas des récipients ou un récipient qui rendent une chose licite ou illicite. Toutes les substances intoxicantes sont illégales"
    },
    {
        "hadithnumber": 5519,
        "text": "Abu Talha Ansari a rapporté que le Messager d'Allah (ﷺ) a dit : Les anges n'entrent pas dans la maison dans laquelle il y a une image ou des portraits. Je suis venu voir 'A'isha et lui ai dit : C'est une nouvelle que j'ai reçue selon laquelle l'Apôtre d'Allah (ﷺ) avait dit : Les anges n'entrent pas dans la maison dans laquelle il y a une image ou un chien, (et a ajouté en outre) si elle avait entendu le Messager d'Allah (ﷺ) en faire mention. Elle dit : Non (je n'ai pas entendu cela moi-même), mais je vous raconte ce que je l'ai vu faire. Je témoigne du fait qu'il (le Saint Prophète) partit en expédition. J'ai pris un tapis et j'ai masqué la porte avec. Quand il (le Saint Prophète) est revenu, il a vu ce tapis et j'ai perçu des signes de désapprobation sur son visage. Il l'a tiré jusqu'à ce qu'il soit déchiré ou coupé (en morceaux) et il a dit : Dieu ne nous a pas commandé de revêtir des pierres et de l'argile. Nous l'avons coupé (le rideau) et en avons préparé deux oreillers en les bourrant de fibres de dattier et il (le Saint Prophète) n'y a pas trouvé à redire."
    },
    {
        "hadithnumber": 5521,
        "text": "A'isha rapporta : Nous avions avec nous un rideau sur lequel étaient représentés des portraits d'oiseaux. Chaque fois qu'un visiteur arrivait, il le trouvait devant lui. Sur ce, le Messager d'Allah (ﷺ) m'a dit : Change-les, car chaque fois que j'entre dans la pièce, je les vois et cela me rappelle (les plaisirs) de la vie mondaine. Elle a dit : Nous avions avec nous un drap sur lequel étaient imprimés des insignes de soie et nous le portions. Ce hadith a été transmis sous l'autorité d'Ibn Muthanna mais avec cet ajout : « Le Messager d'Allah (ﷺ) ne nous a pas ordonné de déchirer ce"
    },
    {
        "hadithnumber": 5522,
        "text": "A'isha rapporta : Nous avions avec nous un rideau sur lequel étaient représentés des portraits d'oiseaux. Chaque fois qu'un visiteur arrivait, il le trouvait devant lui. Sur ce, le Messager d'Allah (ﷺ) m'a dit : Change-les, car chaque fois que j'entre dans la pièce, je les vois et cela me rappelle (les plaisirs) de la vie mondaine. Elle a dit : Nous avions avec nous un drap sur lequel étaient imprimés des insignes de soie et nous le portions. Ce hadith a été transmis sous l'autorité d'Ibn Muthanna mais avec cet ajout : « Le Messager d'Allah (ﷺ) ne nous a pas ordonné de déchirer ce"
    },
    {
        "hadithnumber": 5539,
        "text": "Musulman b. Subaih a rapporté : J'étais avec Masriuq dans la maison qui présentait les représentations de Marie (hadrat Maryan). Alors Masriuq dit : Ce sont des portraits de Kisra. J'ai dit : Non, ceux-ci sont de Marie. Masruq a dit : J'ai entendu Abdullah b, Mas'ud dire que le Messager d'Allah (ﷺ) avait dit : Les personnes les plus gravement tourmentées le Jour de la Résurrection seraient les peintres de tableaux. (Muslim a dit) : J'ai lu ceci avant Nasr b. 'Ali at-Jahdami et il l'ont lu devant d'autres narrateurs, le dernier étant Ibn Sa'id b Abl at Hasan, qu'une personne est venue voir Ibn 'Abbas et a dit : Je suis la personne qui peint des tableaux ; donnez-moi un verdict religieux à leur sujet. Il (Ibn 'Abbas) lui dit : Approche-toi de moi (encore plus loin). Il s'est tellement approché de lui qu'il a posé sa main sur sa tête et a dit : Je vais vous raconter ce que j'ai entendu du Messager d'Allah (ﷺ). Je l'ai entendu dire : Tous les peintres qui font des tableaux seraient dans le feu de l'Enfer. L'âme sera respirée dans chaque tableau qu'il prépare et elle le punira en Enfer, et il (Ibn 'Abbas) dit : Si vous devez le faire, alors peignez des tableaux d'arbres et de choses sans vie ; et Nasr b. 'Ali l'a confirmé"
    },
    {
        "hadithnumber": 5540,
        "text": "Musulman b. Subaih a rapporté : J'étais avec Masriuq dans la maison qui présentait les représentations de Marie (hadrat Maryan). Alors Masriuq dit : Ce sont des portraits de Kisra. J'ai dit : Non, ceux-ci sont de Marie. Masruq a dit : J'ai entendu Abdullah b, Mas'ud dire que le Messager d'Allah (ﷺ) avait dit : Les personnes les plus gravement tourmentées le Jour de la Résurrection seraient les peintres de tableaux. (Muslim a dit) : J'ai lu ceci avant Nasr b. 'Ali at-Jahdami et il l'ont lu devant d'autres narrateurs, le dernier étant Ibn Sa'id b Abl at Hasan, qu'une personne est venue voir Ibn 'Abbas et a dit : Je suis la personne qui peint des tableaux ; donnez-moi un verdict religieux à leur sujet. Il (Ibn 'Abbas) lui dit : Approche-toi de moi (encore plus loin). Il s'est tellement approché de lui qu'il a posé sa main sur sa tête et a dit : Je vais vous raconter ce que j'ai entendu du Messager d'Allah (ﷺ). Je l'ai entendu dire : Tous les peintres qui font des tableaux seraient dans le feu de l'Enfer. L'âme sera respirée dans chaque tableau qu'il prépare et elle le punira en Enfer, et il (Ibn 'Abbas) dit : Si vous devez le faire, alors peignez des tableaux d'arbres et de choses sans vie ; et Nasr b. 'Ali l'a confirmé"
    },
    {
        "hadithnumber": 5556,
        "text": "Anas a rapporté : Nous sommes allés voir le Messager d'Allah (ﷺ) alors qu'il était dans le troupeau et il cautérisait les animaux du troupeau et je pense (il les cautérisait) sur leurs oreilles. Ce hadith a été rapporté sous l'autorité de Shu'ba à travers une autre chaîne de transmetteurs."
    },
    {
        "hadithnumber": 5557,
        "text": "Anas a rapporté : Nous sommes allés voir le Messager d'Allah (ﷺ) alors qu'il était dans le troupeau et il cautérisait les animaux du troupeau et je pense (il les cautérisait) sur leurs oreilles. Ce hadith a été rapporté sous l'autorité de Shu'ba à travers une autre chaîne de transmetteurs."
    },
    {
        "hadithnumber": 5569,
        "text": "A'isha a rapporté qu'une femme des Ansar a épousé sa fille qui avait perdu ses cheveux à cause d'une maladie. Elle est venue voir l'Apôtre d'Allah (ﷺ) et a dit : Son mari veut que de faux cheveux soient attachés à sa tête. Sur ce, le Messager d'Allah (ﷺ) a dit : La femme qui ajoute des faux cheveux a été maudite. Ce hadith a été rapporté sous l'autorité de Nafi' avec la même chaîne de transmetteurs mais avec une légère variation de formulation."
    },
    {
        "hadithnumber": 5570,
        "text": "A'isha a rapporté qu'une femme des Ansar a épousé sa fille qui avait perdu ses cheveux à cause d'une maladie. Elle est venue voir l'Apôtre d'Allah (ﷺ) et a dit : Son mari veut que de faux cheveux soient attachés à sa tête. Sur ce, le Messager d'Allah (ﷺ) a dit : La femme qui ajoute des faux cheveux a été maudite. Ce hadith a été rapporté sous l'autorité de Nafi' avec la même chaîne de transmetteurs mais avec une légère variation de formulation."
    },
    {
        "hadithnumber": 5571,
        "text": "Ibn Umar a rapporté que le Messager d'Allah (ﷺ) avait maudit la femme qui avait ajouté de faux cheveux et la femme qui avait demandé des tatouages. Ce hadith a été rapporté sous l'autorité d'Abdallah à travers une autre chaîne de transmetteurs."
    },
    {
        "hadithnumber": 5572,
        "text": "Ibn Umar a rapporté que le Messager d'Allah (ﷺ) avait maudit la femme qui avait ajouté de faux cheveux et la femme qui avait demandé des tatouages. Ce hadith a été rapporté sous l'autorité d'Abdallah à travers une autre chaîne de transmetteurs."
    },
    {
        "hadithnumber": 5669,
        "text": "Ce hadith a été rapporté sous l'autorité de Hisham avec la même chaîne de transmetteurs, et les mots sont : Elle (Sauda) était une femme qui semblait être importante parmi les gens (en ce qui concerne la majeure partie de son corps). Le reste du hadith est le même"
    },
    {
        "hadithnumber": 5670,
        "text": "Ce hadith a été rapporté sous l'autorité de Hisham avec la même chaîne de transmetteurs, et les mots sont : Elle (Sauda) était une femme qui semblait être importante parmi les gens (en ce qui concerne la majeure partie de son corps). Le reste du hadith est le même"
    },
    {
        "hadithnumber": 5762,
        "text": "Umm Qais, fille de Mihsan, sœur de 'Ukasha b. Mihsan a dit : J'ai rendu visite au Messager d'Allah (ﷺ) avec mon fils qui, à ce moment-là, n'avait pas encore été sevré et il a uriné sur ses (vêtements). Il ordonna d'apporter de l'eau et de l'asperger sur eux. Elle (en outre) dit : Je lui ai rendu visite (l'Apôtre d'Allah) avec mon fils et j'ai comprimé le gonflement de la luette, après quoi il a dit : Pourquoi affligez-vous vos enfants en comprimant ainsi ? Utilisez ce bois d'aloès indien, car il contient sept types de remèdes, l'un d'entre eux étant un remède contre la pleurésie. Il est appliqué par le nez en cas de gonflement de la luette et versé sur le côté de la bouche en cas de pleurésie."
    },
    {
        "hadithnumber": 5764,
        "text": "Umm Qais, fille de Mihsan, était l'une des premières émigrantes à avoir prêté allégeance au Messager d'Allah (ﷺ). Elle était la sœur d'Ukasha b. Mihsan, un des descendants d'Asad b. Khuzaïma. Elle a rapporté qu'elle était venue voir le messager d'Allah (ﷺ) avec son fils qui n'avait pas atteint l'âge du sevrage et qu'elle avait comprimé le gonflement de sa luette. (Yunus a dit : Elle a comprimé la luette parce qu'elle avait peur qu'elle puisse gonfler.) Sur ce, le Messager d'Allah (ﷺ) a dit : Pourquoi affligez-vous vos enfants en comprimant de cette manière ? Vous devriez utiliser du bois d'aloès indien, car il contient sept remèdes, l'un d'eux étant le remède contre la pleurésie. Ubaidullah a rapporté qu'elle avait dit que c'était l'enfant qui avait uriné sur les genoux du Messager d'Allah (ﷺ), et le Messager d'Allah (ﷺ) a demandé de l'eau et l'a aspergée sur son urine, mais il ne l'a pas bien lavée."
    },
    {
        "hadithnumber": 5826,
        "text": "Ibn 'Umar a rapporté : J'ai entendu le Messager d'Allah (ﷺ) ordonner de tuer les chiens et de tuer les serpents rayés et à queue courte, car les deux affectent négativement la vue et provoquent des fausses couches. Zuhri a déclaré : Nous avons pensé à leur poison (aux effets pernicieux de ces deux-là). Mais Allah sait mieux. 'Abd Allah b. 'Umar a dit : Je n'ai épargné aucun serpent. J'ai plutôt tué tous ceux que j'ai vu. Un jour, alors que je poursuivais un serpent parmi les serpents de la maison, Zaid b. Khattab ou Abu Lubaba sont passés à côté de moi et m'ont trouvé en train de le poursuivre. Il a dit : « Abdullah, attends. J'ai dit : Le Messager d'Allah (ﷺ) nous a ordonné de les tuer, après quoi il a dit que le Messager d'Allah (ﷺ) a interdit de tuer les serpents des maisons. Ce hadith a été rapporté sous l'autorité de Zuhri avec la même chaîne de transmetteurs mais avec une légère variation de formulation."
    },
    {
        "hadithnumber": 5827,
        "text": "Ibn 'Umar a rapporté : J'ai entendu le Messager d'Allah (ﷺ) ordonner de tuer les chiens et de tuer les serpents rayés et à queue courte, car les deux affectent négativement la vue et provoquent des fausses couches. Zuhri a déclaré : Nous avons pensé à leur poison (aux effets pernicieux de ces deux-là). Mais Allah sait mieux. 'Abd Allah b. 'Umar a dit : Je n'ai épargné aucun serpent. J'ai plutôt tué tous ceux que j'ai vu. Un jour, alors que je poursuivais un serpent parmi les serpents de la maison, Zaid b. Khattab ou Abu Lubaba sont passés à côté de moi et m'ont trouvé en train de le poursuivre. Il a dit : « Abdullah, attends. J'ai dit : Le Messager d'Allah (ﷺ) nous a ordonné de les tuer, après quoi il a dit que le Messager d'Allah (ﷺ) a interdit de tuer les serpents des maisons. Ce hadith a été rapporté sous l'autorité de Zuhri avec la même chaîne de transmetteurs mais avec une légère variation de formulation."
    },
    {
        "hadithnumber": 5885,
        "text": "Amr b. Sharid a rapporté que son père avait dit : Un jour, alors que je roulais derrière le Messager d'Allah (ﷺ), il m'a dit : Vous souvenez-vous d'une poésie d'Umayya b. Abou Sel. J'ai dit : Oui. Il a dit : Alors continuez. J'ai récité un couplet et il a dit : Continue. Puis j'ai récité à nouveau un couplet et il a dit : Continuez. J'ai récité cent distiques (de sa poésie). Ce hadith a été rapporté sous l'autorité de Sharid via une autre chaîne de transmetteurs mais avec une légère variation de formulation."
    },
    {
        "hadithnumber": 5886,
        "text": "Amr b. Sharid a rapporté que son père avait dit : Un jour, alors que je roulais derrière le Messager d'Allah (ﷺ), il m'a dit : Vous souvenez-vous d'une poésie d'Umayya b. Abou Sel. J'ai dit : Oui. Il a dit : Alors continuez. J'ai récité un couplet et il a dit : Continue. Puis j'ai récité à nouveau un couplet et il a dit : Continuez. J'ai récité cent distiques (de sa poésie). Ce hadith a été rapporté sous l'autorité de Sharid via une autre chaîne de transmetteurs mais avec une légère variation de formulation."
    },
    {
        "hadithnumber": 5935,
        "text": "Ibn `Abbas a rapporté que Musailima al-Kadhdhab (le plus grand menteur) (qui a revendiqué le statut de prophète après la mort du Saint Prophète) est venu à Médine du vivant de l'Apôtre d'Allah (ﷺ) et a dit : Si Muhammad m'attribue son califat après lui, je le suivrais, et un grand groupe de personnes de sa tribu est venu avec lui, et l'Apôtre d'Allah (ﷺ) est venu vers lui avec Thabit b. Qaïs b. Shammas et le Prophète d'Allah (ﷺ) avaient un morceau de bois à la main jusqu'à ce qu'il se présente devant Musailima en compagnie de ses compagnons et dit : Si vous deviez demander ne serait-ce que ce (bois), je ne vous le donnerais jamais. Je ne ferai rien contre la volonté de Dieu dans votre cas, et si vous vous détournez (de ce que je dis), Allah vous détruira. Et je te trouve dans le même état qu'on m'a montré (dans le rêve) et voici Thabit et il te répondra en mon nom. Il (le Saint Prophète) est ensuite reparti. Ibn `Abbas a dit : J'ai demandé (le sens des) paroles de l'Apôtre d'Allah (ﷺ) : \"Vous êtes le même que ce que j'ai été fait voir à votre sujet dans mon rêve.\" et Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a dit : Pendant que je dormais, j'ai vu dans mes mains deux bracelets en or. Cela a eu un effet perturbant sur moi et on m'a suggéré pendant mon sommeil de souffler dessus, alors j'ai soufflé dessus et ils n'étaient plus. Et j'ai interprété ces (deux bracelets) comme les deux grands menteurs qui apparaîtraient après moi et l'un d'entre eux était Al-`Anasi, l'habitant de San`a' et l'autre Musailima, l'habitant de Yamama."
    },
    {
        "hadithnumber": 5968,
        "text": "Sahl (b. Sa'd) a rapporté : J'ai entendu l'Apôtre d'Allah (ﷺ) dire : J'irai à la Citerne avant toi et celui qui viendra boira et celui qui boit n'aura jamais soif, et des gens que je connaîtrai et qui me connaîtront viendront à moi. Ensuite, il y aurait une intervention entre moi et eux. Abu Hazim a dit que Nu'man b. Abu 'Ayyash l'a entendu et je leur ai raconté ce hadith et j'ai dit : Est-ce cela que vous avez entendu Sahl dire ? Il dit : Oui, et j'atteste que je l'ai également entendu d'Abu Sa'id Khudri, mais il a ajouté qu'il (le Saint Prophète) dirait : Ce sont mes disciples, et on lui dirait : Vous ne savez pas ce qu'ils ont fait après vous et je leur dirai : Malheur à celui qui change (de religion) après moi."
    },
    {
        "hadithnumber": 5971,
        "text": "Abdallah b. `Amr al-`As, a rapporté le Messager d'Allah (ﷺ) disant : Ma citerne (est aussi large et large qu'il faut) un mois de voyage (pour en faire le tour) en tout, et ses côtés sont égaux et son eau est plus blanche que l'argent, et son odeur est plus parfumée que celle du musc, et ses cruches (placées autour d'elle) sont comme des étoiles dans le ciel ; et celui qui en boirait n'aurait plus jamais soif après cela. Asma', fille d'Abou Bakr a dit : Le Messager d'Allah (ﷺ) a dit : Je serais sur la Citerne pour voir ceux qui viendraient de chez moi, mais certaines personnes seraient détenues (avant de m'atteindre). Je dirais : Mon Seigneur, ils sont mes disciples et appartiennent à ma Oumma, et on me dirait : Savez-vous ce qu'ils ont fait après vous ? Par Allah, ils n'ont pas fait de bien après toi et ils sont repartis sur leurs talons. Il (le narrateur) a dit : lbn Abu Mulaika avait l'habitude de dire (en supplication) : Ô Allah, je cherche refuge auprès de Toi pour que nous puissions faire demi-tour ou soumettre notre religion à toute épreuve."
    },
    {
        "hadithnumber": 5990,
        "text": "Thauban rapporte que l'Apôtre d'Allah (ﷺ) a dit : Je repousserais de ma Citerne la foule des gens. J'en chasserais (la Citerne) avec mon bâton les habitants du Yémen jusqu'à ce que l'eau (du Haud) jaillisse sur eux. On lui a demandé quelle était son ampleur. Il a dit : De cet endroit à moi jusqu'à 'Amman, et on lui a posé des questions sur la boisson et il a répondu : Elle est plus blanche que le lait et plus douce que le miel. Il y jaillirait deux ruisseaux prenant leur source au Paradis. l'un est en or et l'autre en argent. Ce hadith a été rapporté sous l'autorité de Hisham avec la même chaîne de transmetteurs et les mots sont : \"Je serais le Jour de la Résurrection près du bord de la Citerne\"."
    },
    {
        "hadithnumber": 5991,
        "text": "Thauban rapporte que l'Apôtre d'Allah (ﷺ) a dit : Je repousserais de ma Citerne la foule des gens. J'en chasserais (la Citerne) avec mon bâton les habitants du Yémen jusqu'à ce que l'eau (du Haud) jaillisse sur eux. On lui a demandé quelle était son ampleur. Il a dit : De cet endroit à moi jusqu'à 'Amman, et on lui a posé des questions sur la boisson et il a répondu : Elle est plus blanche que le lait et plus douce que le miel. Il y jaillirait deux ruisseaux prenant leur source au Paradis. l'un est en or et l'autre en argent. Ce hadith a été rapporté sous l'autorité de Hisham avec la même chaîne de transmetteurs et les mots sont : \"Je serais le Jour de la Résurrection près du bord de la Citerne\"."
    },
    {
        "hadithnumber": 6015,
        "text": "Anas a rapporté que le Messager d'Allah (ﷺ) avait le meilleur caractère parmi les gens. Un jour, il m'a envoyé faire une course et j'ai dit : Par Allah, je n'irais pas. J'avais cependant cette idée en tête que je ferais ce que l'Apôtre d'Allah (ﷺ) m'avait ordonné de faire. Je suis sorti jusqu'à ce que je rencontre des enfants qui jouaient dans la rue. Pendant ce temps, le Messager d'Allah (ﷺ) est venu là-bas et il m'a attrapé par la nuque derrière moi. Tandis que je regardais vers lui, je le trouvai souriant et il me dit : Unais, es-tu allé là où je t'ai ordonné d'aller ? J'ai dit : Messager d'Allah, oui, j'y vais. Anas a ajouté : Je l'ai servi pendant neuf ans mais je ne sais pas s'il m'a jamais dit à propos d'une chose que j'avais fait, pourquoi j'avais fait cela, ou à propos d'une chose qu'il me restait, pourquoi je ne l'avais pas fait."
    },
    {
        "hadithnumber": 6179,
        "text": "Mohammed b. Joubaïr b. Mut'im a rapporté sous l'autorité de son père qu'une femme a interrogé le Messager d'Allah (ﷺ) sur quelque chose mais lui a dit de venir le voir à une autre occasion, sur quoi elle a dit : Que pensez-vous (dois-je faire) si je viens vers vous mais ne vous trouve pas, et il semblait qu'elle voulait dire qu'il pourrait mourir. Sur ce, il dit : Si vous ne me trouvez pas, alors venez voir Abou Bakr. Ce hadith a été rapporté sous l'autorité de Jubair b. Mut'im à travers une autre chaîne d'émetteurs (et les mots sont) qu'une femme est venue voir le Messager d'Allah (ﷺ) et a discuté avec lui de quelque chose et il a donné un ordre comme nous le trouvons dans le récit mentionné ci-dessus"
    },
    {
        "hadithnumber": 6180,
        "text": "Mohammed b. Joubaïr b. Mut'im a rapporté sous l'autorité de son père qu'une femme a interrogé le Messager d'Allah (ﷺ) sur quelque chose mais lui a dit de venir le voir à une autre occasion, sur quoi elle a dit : Que pensez-vous (dois-je faire) si je viens vers vous mais ne vous trouve pas, et il semblait qu'elle voulait dire qu'il pourrait mourir. Sur ce, il dit : Si vous ne me trouvez pas, alors venez voir Abou Bakr. Ce hadith a été rapporté sous l'autorité de Jubair b. Mut'im à travers une autre chaîne d'émetteurs (et les mots sont) qu'une femme est venue voir le Messager d'Allah (ﷺ) et a discuté avec lui de quelque chose et il a donné un ordre comme nous le trouvons dans le récit mentionné ci-dessus"
    },
    {
        "hadithnumber": 6200,
        "text": "Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a dit : Pendant que je dormais, je me suis vu au paradis et une femme faisant ses ablutions à côté d'un palais. J'ai dit : à qui est-ce destiné ? Ils dirent : C'est destiné à 'Umar b. Khattab. (Le Saint Prophète) a dit : Le sentiment d'Umar m'est venu à l'esprit et je me suis donc retourné et je suis parti. Abu Huraira a dit : « Umar a pleuré alors que nous étions présents à cette réunion avec le Messager d'Allah (ﷺ) parmi nous et Umar a dit : Messager d'Allah, que mon père et ma mère soient pris en rançon pour vous. Puis-je ressentir de la jalousie à ton égard ? Ce hadith a été rapporté sous l'autorité d'Ibn Shihab avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 6201,
        "text": "Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a dit : Pendant que je dormais, je me suis vu au paradis et une femme faisant ses ablutions à côté d'un palais. J'ai dit : à qui est-ce destiné ? Ils dirent : C'est destiné à 'Umar b. Khattab. (Le Saint Prophète) a dit : Le sentiment d'Umar m'est venu à l'esprit et je me suis donc retourné et je suis parti. Abu Huraira a dit : « Umar a pleuré alors que nous étions présents à cette réunion avec le Messager d'Allah (ﷺ) parmi nous et Umar a dit : Messager d'Allah, que mon père et ma mère soient pris en rançon pour vous. Puis-je ressentir de la jalousie à ton égard ? Ce hadith a été rapporté sous l'autorité d'Ibn Shihab avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 6410,
        "text": "Abu Musa a rapporté : Nous étions au Yémen lorsque nous avons entendu parler de la migration du Messager d'Allah (ﷺ). Nous sommes également partis comme immigrants vers lui. Et j'étais accompagné de deux de mes frères, j'étais le plus jeune d'entre eux ; l’un d’eux était Abu Burda et l’autre Abu Ruhm, et il y avait d’autres personnes avec eux. Certains disent qu'ils étaient cinquante-trois ou cinquante-deux personnes de ma tribu. Nous embarquâmes sur un bateau, et le bateau partit vers le Négus d'Abyssinie. Là, nous avons rencontré Ja'far b. Abu Talib et ses compagnons. Ja'far a dit : Le Messager d'Allall (ﷺ) nous a envoyés ici et nous a ordonné de rester ici et vous devriez également rester avec nous. Nous sommes donc restés avec lui et nous sommes revenus (à Médine) et avons rencontré le Messager d'Allah (ﷺ) lorsque Khaibar a été conquis. Il (le Saint Prophète) nous a attribué une part et, dans le cours ordinaire, il n'a pas attribué la part à celui qui avait été absent lors de la conquête de Khaibar mais a conféré (une part) à celui seulement qui y avait été présent avec lui. Il a cependant fait une exception pour les gens du bateau, à savoir. pour Ja'far et ses compagnons. Il leur a attribué une part, et certaines personnes parmi le peuple nous ont dit : à savoir. les gens du bateau : Nous vous avons précédés dans la migration. Asma' bint 'Umais qui avait émigré en Abyssinie et était revenue avec eux (avec des immigrants) a rendu visite à Hafsa, l'épouse de l'Apôtre d'Allah (ﷺ). (En conséquence), Umar était assis avec elle (Hafsa). Lorsque 'Umar vit Asma, il dit : Qui est-elle ? Elle (Hafsa) a dit : Elle est Asma, fille de 'Umais. Il dit : C'est une Abyssinienne et une femme de mer. Asma a dit : Oui, c'est vrai. Sur ce, 'Umar dit : Nous vous avons précédé dans la migration et nous avons donc plus de droits envers le Messager d'Allah (ﷺ) que vous. À cela, elle se sentit ennuyée et dit : 'Umar, tu ne déclares pas le fait ; par Allah, vous avez eu le privilège d'être en compagnie du Messager (ﷺ) qui a nourri les affamés parmi vous et instruit les ignorants parmi vous, alors que nous étions loin (d'ici) dans le pays d'Abyssinie parmi les ennemis et tout cela était pour Allah et le Messager d'Allah (ﷺ) et, par Allah, je ne prendrais jamais de nourriture ni d'eau à moins de faire mention au Messager d'Allah (ﷺ) de ce que vous avez dit. Nous sommes restés dans ce pays dans une détresse et une peur constantes et j'en parlerai au Messager d'Allah (que la paix soit sur lui) et lui poserai des questions. Par Allah, je ne mentirai pas, je ne m'écarterai pas (de la vérité) et j'ajouterai quoi que ce soit à cela. Ainsi, lorsque l'Apôtre d'Allah (ﷺ) est venu, elle a dit : L'Apôtre d'Allah, 'Umar dit ceci et cela. Sur ce, le Messager d'Allah (ﷺ) a dit : Son droit n'est pas supérieur au vôtre, pour lui et ses compagnons il n'y a qu'une seule migration, mais pour vous, je. e. pour les gens du bateau, il y a deux migrations. Elle a dit : J'ai vu Abu Musa et les gens du bateau venir vers moi en groupe et m'interroger sur ce hadith, car il n'y avait rien de plus agréable et de plus significatif pour eux que cela. Abu Burda a rapporté qu'Asma a dit : J'ai vu Abu Musa, me demandant de lui répéter ce hadith encore et encore."
    },
    {
        "hadithnumber": 6414,
        "text": "Zaïd b. Arqam a rapporté que le Messager d'Allah (ﷺ) a dit : Ô Allah, accorde le pardon aux Ansar, à la progéniture des Ansar et à la progéniture de la progéniture des Ansar. Ce hadith a été rapporté sous l'autorité de Shulba avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 6415,
        "text": "Zaïd b. Arqam a rapporté que le Messager d'Allah (ﷺ) a dit : Ô Allah, accorde le pardon aux Ansar, à la progéniture des Ansar et à la progéniture de la progéniture des Ansar. Ce hadith a été rapporté sous l'autorité de Shulba avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 6451,
        "text": "vide"
    },
    {
        "hadithnumber": 6505,
        "text": "Ce hadith a été rapporté sous l'autorité de Habib avec les différentes chaînes d'émetteurs"
    },
    {
        "hadithnumber": 6506,
        "text": "Ce hadith a été rapporté sous l'autorité de Habib avec les différentes chaînes d'émetteurs"
    },
    {
        "hadithnumber": 6544,
        "text": "Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a dit : Les portes du Paradis ne sont ouvertes que deux jours, lundi et jeudi. Et alors, tout serviteur (d'Allah) est pardonné s'il n'associe rien à Allah, sauf celui dans le cœur duquel il y a de la rancune contre son frère. Et on dirait : Regardez vers eux deux jusqu'à ce qu'il y ait réconciliation ; regardez vers eux deux jusqu’à ce qu’il y ait réconciliation ; regardez vers eux deux jusqu’à ce qu’il y ait une réconciliation. Ce hadith a été rapporté sous l'autorité de Suhail qui l'a raconté sous l'autorité de son père avec la chaîne d'émetteurs de MaIik, mais avec cette variation de formulation : (Ceux qui ne seraient pas pardonnés) qui se contournent les uns les autres."
    },
    {
        "hadithnumber": 6545,
        "text": "Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a dit : Les portes du Paradis ne sont ouvertes que deux jours, lundi et jeudi. Et alors, tout serviteur (d'Allah) est pardonné s'il n'associe rien à Allah, sauf celui dans le cœur duquel il y a de la rancune contre son frère. Et on dirait : Regardez vers eux deux jusqu'à ce qu'il y ait réconciliation ; regardez vers eux deux jusqu’à ce qu’il y ait réconciliation ; regardez vers eux deux jusqu’à ce qu’il y ait une réconciliation. Ce hadith a été rapporté sous l'autorité de Suhail qui l'a raconté sous l'autorité de son père avec la chaîne d'émetteurs de MaIik, mais avec cette variation de formulation : (Ceux qui ne seraient pas pardonnés) qui se contournent les uns les autres."
    },
    {
        "hadithnumber": 6625,
        "text": "Jabir b. Abdullah a rapporté que le Messager d'Allah (ﷺ) a dit : Je suis un être humain et j'ai fait ce terme avec mon Seigneur, l'Exalté et le Glorieux : Pour tout serviteur parmi les musulmans que je maudis ou gronde, fais-en une source de pureté et de récompense. Ce hadith a été rapporté sous l'autorité d'Ibn Juraij avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 6626,
        "text": "Jabir b. Abdullah a rapporté que le Messager d'Allah (ﷺ) a dit : Je suis un être humain et j'ai fait ce terme avec mon Seigneur, l'Exalté et le Glorieux : Pour tout serviteur parmi les musulmans que je maudis ou gronde, fais-en une source de pureté et de récompense. Ce hadith a été rapporté sous l'autorité d'Ibn Juraij avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 6711,
        "text": "Anas a rapporté qu'une personne a dit au Messager d'Allah (ﷺ) : Quand serait la Dernière Heure ? Il (le Saint Prophète) dit : Quelle préparation avez-vous faite pour cela ? Et il ne donna aucun détail, mais dit : J'aime Allah et Son Messager. Sur ce, il (le Saint Prophète) dit : Vous seriez avec celui que vous aimez. Anas b. Malik a rapporté via une autre chaîne de transmetteurs qu'un Arabe du désert est venu voir le Messager d'Allah (que la paix soit sur lui), le reste du hadith est le même mais avec cette variation qu'il a dit : Je n'ai pas fait beaucoup de préparatifs qui méritent d'être appréciés pour moi-même."
    },
    {
        "hadithnumber": 6712,
        "text": "Anas a rapporté qu'une personne a dit au Messager d'Allah (ﷺ) : Quand serait la Dernière Heure ? Il (le Saint Prophète) dit : Quelle préparation avez-vous faite pour cela ? Et il ne donna aucun détail, mais dit : J'aime Allah et Son Messager. Sur ce, il (le Saint Prophète) dit : Vous seriez avec celui que vous aimez. Anas b. Malik a rapporté via une autre chaîne de transmetteurs qu'un Arabe du désert est venu voir le Messager d'Allah (que la paix soit sur lui), le reste du hadith est le même mais avec cette variation qu'il a dit : Je n'ai pas fait beaucoup de préparatifs qui méritent d'être appréciés pour moi-même."
    },
    {
        "hadithnumber": 6855,
        "text": "(Agharr Abi Muslim a rapporté : J'atteste du fait qu'Abou Huraira et Abu Sa'id Khudri étaient présents lorsque le Messager d'Allah que la paix soit sur lui) a dit : Les gens ne s'assoient pas mais ils sont entourés d'anges et couverts par la Miséricorde, et la tranquillité descend sur eux lorsqu'ils se souviennent d'Allah, et Allah fait mention d'eux à ceux qui sont près de Lui. Ce hadith a été rapporté sous l'autorité de Shu'ba avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 6856,
        "text": "(Agharr Abi Muslim a rapporté : J'atteste du fait qu'Abou Huraira et Abu Sa'id Khudri étaient présents lorsque le Messager d'Allah que la paix soit sur lui) a dit : Les gens ne s'assoient pas mais ils sont entourés d'anges et couverts par la Miséricorde, et la tranquillité descend sur eux lorsqu'ils se souviennent d'Allah, et Allah fait mention d'eux à ceux qui sont près de Lui. Ce hadith a été rapporté sous l'autorité de Shu'ba avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 6879,
        "text": "Khaula bint Hakim Sulamiyya a rapporté : J'ai entendu le Messager d'Allah (ﷺ) dire : Lorsque l'un de vous séjourne dans un endroit, il devrait dire : « Je cherche refuge dans la Parole parfaite d'Allah contre le mal de ce qu'Il a créé. » Rien ne lui ferait alors de mal jusqu'à ce qu'il quitte cet endroit. Abu Huraira a rapporté qu'une personne est venue voir le Messager d'Allah (ﷺ) et a dit : « Messager d'Allah, j'ai été piqué par un scorpion pendant la nuit. Sur ce, il a dit : Si vous aviez récité ces paroles le soir : « Je cherche refuge dans la Parole parfaite d'Allah contre le mal de ce qu'Il a créé », cela ne vous aurait fait aucun mal."
    },
    {
        "hadithnumber": 6918,
        "text": "Abu Huraira a rapporté que Fatima est venue voir l'Apôtre d'Allah (ﷺ) et a demandé un serviteur et lui a parlé de la difficulté des travaux ménagers. Il dit : Vous ne pourriez pas obtenir de nous un serviteur. Ne puis-je pas vous diriger vers ce qui est meilleur pour vous que le serviteur ? Récitez Subhaana Allah trente-trois fois, al-Hamdu li-Allah trente-trois fois et Allah-o-Akbar trente-quatre fois en vous couchant. Ce hadith a été rapporté sous l'autorité de Suhail avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 6919,
        "text": "Abu Huraira a rapporté que Fatima est venue voir l'Apôtre d'Allah (ﷺ) et a demandé un serviteur et lui a parlé de la difficulté des travaux ménagers. Il dit : Vous ne pourriez pas obtenir de nous un serviteur. Ne puis-je pas vous diriger vers ce qui est meilleur pour vous que le serviteur ? Récitez Subhaana Allah trente-trois fois, al-Hamdu li-Allah trente-trois fois et Allah-o-Akbar trente-quatre fois en vous couchant. Ce hadith a été rapporté sous l'autorité de Suhail avec la même chaîne de transmetteurs"
    },
    {
        "hadithnumber": 6929,
        "text": "Safwan (et il s'appelait Ibn 'Abdullah b. Safwan, et il avait été marié à Umm Darda') a rapporté : J'ai visité la maison d'Abou Darda en Syrie. Je ne l'y ai pas trouvé mais Umm Darda' (était présente à la maison). Elle a dit : Avez-vous l'intention d'accomplir le Hajj cette année ? J'ai dit : Oui. Elle dit : \"Invoquez Allah pour qu'il nous bénisse, car l'Apôtre d'Allah (que la paix soit sur lui) disait : La supplication d'un musulman pour son frère derrière lui (en son absence) est exaucée tant qu'il fait une invocation pour des bénédictions pour son frère et l'Ange mandaté dit : Amen, et dit : Que ce soit pour toi aussi. Je suis allé au bazar et j'ai rencontré Abfi Dardi' et il a rapporté ainsi du Messager d'Allah. (ﷺ)"
    },
    {
        "hadithnumber": 6961,
        "text": "Anas b. Malik a rapporté que le Messager d'Allah (ﷺ) a dit : Allah est plus satisfait du repentir de Son serviteur que si l'un de vous se lève et trouve son chameau disparu dans un désert sans eau (et ensuite il le trouve accidentellement). Ce hadith a été rapporté sous l'autorité d'Anas b. Malik à travers une autre chaîne d'émetteurs"
    },
    {
        "hadithnumber": 6962,
        "text": "Anas b. Malik a rapporté que le Messager d'Allah (ﷺ) a dit : Allah est plus satisfait du repentir de Son serviteur que si l'un de vous se lève et trouve son chameau disparu dans un désert sans eau (et ensuite il le trouve accidentellement). Ce hadith a été rapporté sous l'autorité d'Anas b. Malik à travers une autre chaîne d'émetteurs"
    },
    {
        "hadithnumber": 6981,
        "text": "Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a dit qu'une personne avait commis un péché au-delà de toute mesure et qu'au moment de mourir, elle a laissé ce testament : (Quand je mourrai), brûle mon cadavre puis jette-le (les cendres) au vent et dans l'océan. Par Allah, si mon Seigneur me saisit, Il me tourmentera comme Il n'a tourmenté personne d'autre. Ils firent ce qu'il leur avait demandé. Il (le Seigneur) dit à la terre : Rendez ce que vous avez pris. Et il fut ainsi restauré à sa (forme originale). Il (Allah) lui dit : Qu'est-ce qui t'a poussé à faire cela ? Il dit : Mon Seigneur, c'était Ta crainte ou Ta crainte, et Allah lui a pardonné à cause de cela. Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a déclaré qu'une femme avait été jetée dans le feu de l'enfer à cause d'un chat qu'elle avait attaché et qu'elle ne lui avait pas fourni de nourriture. elle ne l'a pas non plus laissé libre de manger de la vermine de la terre jusqu'à ce qu'il meure émacié. Az-Zuhri a dit : (Ces deux hadiths) montrent qu'une personne ne doit ni se sentir confiante (d'entrer au Paradis) à cause de ses actes, ni perdre (tous espoirs) d'entrer au Paradis."
    },
    {
        "hadithnumber": 6989,
        "text": "Abu Musa a rapporté que le Messager d'Allah (ﷺ) a dit qu'Allah, le Très-Haut et Glorieux, tend la main pendant la nuit afin que les gens se repentent de la faute commise de l'aube au crépuscule et qu'il tend la main pendant la journée afin que les gens se repentent de la faute commise du crépuscule à l'aube. (Il accepterait le repentir) avant que le soleil ne se lève à l'ouest (avant le Jour de la Résurrection). Un hadith comme celui-ci a été rapporté sous l'autorité de Shu'ba avec la même chaîne de transmetteurs."
    },
    {
        "hadithnumber": 6990,
        "text": "Abu Musa a rapporté que le Messager d'Allah (ﷺ) a dit qu'Allah, le Très-Haut et Glorieux, tend la main pendant la nuit afin que les gens se repentent de la faute commise de l'aube au crépuscule et qu'il tend la main pendant la journée afin que les gens se repentent de la faute commise du crépuscule à l'aube. (Il accepterait le repentir) avant que le soleil ne se lève à l'ouest (avant le Jour de la Résurrection). Un hadith comme celui-ci a été rapporté sous l'autorité de Shu'ba avec la même chaîne de transmetteurs."
    },
    {
        "hadithnumber": 7017,
        "text": "Ibn Shihab reported that Allah's Messenger (ﷺ) made an expedition to Tabuk and he (the Holy Prophet) had in his mind (the idea of threatening the) Christians of Arabia in Syria and those of Rome. Ibn Shihab (further) reported that 'Abd al-Rahman b. 'Abdullah b. Ka'b informed him that Abdullah b. Ka'b who served as the guide of Ka'b b. 'Malik as he became blind that he heard Ka'b b. Malik narrate the story of his remaining behind Allah's Messenger (ﷺ) from the Battle of Tabuk. Ka'b b. Malik said:I never remained behind Allah's Messenger (ﷺ) from any expedition which he undertook except the Battle of Tabuk and that of the Battle of Badr. So far as the Battle of Badr is concerned, nobody was blamed for remaining behind as Allah's Messenger (ﷺ) and the Muslims (did not set out for attack but for waylaying) the caravan of the Quraish, but it was Allah Who made them confront their enemies without their intention (to do so). I had the honour to be with Allah's Messenger (ﷺ) on the night of 'Aqaba when we pledged our allegiance to Islam and it was more dear to me than my participation in the Battle of Badr, although Badr was more popular amongst people as compared with that (Tabuk). And this is my story of remaining back from Allah's Messenger (ﷺ) on the occasion of the Battle of Tabuk. Never did I possess means enough and (my circumstances) more favourable than at the occasion of this expedition. And, by Allah, I had never before this expedition simultaneously in my possession two rides. Allah's Messenger (ﷺ) set out for this expedition in extremely hot season; the journey was long and the land (which he and his army had to cover) was waterless and he had to confront a large army, so he informed the Muslims about the actual situation (they had to face), so that they should adequately equip themselves for this expedition, and he also told them the destination where he intended to go. And the Muslims who accompanied Allah's Messenger (ﷺ) at that time were large in numbers but there was no proper record of them. Ka'b (further) said: Few were the persons who wanted to absent themselves, and were under the impression that they could easily conceal themselves (and thus remain undetected) until revelations from Allah, the Exalted and Glorious (descended in connection with them). And Allah's Messenger (ﷺ) set out on an expedition when the fruits were ripe and their shadows had been lengthened. I had weakness for them and it was during this season that Allah's Messenger (ﷺ) made preparations and the Muslims too along with them. I also set out in the morning so that I should make preparations along with them but I came back and did nothing and said to myself: I have means enough (to make preparations) as soon as I like. And I went on doing this (postponing my preparations) until people were about to depart and it was in the morning that Allah's Messenger (ﷺ) set out and the Muslims too along with him, but I made no preparations. I went early in the morning and came back, but I made no decision. I continued to do so until they (the Muslims) hastened and covered a good deal of distance. I also made up my mind to march on and to meet them. Would that I had done that but perhaps it was not destined for me. After the departure of Allah's Messenger (ﷺ) as I went out amongst people, I was shocked to find that I did not find anyone like me but people who were labelled as hypocrites or the people whom Allah granted exemption because of their incapacity and Allah's Messenger (ﷺ) took no notice of me until he had reached Tabuk. (One day as he was sitting amongst the people in Tabuk) he said: What has happened to Ka'b b. Malik? A person from Banu' Salama said: Allah's Messenger, the (beauty) of his cloak and his appreciation of his sides have allured him and he was thus detained. Mua'dh b. Jabal said: Woe be upon that what you contend. Allah's Messenger, by Allah, we know nothing about him but good. Allah's Messenger (ﷺ), however, kept quiet. It was during that time that he (the Holy Prophet) saw a person (dressed in all white (garment) shattering the illusion of eye (mirage). Thereupon Allah's Messenger (ﷺ) said: May he be Abu Khaithama and, lo, it was Abu Khaithama al-Ansari and he was that person who contributed a sa' of dates and was scoffed at by the hypocrites. Ka'b b. Malik farther said: When this news reached me that Allah's Messenger (ﷺ) was on his way back from Tabuk I was greatly perturbed. I thought of fabricating false stories and asked myself how I would save myself from his anger on the following day. In this connection, I sought the help of every prudent man from amongst the members of my family and when it was said to me that Allah's Messenger (ﷺ) was about to arrive, all the false ideas banished (from my mind) and I came to the conclusion that nothing could save me but the telling of truth, so I decided to speak the truth and it was in the morning that Allah's Messenger (ﷺ) arrived (in Medina). And it was his habit that as he came back from a journey he first went to the mosque and observed two Rak'ahs of nafl prayer (as a mark of gratitude) and then sat amongst people. And as he did that, those who had remained behind him began to put forward their excuses and take an oath before him and they were more than eighty persons. Allah's Messenger (ﷺ) accepted their excuses on the very face of them and accepted their allegiance and sought forgiveness for them and left their secret (intentions) to Allah, until I presented myself to him. I greeted him and he smiled and there was a tinge of anger in that. He (the Holy Prophet) then said to me: Come forward. I went forward until I sat in front of him. He said to me: What kept you back? Could you not afford to go in for a ride? I said: Allah's Messenger, by Allah, if I were to sit in the presence of anybody else from amongst the worldly people I would have definitely saved myself from his anger on one pretext (or the other) and I have also the knack to fall into argumentation, but, by Allah, I am fully aware of the fact that if I were to put forward before you a false excuse to please you Allah would definitely provoke your wrath upon me, and if I speak the truth you may be annoyed with me, but I hope that Allah would make its end well and, by Allah, there is no valid excuse for me. By Allah, I never possessed so good means, and I never had such favourable conditions for me as I had when I stayed behind you (failed to join the expedition). Thereupon, Allah's Messenger (ﷺ) said: This man told the truth, so get up until Allah gives a decision in your case. I stood up and some people of Banu' Salama followed me in hot haste, and they said to me: By Allah, we do not know about you that you committed a sin prior to this. You, however, showed inability to put forward an excuse before Allah's Messenger (ﷺ) as those who stayed behind him have put forward excuses. It would have been enough for the forgiveness of your sin that Allah's Messenger (ﷺ) would have sought forgiveness for you. By Allah, they continued to incite me until I thought of going back to Allah's Messenger (ﷺ) and contradict myself. Then I said to them: Has anyone else also met the same fate? They said: Yes, two persons have met the same fate as has fallen to you and they have made the sane statement as you have made, and the same verdict has been delivered in their case as it has been delivered in your case. I said: Who are they? They said: Murara b. ar-Rabi'a 'Amiri and Hilal b. Umayya al-Waqafi. They made a mention of these two pious persons to me who had participated in the Battle of Badr and there was an example for me in them. I went away when they named these two persons. Allah's Messenger (ﷺ) forbade the Nluslims to talk with three of us from amongst those (persons) who had stayed behind him. The people began to avoid us and their attitude towards us underwent a change and it seemed as if the whole atmosphere had turned (hostile) against us and it was in fact the same atmosphere ot which I was fully aware and in which I had lived (for a fairly long time). We spent fifty nights in this very state and my two friends confined themselves withen their houses and spent (most of the) time in weeping, but as I was young and strong amongst them I got (out of my house), participated in congregational prayers, moved about in the bazar; but none spoke to me. I came to Allah's Messenger (ﷺ) as he sat amongst (people) after the prayer, greeted him and asked myself whether his lips stirred in response to my greetings (or not). Then I observed prayer beside him and looked at him with stealing glances and when I attended to my prayer, he looked at me and when I cast a glance at him he turned away his eyes from me. And when the harsh treatment of the Muslims towards me extended to a (considerable) length of time, I walked until I climbed upon the wall of the garden of Abu Qatada, and he was my cousin, and I had the greatest love for him. I greeted him but, by Allah, he did not respond to my greetings. I said to him: Abu Qatada, I adjure you by Allah, arn't you well aware of the fact that I love Allah and His Messenger (ﷺ) the most. He kept quiet. I again repeated saying: I adjure you by Allah. arn't you well aware of the fact that I love Allah and His Messenger (ﷺ) the most. He kept quiet. I again adjured him, whereupon he said: Allah and the Messenger (ﷺ) are best aware of it. My eyes began to shed tears and I came back climbing down from the wall and as I was walking in the bazar of Medina a Nabatean from amongst the Nabateans of Syria, who had come to sell foodgrains in Medina, asked people to direct him to Ka'b b. Malik. People gave him the indication by pointing towards me. He came to me and delivered to me a letter of the King of Ghassan and as I was a scribe I read that letter and it was written like this:\" Coming to my point, it has been conveyed to us that your friend (the Holy Prophet) is subjecting you to cruelty and Allah has not created you for a place where you are to be degraded and where you cannot find your right place, so you come to us that we should accord you honour. As I read that letter I said: This is also a calamity, so I burnt it in the oven. When out of the fifty days, forty days had passed and Allah's Messenger (ﷺ) received no revelation, there came the messenger of Allah's Messenger (ﷺ) to me and said: Verily, Allah's Messenger (ﷺ) has commanded you to remain separate from your wife. I said: Should I divorce her or what (else) should I do? He said: No, but only remain separate from her and don't have sexual contact with her. The same message was sent to my companions. So I said to my wife: You better go to your parents and stay there with them until Allah gives the decision in my case. The wife of Hilal b. Umayya came to Allah's Messenger (ﷺ) and said: Allah's Messenger, Hilal b. Umayya is a senile person, he has no servant. Do you disapprove of my serving him? He said: No, but don't go near him. She said: By Allah, he has no such instinct in him. By Allah, he spends his time in weeping from that day to this day. Some of the members of my family said to me: Were you to seek permission from Allah's Messenger (ﷺ) in regard to your wife as he has granted permission to the wife of Hilal b. Umayya to serve him. I said: I would not seek permission from Allah's Messenger (ﷺ), for I cannot say what Allah's Apostle may say in response to seeking my permission. Moreover, I am a young man. It was in this state that I spent ten more nights and thus fifty nights had passed that (people) had observed boycott with us. It was on the morning of the fiftieth night that I observed my dawn prayer and was sitting on one of the roofs of our houses. And I was in fact sitting in that very state which Allah, the Exalted and Glorious, has described about us in these words:\" Life had become hard for myself and the earth had compressed despite its vastness,\" that I heard the noise of an announcer from the peak of the hill of Sal' saying at the top of his voice: Ka'b b. Malik, there is glad tidings for you. I fell down in prostration and came to realise that there was (a message of) relief for me. Allah's Messenger (ﷺ) had informed the people of the acceptance of our repentance by Allah as he offered the dawn prayer. So the people went on to give us glad tidings and some of them went to my friends in order to give them the glad tidings and a person galloped his horse and came from the tribe of Aslam and his horse reached me more quickly than his voice. And when he came to me whose sound I heard, he gave me the glad tidings. I took off my clothes and clothed him with them because of his bringing good news to me and, by Allah, I possessed nothing else (in the form of clothes) than these two on that occasion, and I asked one to lend me two clothes and dressed myself in them. I came to Allah's Messenger (ﷺ) and on my way I met groups of people who greeted me because of (the acceptance of) repentance and they said: Here is a greeting for you for your repentance being accepted by Allah. (I moved on) until I came to the mosque and Allah's Messenger (ﷺ) had been sitting there amongst persons. So Talha b. 'Ubaidullah got up and rushed towards me and he shook hands with me and greeted me and, by Allah, no person stood up (to greet me) from amongst the emigrants except he. Ka'b said that he never forgot (this good gesture of) Talha. Ka'b further said: I greeted Allah's Messenger (ﷺ) with Assalam-o-'Alaikam and his face was glistening because of delight, and he said: Let there be glad tidings and blessings for you, the like of which (you have neither found nor you will find, as you find today) since your mother gave your birth. I said: Allah's Messenger. is this acceptance of repentance from you or from Allah? He said: No, (it is not from ma), it is from Allah, and it was common with Allah's Messenger (ﷺ) that as he was happy his face brightened up and it looked like a part of the moon and it was from this that we recognised it (his delight). As I sat before him, I said: Allah's Messenger, am I allowed to give in charity my wealth for Allah's sake and for the sake of His Messenger (ﷺ)? Thereupon Allah's Messenger (ﷺ) said: Keep some property with you as it is better for you. I said: I shall keep with me that part (of my property) which fell to my lot (on the occasion of the expedition of) Khaibar. I said: Allah's Messenger, verily, Allah has granted me salvation because of truth and, therefore, (I think) that repentance implies that I should not speak anything but truth as long as I live. He said: By Allah, I do not know whether anyone amongst the Muslims was put to more severe trial than I by Allah because of telling the truth. And since I made a mention of this to Allah's Messenger (ﷺ) up to this day I have not told any lie and, by Allah, I have decided not to tell a lie and I hope that Allah would save me (from trials) for the rest of my life and Allah, the Exalted and Glorious, revealed these verses:\" Certainly, Allah has turned in Mercy to the Prophet and the emigrants and the helpers who followed him in the hour of hardship after the hearts of a part of them were about to deviate; then He turned to them in mercy. Surely, to them He is Compassionate, Merciful and (He turned in Mercy) to the three who were left behind until the earth despite its vastness became strait for them and their souls were also straitened to them.\" And this revelation reached up to the (words):\" O you who believe, develop God consciousness, and be with the truthful\" (ix. 117-118). Ka'b said: By Allah, since Allah directed me to Islam there has been no blessing more significant for me than this truth of mine which I spoke to Allah's Messenger (ﷺ) and if I were to tell a lie I would have been ruined as were ruined those who told lies, for in regard to those who told lies Allah used harshest words used for anyone as He descended revelation (and the words of Allah are):\" They will swear by Allah to you when you return to them so that you may leave them alone. So leave them alone. Surely, they are unclean and their resort is Hell, recompense for what they earned. They will swear to you that you may be pleased with them but if you are pleased with them, yet surely Allah is not pleased with the transgressing people\" (ix. 95-96). K'ab said that the matter of us three persons was deferred as compared with those who took an oath in the presence of Allahs Messenger (ﷺ) and he accepted their allegiance and sought forgiveness for them and Allah did not give any decision in regard to us. It was Allah, the Exalted and Glorious, Who gave decisions in our case, three who remained behind. (The words of the Qur'an)\" the three who were left behind\" do not mean that we remained back from Jihad but these imply that He kept our matter behind them who took oath and presented excuse before Him. This hadith has been narrated on the authority of Zuhri with the same chain of transmitters"
    },
    {
        "hadithnumber": 7018,
        "text": "Ibn Shihab reported that Allah's Messenger (ﷺ) made an expedition to Tabuk and he (the Holy Prophet) had in his mind (the idea of threatening the) Christians of Arabia in Syria and those of Rome. Ibn Shihab (further) reported that 'Abd al-Rahman b. 'Abdullah b. Ka'b informed him that Abdullah b. Ka'b who served as the guide of Ka'b b. 'Malik as he became blind that he heard Ka'b b. Malik narrate the story of his remaining behind Allah's Messenger (ﷺ) from the Battle of Tabuk. Ka'b b. Malik said:I never remained behind Allah's Messenger (ﷺ) from any expedition which he undertook except the Battle of Tabuk and that of the Battle of Badr. So far as the Battle of Badr is concerned, nobody was blamed for remaining behind as Allah's Messenger (ﷺ) and the Muslims (did not set out for attack but for waylaying) the caravan of the Quraish, but it was Allah Who made them confront their enemies without their intention (to do so). I had the honour to be with Allah's Messenger (ﷺ) on the night of 'Aqaba when we pledged our allegiance to Islam and it was more dear to me than my participation in the Battle of Badr, although Badr was more popular amongst people as compared with that (Tabuk). And this is my story of remaining back from Allah's Messenger (ﷺ) on the occasion of the Battle of Tabuk. Never did I possess means enough and (my circumstances) more favourable than at the occasion of this expedition. And, by Allah, I had never before this expedition simultaneously in my possession two rides. Allah's Messenger (ﷺ) set out for this expedition in extremely hot season; the journey was long and the land (which he and his army had to cover) was waterless and he had to confront a large army, so he informed the Muslims about the actual situation (they had to face), so that they should adequately equip themselves for this expedition, and he also told them the destination where he intended to go. And the Muslims who accompanied Allah's Messenger (ﷺ) at that time were large in numbers but there was no proper record of them. Ka'b (further) said: Few were the persons who wanted to absent themselves, and were under the impression that they could easily conceal themselves (and thus remain undetected) until revelations from Allah, the Exalted and Glorious (descended in connection with them). And Allah's Messenger (ﷺ) set out on an expedition when the fruits were ripe and their shadows had been lengthened. I had weakness for them and it was during this season that Allah's Messenger (ﷺ) made preparations and the Muslims too along with them. I also set out in the morning so that I should make preparations along with them but I came back and did nothing and said to myself: I have means enough (to make preparations) as soon as I like. And I went on doing this (postponing my preparations) until people were about to depart and it was in the morning that Allah's Messenger (ﷺ) set out and the Muslims too along with him, but I made no preparations. I went early in the morning and came back, but I made no decision. I continued to do so until they (the Muslims) hastened and covered a good deal of distance. I also made up my mind to march on and to meet them. Would that I had done that but perhaps it was not destined for me. After the departure of Allah's Messenger (ﷺ) as I went out amongst people, I was shocked to find that I did not find anyone like me but people who were labelled as hypocrites or the people whom Allah granted exemption because of their incapacity and Allah's Messenger (ﷺ) took no notice of me until he had reached Tabuk. (One day as he was sitting amongst the people in Tabuk) he said: What has happened to Ka'b b. Malik? A person from Banu' Salama said: Allah's Messenger, the (beauty) of his cloak and his appreciation of his sides have allured him and he was thus detained. Mua'dh b. Jabal said: Woe be upon that what you contend. Allah's Messenger, by Allah, we know nothing about him but good. Allah's Messenger (ﷺ), however, kept quiet. It was during that time that he (the Holy Prophet) saw a person (dressed in all white (garment) shattering the illusion of eye (mirage). Thereupon Allah's Messenger (ﷺ) said: May he be Abu Khaithama and, lo, it was Abu Khaithama al-Ansari and he was that person who contributed a sa' of dates and was scoffed at by the hypocrites. Ka'b b. Malik farther said: When this news reached me that Allah's Messenger (ﷺ) was on his way back from Tabuk I was greatly perturbed. I thought of fabricating false stories and asked myself how I would save myself from his anger on the following day. In this connection, I sought the help of every prudent man from amongst the members of my family and when it was said to me that Allah's Messenger (ﷺ) was about to arrive, all the false ideas banished (from my mind) and I came to the conclusion that nothing could save me but the telling of truth, so I decided to speak the truth and it was in the morning that Allah's Messenger (ﷺ) arrived (in Medina). And it was his habit that as he came back from a journey he first went to the mosque and observed two Rak'ahs of nafl prayer (as a mark of gratitude) and then sat amongst people. And as he did that, those who had remained behind him began to put forward their excuses and take an oath before him and they were more than eighty persons. Allah's Messenger (ﷺ) accepted their excuses on the very face of them and accepted their allegiance and sought forgiveness for them and left their secret (intentions) to Allah, until I presented myself to him. I greeted him and he smiled and there was a tinge of anger in that. He (the Holy Prophet) then said to me: Come forward. I went forward until I sat in front of him. He said to me: What kept you back? Could you not afford to go in for a ride? I said: Allah's Messenger, by Allah, if I were to sit in the presence of anybody else from amongst the worldly people I would have definitely saved myself from his anger on one pretext (or the other) and I have also the knack to fall into argumentation, but, by Allah, I am fully aware of the fact that if I were to put forward before you a false excuse to please you Allah would definitely provoke your wrath upon me, and if I speak the truth you may be annoyed with me, but I hope that Allah would make its end well and, by Allah, there is no valid excuse for me. By Allah, I never possessed so good means, and I never had such favourable conditions for me as I had when I stayed behind you (failed to join the expedition). Thereupon, Allah's Messenger (ﷺ) said: This man told the truth, so get up until Allah gives a decision in your case. I stood up and some people of Banu' Salama followed me in hot haste, and they said to me: By Allah, we do not know about you that you committed a sin prior to this. You, however, showed inability to put forward an excuse before Allah's Messenger (ﷺ) as those who stayed behind him have put forward excuses. It would have been enough for the forgiveness of your sin that Allah's Messenger (ﷺ) would have sought forgiveness for you. By Allah, they continued to incite me until I thought of going back to Allah's Messenger (ﷺ) and contradict myself. Then I said to them: Has anyone else also met the same fate? They said: Yes, two persons have met the same fate as has fallen to you and they have made the sane statement as you have made, and the same verdict has been delivered in their case as it has been delivered in your case. I said: Who are they? They said: Murara b. ar-Rabi'a 'Amiri and Hilal b. Umayya al-Waqafi. They made a mention of these two pious persons to me who had participated in the Battle of Badr and there was an example for me in them. I went away when they named these two persons. Allah's Messenger (ﷺ) forbade the Nluslims to talk with three of us from amongst those (persons) who had stayed behind him. The people began to avoid us and their attitude towards us underwent a change and it seemed as if the whole atmosphere had turned (hostile) against us and it was in fact the same atmosphere ot which I was fully aware and in which I had lived (for a fairly long time). We spent fifty nights in this very state and my two friends confined themselves withen their houses and spent (most of the) time in weeping, but as I was young and strong amongst them I got (out of my house), participated in congregational prayers, moved about in the bazar; but none spoke to me. I came to Allah's Messenger (ﷺ) as he sat amongst (people) after the prayer, greeted him and asked myself whether his lips stirred in response to my greetings (or not). Then I observed prayer beside him and looked at him with stealing glances and when I attended to my prayer, he looked at me and when I cast a glance at him he turned away his eyes from me. And when the harsh treatment of the Muslims towards me extended to a (considerable) length of time, I walked until I climbed upon the wall of the garden of Abu Qatada, and he was my cousin, and I had the greatest love for him. I greeted him but, by Allah, he did not respond to my greetings. I said to him: Abu Qatada, I adjure you by Allah, arn't you well aware of the fact that I love Allah and His Messenger (ﷺ) the most. He kept quiet. I again repeated saying: I adjure you by Allah. arn't you well aware of the fact that I love Allah and His Messenger (ﷺ) the most. He kept quiet. I again adjured him, whereupon he said: Allah and the Messenger (ﷺ) are best aware of it. My eyes began to shed tears and I came back climbing down from the wall and as I was walking in the bazar of Medina a Nabatean from amongst the Nabateans of Syria, who had come to sell foodgrains in Medina, asked people to direct him to Ka'b b. Malik. People gave him the indication by pointing towards me. He came to me and delivered to me a letter of the King of Ghassan and as I was a scribe I read that letter and it was written like this:\" Coming to my point, it has been conveyed to us that your friend (the Holy Prophet) is subjecting you to cruelty and Allah has not created you for a place where you are to be degraded and where you cannot find your right place, so you come to us that we should accord you honour. As I read that letter I said: This is also a calamity, so I burnt it in the oven. When out of the fifty days, forty days had passed and Allah's Messenger (ﷺ) received no revelation, there came the messenger of Allah's Messenger (ﷺ) to me and said: Verily, Allah's Messenger (ﷺ) has commanded you to remain separate from your wife. I said: Should I divorce her or what (else) should I do? He said: No, but only remain separate from her and don't have sexual contact with her. The same message was sent to my companions. So I said to my wife: You better go to your parents and stay there with them until Allah gives the decision in my case. The wife of Hilal b. Umayya came to Allah's Messenger (ﷺ) and said: Allah's Messenger, Hilal b. Umayya is a senile person, he has no servant. Do you disapprove of my serving him? He said: No, but don't go near him. She said: By Allah, he has no such instinct in him. By Allah, he spends his time in weeping from that day to this day. Some of the members of my family said to me: Were you to seek permission from Allah's Messenger (ﷺ) in regard to your wife as he has granted permission to the wife of Hilal b. Umayya to serve him. I said: I would not seek permission from Allah's Messenger (ﷺ), for I cannot say what Allah's Apostle may say in response to seeking my permission. Moreover, I am a young man. It was in this state that I spent ten more nights and thus fifty nights had passed that (people) had observed boycott with us. It was on the morning of the fiftieth night that I observed my dawn prayer and was sitting on one of the roofs of our houses. And I was in fact sitting in that very state which Allah, the Exalted and Glorious, has described about us in these words:\" Life had become hard for myself and the earth had compressed despite its vastness,\" that I heard the noise of an announcer from the peak of the hill of Sal' saying at the top of his voice: Ka'b b. Malik, there is glad tidings for you. I fell down in prostration and came to realise that there was (a message of) relief for me. Allah's Messenger (ﷺ) had informed the people of the acceptance of our repentance by Allah as he offered the dawn prayer. So the people went on to give us glad tidings and some of them went to my friends in order to give them the glad tidings and a person galloped his horse and came from the tribe of Aslam and his horse reached me more quickly than his voice. And when he came to me whose sound I heard, he gave me the glad tidings. I took off my clothes and clothed him with them because of his bringing good news to me and, by Allah, I possessed nothing else (in the form of clothes) than these two on that occasion, and I asked one to lend me two clothes and dressed myself in them. I came to Allah's Messenger (ﷺ) and on my way I met groups of people who greeted me because of (the acceptance of) repentance and they said: Here is a greeting for you for your repentance being accepted by Allah. (I moved on) until I came to the mosque and Allah's Messenger (ﷺ) had been sitting there amongst persons. So Talha b. 'Ubaidullah got up and rushed towards me and he shook hands with me and greeted me and, by Allah, no person stood up (to greet me) from amongst the emigrants except he. Ka'b said that he never forgot (this good gesture of) Talha. Ka'b further said: I greeted Allah's Messenger (ﷺ) with Assalam-o-'Alaikam and his face was glistening because of delight, and he said: Let there be glad tidings and blessings for you, the like of which (you have neither found nor you will find, as you find today) since your mother gave your birth. I said: Allah's Messenger. is this acceptance of repentance from you or from Allah? He said: No, (it is not from ma), it is from Allah, and it was common with Allah's Messenger (ﷺ) that as he was happy his face brightened up and it looked like a part of the moon and it was from this that we recognised it (his delight). As I sat before him, I said: Allah's Messenger, am I allowed to give in charity my wealth for Allah's sake and for the sake of His Messenger (ﷺ)? Thereupon Allah's Messenger (ﷺ) said: Keep some property with you as it is better for you. I said: I shall keep with me that part (of my property) which fell to my lot (on the occasion of the expedition of) Khaibar. I said: Allah's Messenger, verily, Allah has granted me salvation because of truth and, therefore, (I think) that repentance implies that I should not speak anything but truth as long as I live. He said: By Allah, I do not know whether anyone amongst the Muslims was put to more severe trial than I by Allah because of telling the truth. And since I made a mention of this to Allah's Messenger (ﷺ) up to this day I have not told any lie and, by Allah, I have decided not to tell a lie and I hope that Allah would save me (from trials) for the rest of my life and Allah, the Exalted and Glorious, revealed these verses:\" Certainly, Allah has turned in Mercy to the Prophet and the emigrants and the helpers who followed him in the hour of hardship after the hearts of a part of them were about to deviate; then He turned to them in mercy. Surely, to them He is Compassionate, Merciful and (He turned in Mercy) to the three who were left behind until the earth despite its vastness became strait for them and their souls were also straitened to them.\" And this revelation reached up to the (words):\" O you who believe, develop God consciousness, and be with the truthful\" (ix. 117-118). Ka'b said: By Allah, since Allah directed me to Islam there has been no blessing more significant for me than this truth of mine which I spoke to Allah's Messenger (ﷺ) and if I were to tell a lie I would have been ruined as were ruined those who told lies, for in regard to those who told lies Allah used harshest words used for anyone as He descended revelation (and the words of Allah are):\" They will swear by Allah to you when you return to them so that you may leave them alone. So leave them alone. Surely, they are unclean and their resort is Hell, recompense for what they earned. They will swear to you that you may be pleased with them but if you are pleased with them, yet surely Allah is not pleased with the transgressing people\" (ix. 95-96). K'ab said that the matter of us three persons was deferred as compared with those who took an oath in the presence of Allahs Messenger (ﷺ) and he accepted their allegiance and sought forgiveness for them and Allah did not give any decision in regard to us. It was Allah, the Exalted and Glorious, Who gave decisions in our case, three who remained behind. (The words of the Qur'an)\" the three who were left behind\" do not mean that we remained back from Jihad but these imply that He kept our matter behind them who took oath and presented excuse before Him. This hadith has been narrated on the authority of Zuhri with the same chain of transmitters"
    },
    {
        "hadithnumber": 7076,
        "text": "Anas a rapporté que les habitants de La Mecque ont demandé au Messager d'Allah (ﷺ) qu'il leur montre (quelques) signes (miracles) et il a montré deux fois le fractionnement de la lune. Ce hadith a été rapporté sous l'autorité d'Anas à travers une autre chaîne de transmetteurs."
    },
    {
        "hadithnumber": 7077,
        "text": "Anas a rapporté que les habitants de La Mecque ont demandé au Messager d'Allah (ﷺ) qu'il leur montre (quelques) signes (miracles) et il a montré deux fois le fractionnement de la lune. Ce hadith a été rapporté sous l'autorité d'Anas à travers une autre chaîne de transmetteurs."
    },
    {
        "hadithnumber": 7080,
        "text": "Abu Musa a rapporté que le Messager d'Allah (ﷺ) a dit : Personne ne fait preuve de plus de patience pour écouter les choses les plus ennuyeuses qu'Allah, l'Exalté et le Glorieux. \"Le partenariat lui est associé (le polythéisme) et (la paternité) d'un enfant lui est attribuée, mais malgré cela, il les protège (les gens) et leur assure sa subsistance.\" Ce hadith a été transmis sous l'autorité d'Abu Musa avec une légère variation de formulation"
    },
    {
        "hadithnumber": 7081,
        "text": "Abu Musa a rapporté que le Messager d'Allah (ﷺ) a dit : Personne ne fait preuve de plus de patience pour écouter les choses les plus ennuyeuses qu'Allah, l'Exalté et le Glorieux. \"Le partenariat lui est associé (le polythéisme) et (la paternité) d'un enfant lui est attribuée, mais malgré cela, il les protège (les gens) et leur assure sa subsistance.\" Ce hadith a été transmis sous l'autorité d'Abu Musa avec une légère variation de formulation"
    },
    {
        "hadithnumber": 7111,
        "text": "Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a dit : Aucun d'entre vous n'atteindra le salut uniquement grâce à ses actes. Une personne a dit : Le Messager d'Allah, même vous ? Alors il dit : Oui, même pas moi, sauf qu'Allah m'enveloppe de Miséricorde, mais vous devez agir avec modération. Ce hadith a été transmis sous l'autorité de Bukair b. al-Ashajj avec une légère variation de formulation"
    },
    {
        "hadithnumber": 7112,
        "text": "Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a dit : Aucun d'entre vous n'atteindra le salut uniquement grâce à ses actes. Une personne a dit : Le Messager d'Allah, même vous ? Alors il dit : Oui, même pas moi, sauf qu'Allah m'enveloppe de Miséricorde, mais vous devez agir avec modération. Ce hadith a été transmis sous l'autorité de Bukair b. al-Ashajj avec une légère variation de formulation"
    },
    {
        "hadithnumber": 7138,
        "text": "Sahl b. Sa'd a rapporté que le Messager d'Allah (ﷺ) a dit : Au paradis, il y a un arbre à l'ombre duquel un cavalier peut voyager pendant cent ans sans parcourir (la distance) complètement. Ce hadith a également été transmis sous l'autorité d'Abou Sa'id al-Khudri selon lequel l'Apôtre d'Allah (ﷺ) aurait dit : Au Paradis, il y a un arbre à l'ombre duquel un cavalier sur un cheval fin et au pied rapide parcourrait pendant cent ans sans parcourir complètement la distance. Il y aurait le plaisir d'Allah pour les habitants du Paradis et Il ne serait jamais ennuyé contre eux."
    },
    {
        "hadithnumber": 7141,
        "text": "Sahl b. Sa'd a rapporté que le Messager d'Allah (ﷺ) a dit : Les habitants du Paradis regarderont vers l'appartement supérieur du Paradis comme vous voyez les planètes dans le ciel. J'ai raconté ce hadith à Nu'man b. Abi 'Ayyash et il dit : J'ai entendu Abou Sa'id al-Khudri dire : Comme vous voyez les planètes brillantes à l'est et à l'ouest (côtés de) l'horizon"
    },
    {
        "hadithnumber": 7302,
        "text": "Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a dit : Par Celui qui est dans la main de qui est ma vie, le monde ne prendra fin que lorsqu'une personne passera devant une tombe, se retournera dessus et exprimera le désir d'être à la place de l'occupant de cette tombe, non pour des raisons religieuses mais à cause de cette calamité."
    },
    {
        "hadithnumber": 7319,
        "text": "Abu Sa'id et Jabir b. Abdullah a rapporté que le Messager d'Allah (ﷺ) a dit : Il y aurait dans la dernière phase du temps un calife qui distribuerait les richesses mais ne compterait pas."
    },
    {
        "hadithnumber": 7354,
        "text": "Abdallah b. Umar a rapporté : « Umar b. Khattab a accompagné le Messager d'Allah (ﷺ) en compagnie de certaines personnes vers Ibn Sayyad qu'il a trouvé en train de jouer avec des enfants près des remparts de Bani Maghala et Ibn Sayyad était à ce moment-là juste au seuil de l'adolescence et il n'a pas perçu (la présence du Saint Prophète) jusqu'à ce que le Messager d'Allah (ﷺ) lui ait frappé le dos avec ses mains. Le Messager d'Allah (ﷺ) a dit : Ibn Sayyad, ne témoignes-tu pas que je suis le messager d'Allah ? Ibn Sayyad regarda vers lui et dit : Je témoigne que tu es le messager des illettrés. Ibn Sayyad a dit au Messager d'Allah (ﷺ) : Êtes-vous témoin du fait que je suis le messager d'Allah ? Le Messager d'Allah (ﷺ) a rejeté cela et a dit : J'affirme ma foi en Allah et en Ses messagers. Alors le Messager d'Allah (ﷺ) lui dit : Que vois-tu ? Ibn Sayyad a dit : C'est un Dukh. Sur ce, le Messager d'Allah (ﷺ) dit : Puissiez-vous être déshonoré et déshonoré, vous ne pourrez pas dépasser votre rang. 'Umar b. Khattab a dit : Messager d'Allah, permets-moi de lui frapper le cou. Sur ce, le Messager d'Allah (ﷺ) a dit : S'il est le même (Dajjal) qui apparaîtrait vers la Dernière Heure, vous ne seriez pas en mesure de le maîtriser, et s'il ne l'est pas, il ne vous servira à rien de le tuer. 'Abd Allah b. 'Umar a en outre rapporté qu'après un certain temps, le Messager d'Allah (ﷺ) et Ubayy b. Ka'b se dirigea vers les palmiers où se trouvait Ibn Sayyad. Lorsque le Messager d'Allah (ﷺ) s'est approché de l'arbre, il s'est caché derrière un arbre avec l'intention d'entendre quelque chose d'Ibn Sayyad avant qu'Ibn Sayyad ne puisse le voir, mais le Messager d'Allah (ﷺ) l'a vu sur un lit avec une couverture autour de lui d'où un murmure se faisait entendre et la mère d'Ibn Sayyad a vu le Messager d'Allah (ﷺ) derrière le tronc du palmier. Elle dit à Ibn Sayyad : Saf (c'est son nom), voici Muhammad. Sur ce, Ibn Sayyad se leva d'un bond en murmurant et le Messager d'Allah (ﷺ) dit : Si elle l'avait laissé tranquille, il aurait clarifié les choses. Abdallah b. Umar a raconté que le Messager d'Allah (ﷺ) s'est levé parmi le peuple et a loué Allah comme Il le méritait, puis il a fait mention du Dajjal et a dit : Je vous préviens de lui et il n'y a aucun Prophète qui n'ait mis en garde son peuple contre le Dajjal. Même Noé a mis en garde (contre lui) mais je vais vous dire une chose qu'aucun Prophète n'a dit à son peuple. Vous devez savoir qu'il (le Dajjal) est borgne et qu'Allah, l'Exalté et le Glorieux, n'est pas borgne. Ibn Shihab a dit : 'Umar b. Thabit al-Ansari m'a informé que certains des Compagnons du Messager d'Allah (ﷺ) l'ont informé que le jour où le Messager d'Allah (ﷺ) a mis en garde les gens contre le Dajjal, il a également dit : Il y aurait écrit entre ses deux yeux (le mot) Kafir (infidèle) et tous ceux qui seraient mécontents de ses actes seraient capables de lire ou chaque musulman serait sur le point de lire, et il a également dit : Gardez cette chose à l'esprit qu'aucun d'entre vous ne pourra voir. Allah, l'Exalté et le Glorieux, jusqu'à sa mort"
    },
    {
        "hadithnumber": 7355,
        "text": "Abdallah b. Umar a rapporté : « Umar b. Khattab a accompagné le Messager d'Allah (ﷺ) en compagnie de certaines personnes vers Ibn Sayyad qu'il a trouvé en train de jouer avec des enfants près des remparts de Bani Maghala et Ibn Sayyad était à ce moment-là juste au seuil de l'adolescence et il n'a pas perçu (la présence du Saint Prophète) jusqu'à ce que le Messager d'Allah (ﷺ) lui ait frappé le dos avec ses mains. Le Messager d'Allah (ﷺ) a dit : Ibn Sayyad, ne témoignes-tu pas que je suis le messager d'Allah ? Ibn Sayyad regarda vers lui et dit : Je témoigne que tu es le messager des illettrés. Ibn Sayyad a dit au Messager d'Allah (ﷺ) : Êtes-vous témoin du fait que je suis le messager d'Allah ? Le Messager d'Allah (ﷺ) a rejeté cela et a dit : J'affirme ma foi en Allah et en Ses messagers. Alors le Messager d'Allah (ﷺ) lui dit : Que vois-tu ? Ibn Sayyad a dit : C'est un Dukh. Sur ce, le Messager d'Allah (ﷺ) dit : Puissiez-vous être déshonoré et déshonoré, vous ne pourrez pas dépasser votre rang. 'Umar b. Khattab a dit : Messager d'Allah, permets-moi de lui frapper le cou. Sur ce, le Messager d'Allah (ﷺ) a dit : S'il est le même (Dajjal) qui apparaîtrait vers la Dernière Heure, vous ne seriez pas en mesure de le maîtriser, et s'il ne l'est pas, il ne vous servira à rien de le tuer. 'Abd Allah b. 'Umar a en outre rapporté qu'après un certain temps, le Messager d'Allah (ﷺ) et Ubayy b. Ka'b se dirigea vers les palmiers où se trouvait Ibn Sayyad. Lorsque le Messager d'Allah (ﷺ) s'est approché de l'arbre, il s'est caché derrière un arbre avec l'intention d'entendre quelque chose d'Ibn Sayyad avant qu'Ibn Sayyad ne puisse le voir, mais le Messager d'Allah (ﷺ) l'a vu sur un lit avec une couverture autour de lui d'où un murmure se faisait entendre et la mère d'Ibn Sayyad a vu le Messager d'Allah (ﷺ) derrière le tronc du palmier. Elle dit à Ibn Sayyad : Saf (c'est son nom), voici Muhammad. Sur ce, Ibn Sayyad se leva d'un bond en murmurant et le Messager d'Allah (ﷺ) dit : Si elle l'avait laissé tranquille, il aurait clarifié les choses. Abdallah b. Umar a raconté que le Messager d'Allah (ﷺ) s'est levé parmi le peuple et a loué Allah comme Il le méritait, puis il a fait mention du Dajjal et a dit : Je vous préviens de lui et il n'y a aucun Prophète qui n'ait mis en garde son peuple contre le Dajjal. Même Noé a mis en garde (contre lui) mais je vais vous dire une chose qu'aucun Prophète n'a dit à son peuple. Vous devez savoir qu'il (le Dajjal) est borgne et qu'Allah, l'Exalté et le Glorieux, n'est pas borgne. Ibn Shihab a dit : 'Umar b. Thabit al-Ansari m'a informé que certains des Compagnons du Messager d'Allah (ﷺ) l'ont informé que le jour où le Messager d'Allah (ﷺ) a mis en garde les gens contre le Dajjal, il a également dit : Il y aurait écrit entre ses deux yeux (le mot) Kafir (infidèle) et tous ceux qui seraient mécontents de ses actes seraient capables de lire ou chaque musulman serait sur le point de lire, et il a également dit : Gardez cette chose à l'esprit qu'aucun d'entre vous ne pourra voir. Allah, l'Exalté et le Glorieux, jusqu'à sa mort"
    },
    {
        "hadithnumber": 7368,
        "text": "Hudhaifa a rapporté que le Messager d'Allah (ﷺ) a dit : le Dajjal aurait avec lui de l'eau et du feu et son feu aurait l'effet de l'eau froide et son eau aurait l'effet du feu, alors ne vous ruinez pas. Abu Mas'ud a rapporté : Je l'ai aussi entendu du Messager d'Allah (ﷺ)"
    },
    {
        "hadithnumber": 7498,
        "text": "Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a dit : Le croyant ne permet pas d'être piqué deux fois par un (et même) trou. Ce hadith a été rapporté sous l'autorité d'Abu Huraira à travers une autre chaîne de transmetteurs."
    },
    {
        "hadithnumber": 7499,
        "text": "Abu Huraira a rapporté que le Messager d'Allah (ﷺ) a dit : Le croyant ne permet pas d'être piqué deux fois par un (et même) trou. Ce hadith a été rapporté sous l'autorité d'Abu Huraira à travers une autre chaîne de transmetteurs."
    },
    {
        "hadithnumber": 7512,
        "text": "Ubadah b. Walid b. Samit reported:I and my father set out in search of knowledge to a tribe of the Ansar before their death (i. e. before the Companions of the Prophet left the world) and I was the first to meet Abu Yasar, a Companion of Allah's Messenger (ﷺ) and there was a young man with him who carried the record of letters with him and there was a mantle prepared by the tribe of Ma'afiri upon him. And his servant too had a Ma'afiri mantle over him. My father said to him: My uncle, I see the signs of anger or that of agony on your face. He said: Yes, such and such person, the son of so and so, of the tribe of Harami owed me a debt. I went to his family, extended salutations and said: Where is he? They said: He is not here. Then came out to me his son who was at the threshold of his youth. I said to him: Where is your father? He said: No sooner did he hear your sound than he hid himself behind my mother's bedstead. I said to him: Walk out to me, for I know where you are. He came out. I said to him: What prompted you to hide yourself from me? He said: By God, whatever I would say to you would not be a lie. By Allah, I fear that I should tell a lie to you and in case of making promise with you I should break it, as you are the Companion of Allah's Messenger (ﷺ). The fact is that I was hard up in regard to money. I said: Do you adjure by Allah? He said: I adjure by Allah. I said: Do you adjure by Allah? He said: I adjure by Allah. I said: Do you adjure by Allah? He said: I adjure by Allah. Then he brought his promissory note and he wrote off (the debt) with his hand and said: Make payment when you find yourself solvent enough to pay me back; if you are not, then there is no liability upon you. These two eyes of mine saw, and he (Abu'I-Yasar) placed his fingers upon his eyes and these two ears of mine heard and my heart retained, and he pointed towards his heart that Allah's Messenger (ﷺ) said: He who gives time to one who is financially hard up (in the payment of debt) or writes off his debt, Allah will provide him His shadow. I said to him: My uncle, if you get the cloak of your servant and you give him your two clothes, or take his two clothes of Ma'afir and give him your cloak, then there would be one dress for you and one for him. He wiped my head and said: O Allah, bless the son of my brother. O, son of my brother, these two very eyes of mine saw and these two ears of mine listened to and this heart of mine retained this, and he pointed towards the heart that Allah's Messenger (ﷺ) said: Feed them (the servants) and clothe them (the servants) what you wear, and if I give him the goods of the world, it is easy for me than this that he should take my virtues on the Day of Resurrection. We went on till we came to Jabir b. Abdullah in the mosque and he was busy in observing prayer in one cloth which he had joined at its opposite ends. I made my way through the people till I sat between him and the Qibla and I said: May Allah have mercy upon you. Do you observe prayer with one cloth on your body whereas your mantle is lying at your side? He pointed me with his hand towards my breast just like this and he separated his fingers and bent them in the shape of a bow. And (he said): I thought that a fool like you should come to me so that he should see me as I do and he should then also do like it. Allah's Messenger (ﷺ) came to us in this very mosque and he had in his hand the twig of the palm-tree and he saw mucus towards the Qibla of the mosque and he erased it with the help of the twig. He then came to us and said: Who amongst you likes that Allah should turn His face away from him? We were afraid. He then again said: Who amongst you likes that Allah should turn His face away from him? We were afraid. He again said: Who amongst you likes that Allah should turn His face away from him? We said: Allah's Messenger, none of us likes it. And he said: If one amongst you stands for prayer, Allah, the Exalted and Glorious, is before him he should not spit in front of him, or on his right side, but should spit on his left side beneath his left foot and if he is impelled to do so all of a sudden (in spite of himself) he should then spit in his cloth and fold it in some part of it. (and he further said: ) Bring some sweet-smelling thing. A young man who belonged to our tribe stood up, went and brought scent in his palm. Allah's Messenger (ﷺ) took that and applied it to the end of that twig and then touched the place where there had been mucus. Jabir said: This is why you should apply scent to your mosques. It is reported on the same authority: We set out along with Allah's Messenger (ﷺ) on an expedition of Batn Buwat. He (the Holy Prophet) was in search of al-Majdi b. 'Amr al-Juhani. (We had so meagre equipment) that five. six or seven of us had one camel to ride and so we mounted it turn by turn. Once there wan. the turn of an Ansari to ride upon the camel. He made it kneel down to ride over it (and after having. mounted it), he tried to raise it up but it hesitated. So he said. May there be curse of Allah upon you! Thereupon Allah's Messenger (ﷺ) said: Who is there to curse his camel? He said: Allah's Messenger, it' is I. Thereupon he said: Get down from the camel and let us not have in our company the cursed one. Don't curse your own selves, nor your children. nor your belongings. There is the possibility that your curse may synchronies with the time when Allah is about to confer upon you what you demand and thus your prayer may be readily responded. It is reported on the same authority: We set out on an expedition along with Allah's Messenger (ﷺ) until it was evening, and we had been near a. water reservoir of Arabia. Allah's Messenger (ﷺ) said: Who would be the person who would go ahead and set right the reservoir and drink water himself and serve us with it? Jabir said: I stood up and said: Allah's Messenger, it is I who am ready to do that. Thereupon Allah's Messenger (ﷺ) said: Who is the person to accompany Jabir? And then Jabbar b. Sakhr stood up. So we went to that well and poured in that tank a bucket or two of water and plastered it with clay and then began to fill it (with water) until it was filled to the brim. Allah's Messenger (ﷺ) was the first who appeared before us, and he said: Do you (both) permit me to drink water out of it? We said: Yea, Allah's Messenger. He led his camel to drink water and it drank. He then pulled its rein and it stretched its legs and began to urinate. He then took it aside and made it kneel down at another place and then came to the tank and performed ablution. I then got up and performed ablution like the ablution of Allah's Messenger (ﷺ), and Jabbar b. Sakhr went in order to relieve himself and Allah's Messenger (ﷺ) got up to observe prayer and there was a mantle over me. I tried to invert its ends but it was too short (to cover my body easily). It had its borders. I then inverted it (the mantle) and drew its opposite ends and then tied them at my neck. I then came and stood upon the left side of Allah's Messenger (ﷺ). He caught hold of me and made me go round behind him, until he made me stand on his right side. Then Jabbar b. Sakhr came. He performed ablution and then came and stood on the left side of Allah's Messenger (ﷺ). Then Allah's Messenger (ﷺ) caught hold of our hands together, pushed us back and made us stand behind him. Then Allah's Messenger (ﷺ) began to look upon me with darting looks, but I did not perceive that. After that I became aware of it and he pointed with the gesture of his hand that I should wrap my loin-cloth. When Allah's Messenger (ﷺ) had finished the prayer, he said: Jabir! I said: Allah's Messenger, at thy beck and call. He said: When the cloth around you is inadequate, then tie the opposite ends but when it is small, tie it over the lower body. Jabir reported: We set out on an expedition with Allah's Messenger (ﷺ) and the only means of sustenance for every person amongst us was only one date for a day and we used to chew it. And we struck the leaves with the help of our bow and ate them until the sides of our mouths were injured. It so happened one day that a person was overlooked and not given a date. We carried that person and bore witness to the fact that he had not been given that date so he was offered that and he got up and received that. Jabir reported: We set out on an expedition along with Allah's Messenger (ﷺ) until we got down at a spacious valley and Allah's Messenger (ﷺ) went to relieve himself. I followed him with a bucket full of water and Allah's Messenger (ﷺ) looked about and he found no privacy but two trees at the end of the valley and Allah's Messenger (may. peace be upon him) went to one of them and took hold of one of its twigs and said: Be thou under my control by the permission of Allah, and so it came under his control like the camel who has its nosestring in the hand of its rider, and then he came to the second tree and took hold of a twig and said: Be thou under my control with the permission of Allah, and it came under his control, and when he came in the middle of the two trees he joined together the two twigs and said: join with the permission of Allah. Jabir said: I was afraid lest Allah's Messenger (ﷺ) should be aware of my nearness and go still farther. And Muhammad b. Abbad has used the word\" faitab'd\" and I began to talk to myself. And as I saw, I suddenly found Allah's Messenger (ﷺ) before me and the two trees were separated and each one of them was standing at its place. I saw Allah's Messenger (ﷺ) standing for a short time, nodding his head towards right and left. Isma'il pointed towards the right and left with the help of his head (in order to demonstrate how the Prophet had pointed). Then he (the Holy Prophet) came to me and said: Jabir did you see my place where I was standing? I said: Allah's Messenger, yes. He then said: Then you should go to those two trees and cut a twig from each of them and go to that place with them where I was standing and stand there where I was standing and place a twig on the right and a twig on the left. Jabir said: I set out and took hold of a stone and broke it and sharpened it and then I came to those trees and cut a twig from each one of them. I then came dragging them until I stood at the place where Allah's Messenger (ﷺ) had been standing and placed a twig on the right and a twig on the left. Then I met him and said: Allah's Messenger, I have done that, but (kindly) explain to me the reason for it. Thereupon he said: I passed by two graves the occupants of which had been undergoing torment. I liked to make intercession for them so that the might be relieved of this torment y as long as these twigs remain fresh. Jabir said: We came back to the (camp of the) army and Allah's Messenger (ﷺ) said: Jabir, call people for per- forming wudu. I cried: Come and perform wudu, come and perform wudu, come and perform wudu. I said: Allah's Messenger, there is not even a drop of water in the army camp, and there. was a person who used to cool the water for Allah's Messenger (ﷺ) in the old water-skin which kept hanging by the twig. He asked me to go to such and such Ansari and ask him to see if there was any water in that skin. I went to him and cast a glance in it but did not find anything but a drop in the mouth of that water-skin and if I were to draw that, the water-skin's,. dried part would suck it up. I came to Allah's Messenger (ﷺ) and said: Allah's Messenger, I have not found anything in it but a drop of water in the mouth of the water-skin and now if I were to draw that, it would be absorbed. He said: Go and bring that to me. I brought that to him. He took hold of it -and began to utter something which I could not understand and then pressed it with his hand and gave that to me and said: Jabir, announce for the tub to be brought. So I announced that the tub of the army (be brought). It was brought accordingly and I placed it before him (the Holy Prophet). Thereupon Allah's Messenger (ﷺ) placed his hands in the tub like this: with his fingers stretched out, and then he placed his fingers at the bottom of the tub and said: Jabir, take it (that waters-skin) and pour water over me, by reciting Bismillah, and I poured water and I said: Bismillah, and found water sprouting out between the fingers of Allah's Messenger (ﷺ). Then that tub gushed forth until it was filled up and the Messenger (ﷺ) said: Jabir, make an announcement to the effect: He who needs water should take that. Jabir said: The people came and got water until they were all satiated. I said: Is there anyone left who wants to get it? And Allah's Messenger (ﷺ) then lifted up his hand from that tub and it was still full. Then the people made a complaint to Allah's Messenger (ﷺ) about hunger and he said: May Allah provide you food! We came to the bank of the ocean and the ocean was tossing and it threw out a big animal and we lit fire and cooked it and took it until we had eaten to our heart's content. Jabir said: I and such and such five persons entered Its socket and nobody could see us until we had come out, and we took hold of one of its ribs and twisted it into a sort of arch, then we called the tallest of the persons of the army and the hugest of the camels of the army and it had the big saddle over it, and it could easily pass through it without the rider having need to bend down"
    },
    {
        "hadithnumber": 7555,
        "text": "Abdallah b. Mas'ud a rapporté à propos du verset : « Ceux qu'ils invoquent cherchent eux-mêmes les moyens d'accéder à leur Seigneur », qu'il se rapportait à un groupe de personnes qui adoraient un parti parmi les djinns. Le groupe parmi les djinns a embrassé l'Islam, mais les gens ont continué à les adorer comme avant, et c'est (à cette occasion) que le verset a été révélé : « Ceux qu'ils invoquent cherchent eux-mêmes le moyen d'accéder à leur Seigneur. » Ce hadith a été rapporté sous l'autorité de Sulaiman avec la même chaîne de transmetteurs"
    }
]