[
    {
        "hadithnumber": 1559,
        "text": "Yahya m'a rapporté de Malik que Ibn Shihab et aussi Urwa ibn az-Zubayr ont dit la même chose que Said ibn al-Musayyab a dit au sujet d'une femme. Son prix du sang d'un homme est le même jusqu'à un tiers du prix du sang d'un homme. Si ce qu'elle est due dépasse un tiers du prix du sang de l'homme, elle reçoit jusqu'à la moitié du prix du sang d'un homme. Malik a dit : \"L'explication de cela est qu'elle a le prix du sang pour une blessure à la tête qui met à nu l'os et une qui brise l'os et pour ce qui est moins que la blessure au cerveau et la blessure au ventre et le semblable de cela de celles qui obligent un tiers du prix du sang ou plus. Si le montant qui lui est dû dépasse cela, son prix du sang en cela est la moitié du prix du sang d'un homme.\""
    },
    {
        "hadithnumber": 1561,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, de Abu Salama ibn Abd ar-Rahman ibn Awf, de Abu Hurayra qu'une femme de la tribu Hudhayl jeta une pierre à une femme de la même tribu, et elle fit une fausse couche. Le Messager d'Allah, paix et bénédictions sur lui, donna un jugement selon lequel un esclave ou une esclave de teint clair et d'excellence devait lui être donné."
    },
    {
        "hadithnumber": 1562,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, de Said ibn al-Musayyab que le Messager d'Allah, paix et bénédictions sur lui, donna un jugement selon lequel la compensation pour un fœtus tué dans l'utérus de sa mère était un esclave ou une esclave de teint clair et d'excellence. Celui contre qui le jugement fut donné dit : \"Pourquoi paierais-je des dommages pour ce qui n'a pas bu ou mangé ou parlé ou fait aucun cri. Le semblable de cela n'est rien.\" Le Messager d'Allah, paix et bénédictions sur lui, dit : \"Celui-ci est seulement un des frères des devins.\" Il désapprouva le discours rimé de la déclaration de l'homme."
    },
    {
        "hadithnumber": 1564,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab que Said ibn al-Musayyab avait l'habitude de dire : \"Le prix du sang complet est payable pour avoir coupé les deux lèvres, mais quand la lèvre inférieure seulement est coupée, deux tiers du prix du sang sont dus pour elle.\""
    },
    {
        "hadithnumber": 1568,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, que Said ibn al-Musayyab a dit : \"Pour chaque blessure perçante dans l'un des organes ou membres du corps, un tiers du prix du sang de ce membre est payable.\""
    },
    {
        "hadithnumber": 1569,
        "text": "Malik m'a rapporté : \"Ibn Shihab ne pensait pas et je ne pense pas non plus, qu'il y ait une manière de faire les choses généralement convenue au sujet d'une blessure perçante dans l'un des organes ou membres du corps, mais je pense qu'il y a ijtihad dans le cas. L'imam utilise l'ijtihad en cela, et il n'y a pas de manière de faire les choses généralement convenue dans notre communauté à ce sujet.\" Malik a dit : \"Ce qui est fait dans notre communauté au sujet de la blessure au cerveau et la blessure qui brise l'os, et la blessure qui met à nu l'os est qu'elles s'appliquent seulement à la tête et au visage. Quoi que ce soit de cela qui se produit dans le corps n'a que l'ijtihad en lui.\" Malik a dit : \"Je ne pense pas que la mâchoire inférieure et le nez soient partie de la tête dans leur blessure parce qu'ils sont des os séparés, et excepté pour eux la tête est un seul os.\""
    },
    {
        "hadithnumber": 1570,
        "text": "Yahya m'a rapporté de Malik, de Rabia ibn Abi Abd ar-Rahman que Abdullah ibn az-Zubayr a permis la rétorsion pour une blessure à la tête qui brisait l'os."
    },
    {
        "hadithnumber": 1572,
        "text": "Yahya m'a rapporté de Malik, de Zayd ibn Aslam, de Muslim ibn Jundub, de Aslam, le mawla de Umar ibn al-Khattab que Umar ibn al-Khattab a décidé d'un chameau pour une molaire, un chameau pour une clavicule, et un chameau pour une côte."
    },
    {
        "hadithnumber": 1574,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said que Said ibn al-Musayyab avait l'habitude de dire : \"Quand une dent est frappée et devient noire, il y a le prix du sang complet pour elle. Si elle tombe après qu'elle est devenue noire, il y a aussi le prix du sang complet pour elle.\""
    },
    {
        "hadithnumber": 1576,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa que son père rendait toutes les dents les mêmes dans le prix du sang et ne préférait aucune sorte sur d'autres. Malik a dit : \"Ce qui est fait dans notre communauté est que les dents de devant, les molaires, et les canines ont le même prix du sang. C'est parce que le Messager d'Allah, paix et bénédictions sur lui, a dit : 'La dent a cinq chameaux.' La molaire est une des dents et il n'a préféré aucune sorte sur les autres.\""
    },
    {
        "hadithnumber": 1578,
        "text": "Malik m'a rapporté qu'il avait entendu que Marwan ibn al-Hakam donna une décision au sujet d'un esclave qui était blessé que la personne qui l'avait blessé devait payer ce qu'il avait diminué de la valeur de l'esclave. Malik a dit : \"Ce qui est fait dans notre communauté est que pour la blessure à la tête d'un esclave qui met à nu l'os, il y a un vingtième de son prix. La blessure à la tête qui brise l'os est trois vingtièmes de son prix. Tant la blessure au cerveau que la blessure au ventre sont un tiers de son prix. Outre ces quatre, tous autres types de blessure qui diminuent le prix de l'esclave sont considérés après que l'esclave est mieux et bien, et on voit quelle est la valeur de l'esclave après sa blessure et quelle était sa valeur entière avant qu'il n'ait la blessure. Ensuite celui qui l'a blessé paie la différence entre les deux valeurs.\""
    },
    {
        "hadithnumber": 1580,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said que Sulayman ibn Yasar a dit : \"Le prix du sang d'un mage est huit cents dirhams.\" Malik a dit : \"C'est ce qui est fait dans notre communauté.\" Malik a dit : \"Les prix du sang du juif, chrétien, et mage dans leurs blessures, sont selon la blessure des musulmans dans leurs prix du sang. La blessure à la tête est un vingtième de son prix du sang complet. La blessure qui ouvre la tête est un tiers de son prix du sang. La blessure au ventre est un tiers de son prix du sang. Toutes leurs blessures sont selon ce calcul.\""
    },
    {
        "hadithnumber": 1581,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa que son père a dit : \"La tribu n'est pas obligée de payer le prix du sang pour le meurtre intentionnel. Ils paient le prix du sang pour le meurtre accidentel.\""
    },
    {
        "hadithnumber": 1582,
        "text": "Yahya m'a rapporté de Malik que Ibn Shihab a dit : \"Le précédent de la sunna est que la tribu n'est responsable d'aucun prix du sang d'un meurtre intentionnel à moins qu'ils ne le souhaitent.\" Yahya m'a rapporté de Malik, de Yahya ibn Said la même chose que cela."
    },
    {
        "hadithnumber": 1587,
        "text": "Malik a dit qu'il avait entendu que Said ibn al-Musayyab et Sulayman ibn Yasar furent interrogés : \"Traite-t-on plus durement en prenant le prix du sang dans le mois sacré ?\" Ils dirent : \"Non. Mais il est augmenté en lui à cause de la violation du mois.\" Il fut dit à Said : \"Augmente-t-on pour la blessure comme on augmente pour la vie ?\" Il dit : \"Oui.\" Malik ajouta : \"Je pense qu'ils voulaient dire la même chose que ce que Umar ibn al-Khattab fit par rapport au prix du sang du Mudliji quand il frappa son fils.\" (c'est-à-dire en donnant 120 chameaux au lieu de 100)."
    }
]