[
    {
        "hadithnumber": 602,
        "text": "Yahya a dit que Malik a dit : \"Notre position concernant un homme qui doit payer la zakat sur cent chameaux, mais que le collecteur de zakat ne vient pas à lui avant que la zakat ne soit due pour une deuxième fois, et qu'à ce moment-là tous ses chameaux sont morts sauf cinq, est que le collecteur de zakat évalue sur les cinq chameaux les deux montants de zakat qui sont dus par le propriétaire des animaux, ce qui dans ce cas n'est que deux moutons, un pour chaque année. C'est parce que la seule zakat qu'un propriétaire de bétail doit payer est ce qui est dû par lui le jour où la zakat est (réellement) évaluée. Son bétail peut être mort ou avoir augmenté, et le collecteur de zakat n'évalue la zakat que sur ce qu'il trouve (réellement) le jour où il fait l'évaluation. Si plus d'un paiement de zakat est dû par le propriétaire du bétail, il ne doit quand même payer la zakat que selon ce que le collecteur de zakat trouve (réellement) en sa possession, et si son bétail est mort, ou si plusieurs paiements de zakat sont dus par lui et que rien n'est pris jusqu'à ce que tout son bétail soit mort, ou ait été réduit à un montant inférieur à celui sur lequel il doit payer la zakat, alors il n'a pas à payer de zakat, et il n'y a pas de responsabilité (sur lui) pour ce qui est mort ou pour les années qui ont passé.\" Yahya m'a rapporté de Malik, de Yahya ibn Said, de Muhammad ibn Yahya ibn Habban, de al-Qasim ibn Muhammad, que A'isha, l'épouse du Prophète, paix et bénédictions sur lui, a dit : \"Des moutons de la zakat furent passés devant Umar ibn al-Khattab et il vit parmi eux une brebis avec un gros pis, prête à donner du lait, et il dit : 'Que fait cette brebis ici ?' et ils répondirent : 'C'est l'une des brebis de la zakat.' Umar dit : 'Les propriétaires n'ont pas donné cette brebis volontiers. Ne soumettez pas les gens à des épreuves. Ne prenez pas aux musulmans ceux de leurs animaux qui sont les meilleurs producteurs de nourriture.'\""
    },
    {
        "hadithnumber": 624,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Abdullah ibn Umar, que Umar ibn al-Khattab donna un cheval pour porter quelqu'un dans le sentier d'Allah, et ensuite il voulut le racheter. Alors il interrogea le Messager d'Allah, paix et bénédictions sur lui, à ce sujet, et il dit : \"N'achète pas et ne reprends pas ta sadaqa.\""
    },
    {
        "hadithnumber": 625,
        "text": "Yahya a dit que l'on demanda à Malik si un homme qui avait donné quelque sadaqa, et qui la trouvait ensuite offerte à la vente par quelqu'un d'autre que l'homme à qui il l'avait donnée, pouvait l'acheter ou non, et il dit : \"Je préfère qu'il la laisse.\" Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar avait l'habitude de payer la zakat al-fitr pour ses esclaves qui étaient à Wadi'l-Qura et Khaybar. Yahya m'a rapporté que Malik a dit : \"Le meilleur de ce que j'ai entendu au sujet de la zakat al-fitr est qu'un homme doit payer pour chaque personne dont il est responsable de l'entretien et qu'il doit entretenir. Il doit payer pour tous ses mukatabs (esclaves sous contrat d'affranchissement), ses mudabbars (esclaves affranchis à la mort du maître), et ses esclaves ordinaires, qu'ils soient présents ou absents, tant qu'ils sont musulmans, et qu'ils soient ou non pour le commerce. Cependant, il n'a pas à payer la zakat sur aucun d'eux qui n'est pas musulman.\" Malik a dit, concernant un esclave en fuite : \"Je pense que son maître devrait payer la zakat pour lui, qu'il sache ou non où il se trouve, s'il n'y a pas longtemps que l'esclave s'est enfui et que son maître espère qu'il est encore en vie et reviendra. S'il y a longtemps qu'il s'est enfui et que son maître a désespéré de son retour, alors je ne pense pas qu'il doive payer la zakat pour lui.\" Malik a dit : \"La zakat al-fitr doit être payée par les gens vivant dans le désert (c'est-à-dire les nomades) tout comme elle doit être payée par les gens vivant dans les villages (c'est-à-dire les sédentaires), parce que le Messager d'Allah, paix et bénédictions sur lui, a rendu la zakat al-fitr à la fin du Ramadan obligatoire pour chaque musulman, homme libre ou esclave, mâle ou femelle.\""
    },
    {
        "hadithnumber": 628,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar payait toujours la zakat al-fitr en dattes, sauf une fois, où il la paya en orge."
    },
    {
        "hadithnumber": 629,
        "text": "Malik a dit : \"Le paiement de tous les types de kaffara (expiation), de la zakat al-fitr et de la zakat sur les grains pour lesquels un dixième ou un vingtième est dû, se fait en utilisant le plus petit mudd, qui est le mudd du Prophète, paix et bénédictions sur lui, sauf dans le cas du divorce par dhihar, où la kaffara est payée en utilisant le mudd de Hisham, qui est le plus grand mudd.\" Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar avait l'habitude d'envoyer la zakat al-fitr à celui chez qui elle était rassemblée deux ou trois jours avant le jour de la rupture du jeûne."
    },
    {
        "hadithnumber": 630,
        "text": "Yahya m'a rapporté que Malik avait vu que les gens de science aimaient payer la zakat al-fitr après l'aube le jour du Fitr avant d'aller au lieu de prière. Malik a dit : \"Il y a de la latitude en cela, si Allah le veut, en ce qu'elle peut être payée soit avant de partir (pour la prière) le jour du Fitr, soit après.\" Yahya m'a rapporté que Malik a dit : \"Un homme n'a pas à payer la zakat pour les esclaves de ses esclaves, ou pour quelqu'un employé par lui, ou pour les esclaves de sa femme, sauf pour quiconque le sert et dont les services lui sont indispensables, auquel cas il doit payer la zakat. Il n'a pas à payer la zakat pour aucun de ses esclaves qui sont kafir (mécréants) et ne sont pas devenus musulmans, qu'ils soient pour le commerce ou autre.\" Yahya m'a rapporté de Malik, de Nafi, de Abdullah ibn Umar, que le Messager d'Allah, paix et bénédictions sur lui, a mentionné une fois le Ramadan et a dit : \"Ne commencez pas le jeûne avant de voir la nouvelle lune, et ne rompez pas le jeûne (à la fin du Ramadan) avant de la voir. Si la nouvelle lune vous est cachée, alors estimez-la (quand elle devrait être).\""
    },
    {
        "hadithnumber": 635,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que A'isha et Hafsa, les épouses du Prophète, paix et bénédictions sur lui, ont aussi dit cela."
    },
    {
        "hadithnumber": 646,
        "text": "Yahya m'a rapporté de Malik, de Abu'n-Nadr, le mawla de Umar ibn Ubaydullah, que A'isha bint Talha lui a dit qu'elle était une fois avec A'isha, l'épouse du Prophète, paix et bénédictions sur lui, et son mari, qui jeûnait, vint la visiter là-bas. (C'était Abdullah ibn Abd ar-Rahman ibn Abi Bakr as-Siddiq.) A'isha lui dit : \"Qu'est-ce qui t'empêche de t'approcher de ta femme et de l'embrasser et de plaisanter avec elle ?\" Il dit : \"Puis-je l'embrasser alors que je jeûne ?\" Elle dit : \"Oui.\""
    },
    {
        "hadithnumber": 647,
        "text": "Yahya m'a rapporté de Malik, de Zayd ibn Aslam, que Abu Hurayra et Sad ibn Abi Waqqas disaient que quelqu'un qui jeûnait avait la permission d'embrasser."
    },
    {
        "hadithnumber": 649,
        "text": "Yahya a dit que Malik a dit que Hisham ibn Urwa ibn az-Zubayr avait dit : \"Je ne pense pas qu'embrasser invite au bien pour les gens qui jeûnent.\""
    },
    {
        "hadithnumber": 651,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar interdisait d'embrasser et de caresser pour les gens qui jeûnaient."
    },
    {
        "hadithnumber": 658,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Umar ibn al-Khattab, s'il voyageait pendant le Ramadan et savait qu'il atteindrait Médine au début de la journée, le faisait en jeûnant. Yahya a dit que Malik a dit : \"Quelqu'un qui voyage et sait qu'il atteindra ses gens dans la première partie de la journée, et que l'aube se lève avant qu'il n'y arrive, doit être à jeûn quand il y arrive.\" Malik a dit : \"Quelqu'un qui a l'intention de partir (en voyage) pendant le Ramadan, et que l'aube se lève alors qu'il est encore sur sa terre avant d'être parti, doit jeûner ce jour-là.\" Malik a dit qu'un homme qui revient d'un voyage pendant le Ramadan et ne jeûne pas peut avoir des rapports sexuels avec sa femme s'il le souhaite, si elle ne jeûne pas et qu'elle vient de devenir pure après ses règles."
    },
    {
        "hadithnumber": 661,
        "text": "Malik a dit : \"J'ai entendu des gens de science dire que la kaffara spécifiée par le Messager d'Allah, paix et bénédictions sur lui, pour un homme qui a des rapports avec sa femme pendant la journée du Ramadan n'est pas due par quelqu'un qui, un jour où il rattrape le jeûne du Ramadan, rompt son jeûne en ayant des rapports avec sa femme, ou autre. Il n'a qu'à rattraper ce jour-là.\" Malik a dit : \"C'est ce que j'aime le plus de ce que j'ai entendu à ce sujet.\" Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar se faisait faire une saignée (hijama) alors qu'il jeûnait. Nafi a dit : \"Il a cessé de faire cela plus tard, et ne se faisait pas faire de saignée quand il jeûnait jusqu'à ce qu'il ait rompu le jeûne.\""
    },
    {
        "hadithnumber": 663,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, que son père se faisait faire une saignée alors qu'il jeûnait et il ne rompait pas son jeûne pour autant. Hisham ajouta : \"Je ne l'ai vu se faire faire une saignée que lorsqu'il jeûnait.\" Malik a dit : \"La saignée n'est désapprouvée pour quelqu'un qui jeûne que par crainte qu'il ne s'affaiblisse et sans cela, elle ne serait pas désapprouvée. Je ne pense pas qu'un homme qui se fait faire une saignée pendant le Ramadan et ne rompt pas son jeûne doive quoi que ce soit, et je ne dis pas qu'il doive rattraper le jour où il s'est fait faire une saignée, parce que la saignée n'est désapprouvée pour quelqu'un qui jeûne que si son jeûne est mis en danger. Je ne pense pas que quelqu'un qui se fait faire une saignée, et qui est ensuite assez bien pour garder le jeûne jusqu'au soir, doive quoi que ce soit, ni qu'il doive rattraper ce jour-là.\""
    },
    {
        "hadithnumber": 669,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Abdullah ibn Umar, que le Messager d'Allah, paix et bénédictions sur lui, a interdit de jeûner deux jours ou plus sans rompre le jeûne entre les deux (Wisal). Ils dirent : \"Mais Messager d'Allah, tu pratiques le wisal.\" Il répondit : \"Je ne suis pas comme vous. Je suis nourri et abreuvé.\""
    },
    {
        "hadithnumber": 670,
        "text": "Yahya m'a rapporté de Malik, de Abu'z-Zinad, de al-Araj, de Abu Hurayra, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Méfiez-vous du wisal. Méfiez-vous du wisal.\" Ils dirent : \"Mais tu pratiques le wisal, Messager d'Allah.\" Il répondit : \"Je ne suis pas comme vous. Mon Seigneur me nourrit et m'abreuve.\""
    },
    {
        "hadithnumber": 673,
        "text": "Traduction du hadith non disponible"
    },
    {
        "hadithnumber": 675,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar disait : \"Quelqu'un qui rompt le jeûne pendant le Ramadan parce qu'il est malade ou en voyage doit rattraper les jours qu'il a manqués consécutivement.\""
    },
    {
        "hadithnumber": 676,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que Abdullah ibn Abbas et Abu Hurayra différaient sur le fait de rattraper les jours manqués pendant le Ramadan. L'un d'eux disait qu'ils étaient faits séparément et l'autre disait qu'ils étaient faits consécutivement. Il ne savait pas lequel d'entre eux c'était qui disait qu'ils étaient faits séparément."
    },
    {
        "hadithnumber": 677,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar disait : \"Si quelqu'un se fait vomir alors qu'il jeûne, il doit rattraper un jour, mais s'il ne peut s'empêcher de vomir, il n'a rien à rattraper.\""
    },
    {
        "hadithnumber": 678,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, qu'il a entendu Said ibn al-Musayyab être interrogé sur le fait de rattraper les jours manqués pendant le Ramadan, et Said a dit : \"Ce que j'aime le mieux, c'est que les jours manqués pendant le Ramadan soient rattrapés consécutivement, et non séparément.\" Yahya a dit qu'il avait entendu Malik dire, au sujet de quelqu'un qui rattrapait les jours qu'il avait manqués pendant le Ramadan séparément, qu'il n'avait pas à les répéter. (Ce qu'il avait fait) lui suffisait. C'était, cependant, préférable, s'il les faisait consécutivement. Malik a dit : \"Quiconque mange ou boit par inadvertance ou oubli pendant le Ramadan ou pendant tout autre jeûne obligatoire qu'il doit faire, doit jeûner un autre jour à sa place.\""
    },
    {
        "hadithnumber": 680,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que A'isha et Hafsa, les épouses du Prophète, paix et bénédictions sur lui, commencèrent à jeûner volontairement un matin et ensuite de la nourriture leur fut donnée et elles rompirent leur jeûne avec. Puis le Messager d'Allah, paix et bénédictions sur lui, entra. A'isha dit : \"Hafsa demanda, me devançant dans la parole - elle tenait de son père Umar - 'Messager d'Allah, A'isha et moi avons commencé le matin en jeûnant volontairement et ensuite de la nourriture nous a été donnée et nous avons rompu le jeûne avec.' Le Messager d'Allah, paix et bénédictions sur lui, dit : 'Jeûnez un autre jour à la place.'\""
    },
    {
        "hadithnumber": 681,
        "text": "Yahya a dit qu'il a entendu Malik dire : \"Quelqu'un qui mange ou boit par négligence ou oubli pendant un jeûne volontaire n'a pas à répéter son jeûne, mais il doit continuer à jeûner pour le reste de la journée où il mange ou boit tout en jeûnant volontairement, et ne pas arrêter de jeûner. Quelqu'un à qui quelque chose d'inattendu arrive qui le fait rompre son jeûne alors qu'il jeûne volontairement n'a pas à répéter son jeûne s'il l'a rompu pour une raison, et non simplement parce qu'il a décidé de rompre son jeûne. Tout comme je ne pense pas que quelqu'un doive répéter une prière volontaire s'il a dû l'arrêter à cause d'un écoulement qu'il pouvait empêcher et qui signifiait qu'il devait répéter ses ablutions.\" Malik a dit : \"Une fois qu'un homme a commencé à faire l'une des bonnes actions (al-amal as-saliha) telles que la prière, le jeûne et le hajj, ou des bonnes actions similaires de nature volontaire, il ne doit pas s'arrêter avant de l'avoir complétée selon ce qu'est la sunna pour cette action. S'il dit le takbir, il ne doit pas s'arrêter avant d'avoir prié deux rakas. S'il jeûne, il ne doit pas rompre son jeûne avant d'avoir complété le jeûne de ce jour. S'il entre en ihram, il ne doit pas revenir avant d'avoir complété son hajj, et s'il commence à faire le tawaf, il ne doit pas s'arrêter de le faire avant d'avoir tourné autour de la Kaaba sept fois. Il ne doit arrêter de faire aucune de ces actions une fois qu'il les a commencées jusqu'à ce qu'il les ait complétées, sauf si quelque chose arrive comme la maladie ou une autre affaire par laquelle un homme est excusé. C'est parce qu'Allah, le Béni et Exalté, dit dans Son Livre : 'Et mangez et buvez jusqu'à ce que le fil blanc de l'aube vous soit distinct du fil noir, puis complétez le jeûne jusqu'à la nuit' (Sourate 2 verset 187), et donc il doit compléter son jeûne comme Allah l'a dit. Allah, l'Exalté, dit (aussi) : 'Et accomplissez le Hajj et la Umra pour Allah', et donc si un homme devait entrer en ihram pour un hajj volontaire ayant fait son seul hajj obligatoire (à une occasion précédente), il ne pourrait pas alors arrêter de faire son hajj l'ayant une fois commencé et quitter l'ihram alors qu'il est au milieu de son hajj. Quiconque commence un acte volontaire doit le compléter une fois qu'il a commencé à le faire, tout comme un acte obligatoire doit être complété. C'est la meilleure de ce que j'ai entendu.\" Yahya m'a rapporté de Malik qu'il avait entendu que Anas ibn Malik payait la fidya (compensation) quand il était devenu vieux et ne pouvait plus réussir à faire le jeûne. Malik a dit : \"Je ne considère pas que faire ainsi est obligatoire, mais ce que j'aime le plus, c'est qu'un homme fasse le jeûne quand il est assez fort. Quiconque paie une compensation donne un mudd de nourriture à la place de chaque jour, en utilisant le mudd du Prophète, paix et bénédictions sur lui.\""
    },
    {
        "hadithnumber": 728,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Abdullah ibn Umar, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Les gens de Médine doivent entrer en ihram à Dhu'l-Hulayfa, les gens de Syrie doivent le faire à al-Juhfa, et les gens du Najd doivent le faire à Qarn.\" Abdullah ibn Umar a ajouté : \"J'ai entendu que le Messager d'Allah, paix et bénédictions sur lui, a dit : 'Les gens du Yémen doivent entrer en ihram à Yalamlam.'\""
    },
    {
        "hadithnumber": 744,
        "text": "Yahya m'a rapporté de Malik, de Muhammad ibn Abd ar-Rahman, de Sulayman ibn Yasar, que lorsque le Messager d'Allah, paix et bénédictions sur lui, partit pour le hajj l'année du hajj d'adieu, certains de ses compagnons entrèrent en ihram pour faire le hajj seul, certains combinèrent le hajj et la umra, et certains entrèrent en ihram pour faire la umra seule. Ceux qui étaient entrés en ihram pour faire le hajj, ou le hajj et la umra ensemble, ne sortirent pas de l'ihram, tandis que ceux qui étaient entrés en ihram pour faire la umra (seule) sortirent de l'ihram."
    },
    {
        "hadithnumber": 768,
        "text": "Yahya m'a rapporté de Malik que Sumayy, le mawla de Abu Bakr ibn Abd ar-Rahman, a entendu Abu Bakr ibn Abd ar-Rahman dire : \"Une femme vint au Messager d'Allah, paix et bénédictions sur lui, et dit : 'J'avais prévu de faire le hajj, mais j'en ai été empêchée', et le Messager d'Allah, paix et bénédictions sur lui, dit : 'Fais une umra pendant le Ramadan, car faire une umra en ce mois est comme faire un hajj.'\""
    },
    {
        "hadithnumber": 769,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Abdullah ibn Umar, que Umar ibn al-Khattab a dit : \"Gardez votre hajj séparé de votre umra. De cette façon, votre hajj sera plus complet. Et votre umra sera plus complète si vous la faites en dehors des mois du hajj.\""
    },
    {
        "hadithnumber": 770,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Uthman ibn Affan parfois ne descendait jamais de l'animal sur lequel il montait lorsqu'il faisait la umra, jusqu'à ce qu'il soit revenu. Malik a dit : \"La umra est une sunna, et nous ne connaissons aucun musulman qui ait jamais dit qu'il est permis de ne pas la faire.\" Malik a dit : \"Je ne pense pas que quiconque puisse faire plus d'une umra en une seule année.\" Malik a dit que quelqu'un faisant la umra qui avait eu des rapports sexuels avec sa femme devait sacrifier un animal et faire une deuxième umra, qu'il devait commencer quand il avait fini celle qu'il avait gâchée. Il devait entrer en ihram au même endroit où il était entré en ihram pour la umra qu'il avait gâchée, sauf s'il était entré en ihram à un endroit plus éloigné que son miqat. C'était parce qu'il n'avait à entrer en ihram que depuis son miqat. Malik a dit : \"Quelqu'un qui est entré à La Mecque pour faire la umra, et fait le tawaf de la Maison et le sa'y entre Safa et Marwa alors qu'il est junub, ou sans ablutions, et ensuite a des rapports avec sa femme, puis se souvient, doit faire le ghusl, ou les ablutions, puis retourner faire le tawaf autour de la Maison et le sa'y entre Safa et Marwa et faire une autre umra et sacrifier un animal. Une femme doit faire la même chose si son mari a des rapports avec elle alors qu'elle est en ihram.\" Malik a dit : \"Quant à commencer la umra à at-Tanim, (ce n'est pas la seule alternative). Il est permis si Allah le veut pour quelqu'un de quitter le Haram et d'entrer en ihram s'il le souhaite, mais la meilleure manière est pour lui d'entrer en ihram au miqat que le Messager d'Allah, paix et bénédictions sur lui, a utilisé (c'est-à-dire at-Tanim), ou un qui est plus éloigné.\""
    },
    {
        "hadithnumber": 771,
        "text": "Yahya m'a rapporté de Malik, de Rabia ibn Abi Abd ar-Rahman, de Sulayman ibn Yasar, que le Messager d'Allah, paix et bénédictions sur lui, envoya Abu Rafi et un homme des Ansar pour arranger son mariage avec Maymuna bint al-Harith, et le Messager d'Allah, paix et bénédictions sur lui, était à Médine avant d'être parti pour la umra."
    },
    {
        "hadithnumber": 777,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar disait : \"Quelqu'un en ihram ne doit pas se faire faire de saignée, sauf quand il n'y a pas d'autre alternative.\" Malik a dit : \"Quelqu'un qui est en ihram ne doit pas se faire faire de saignée sauf quand c'est nécessaire.\""
    }
]