[
    {
        "hadithnumber": 1356,
        "text": "Malik a dit : \"C'est la manière de faire les choses généralement convenue parmi nous que la viande de chameaux, de bétail, de moutons et ainsi de suite ne doit pas être troquée l'une pour l'autre, sauf semblable pour semblable, poids pour poids, de la main à la main. Il n'y a pas de mal à cela. Si ce n'est pas pesé, alors c'est estimé être semblable pour semblable de la main à la main.\" Malik a dit : \"Il n'y a pas de mal à troquer la viande de poisson pour la viande de chameaux, de bétail, et de moutons et ainsi de suite deux ou plus pour un, de la main à la main. Si des termes retardés entrent dans la transaction cependant, il n'y a rien de bon en elle.\" Malik a dit : \"Je pense que la volaille est différente de la viande de bétail et de poisson. Je ne vois pas de mal à en vendre une partie pour quelque chose de différent, plus de l'un que de l'autre, de la main à la main. Rien de tout cela ne doit être vendu à terme.\" Yahya m'a rapporté de Malik, de Ibn Shihab, de Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham, de Abu Masud al-Ansari, que le Messager d'Allah, paix et bénédictions sur lui, a interdit le prix de vente d'un chien, les gains d'une prostituée et les gains d'un devin. Par les gains d'une prostituée, il entendait ce qu'une femme recevait pour la fornication. Les gains d'un devin étaient ce qu'on lui donnait pour dire la bonne aventure. Malik a dit : \"Je désapprouve le prix d'un chien, que ce soit un chien de chasse ou autre parce que le Messager d'Allah, paix et bénédictions sur lui, a interdit le prix d'un chien.\""
    },
    {
        "hadithnumber": 1359,
        "text": "Malik a dit : \"La manière de faire les choses généralement convenue parmi nous au sujet de tout ce qui est pesé mais n'est pas de l'or ou de l'argent, c'est-à-dire le cuivre, le laiton, le plomb, le plomb noir, le fer, les herbes, les figues, le coton, et toutes ces choses qui sont pesées, est qu'il n'y a pas de mal à troquer toutes ces sortes de choses deux pour un, de la main à la main. Il n'y a pas de mal à prendre un ritl de fer pour deux ritls de fer, et un ritl de laiton pour deux ritls de laiton.\" Malik a dit : \"Il n'y a rien de bon dans deux pour un d'une sorte avec des termes retardés. Il n'y a pas de mal à prendre deux d'une sorte pour un d'une autre à terme, si les deux sortes sont clairement différentes. Si les deux sortes se ressemblent mais que leurs noms sont différents, comme le plomb et le plomb noir, le laiton et le laiton jaune, je désapprouve de prendre deux d'une sorte pour un de l'autre à terme.\" Malik a dit : \"Lors de l'achat de quelque chose de cette nature, il n'y a pas de mal à le vendre avant d'en prendre possession à quelqu'un d'autre que la personne de qui il a été acheté, si le prix est pris immédiatement et s'il a été acheté à l'origine par mesure ou poids. S'il a été acheté sans mesurer, il devrait être vendu à quelqu'un d'autre que la personne de qui il a été acheté, pour de l'argent comptant ou avec des termes retardés. C'est parce que les marchandises doivent être garanties quand elles sont achetées sans mesurer, et elles ne peuvent pas être garanties quand elles sont achetées au poids jusqu'à ce qu'elles soient pesées et que l'affaire soit conclue. C'est le meilleur de ce que j'ai entendu au sujet de toutes ces choses. C'est ce que les gens continuent de faire parmi nous.\" Malik a dit : \"La manière de faire les choses parmi nous avec ce qui est mesuré ou pesé de choses qui ne sont pas mangées ou bues, comme le carthame, les noyaux de dattes, les feuilles de fourrage, la teinture d'indigo et leurs semblables est qu'il n'y a pas de mal à troquer toutes ces sortes de choses deux pour un, de la main à la main. Ne prenez pas deux pour un de la même variété avec des termes retardés. Si les types sont clairement différents, il n'y a pas de mal à prendre deux de l'un pour un de l'autre avec des termes retardés. Il n'y a pas de mal à vendre tout ce qui est acheté de toutes ces sortes, avant d'en prendre livraison si le prix est pris de quelqu'un d'autre que la personne de qui elles ont été achetées.\" Malik a dit : \"Toute chose de toute variété qui profite aux gens, comme le gravier et le gypse, une quantité d'eux pour deux de son semblable avec des termes retardés est de l'usure. Une quantité des deux pour son égal plus toute augmentation avec des termes retardés, est de l'usure.\" Yahya m'a rapporté de Malik qu'il avait entendu que le Messager d'Allah, paix et bénédictions sur lui, a interdit deux ventes en une vente."
    },
    {
        "hadithnumber": 1361,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que al-Qasim ibn Muhammad fut interrogé sur un homme qui achetait des marchandises pour 10 dinars comptant ou quinze dinars à crédit. Il désapprouva cela et l'interdit. Malik a dit que si un homme achetait des marchandises d'un homme pour soit 10 dinars soit 15 dinars à crédit, que l'un des deux prix était obligé sur l'acheteur. Ce n'était pas à faire parce que s'il reportait le paiement des dix, ce serait 15 à crédit, et s'il payait les dix, il achèterait avec cela ce qui valait quinze dinars à crédit. Malik a dit qu'il était désapprouvé pour un homme d'acheter des marchandises de quelqu'un pour soit un dinar comptant soit pour un mouton décrit à crédit et que l'un des deux prix était obligé sur lui. Ce n'était pas à faire parce que le Messager d'Allah, paix et bénédictions sur lui, a interdit deux ventes en une vente. Cela faisait partie de deux ventes en une vente. Malik a parlé d'un homme disant à un autre : \"J'achèterai soit ces quinze sa de dattes ajwa de toi, soit ces dix sa de dattes sayhani ou j'achèterai ces quinze sa de blé inférieur ou ces dix sa de blé syrien pour un dinar, et l'un d'eux m'est obligé.\" Malik a dit que c'était désapprouvé et n'était pas halal. C'était parce qu'il l'obligeait à dix sa de sayhani, et les laissait et prenait quinze sa d'ajwa, ou il était obligé à quinze sa de blé inférieur et les laissait et prenait dix sa de blé syrien. C'était aussi désapprouvé, et n'était pas halal. Cela ressemblait à ce qui était interdit dans la voie de deux ventes en une vente. C'était aussi inclus sous l'interdiction d'acheter deux pour un de la même sorte de nourriture."
    },
    {
        "hadithnumber": 1364,
        "text": "Yahya m'a rapporté, que Malik a dit : \"La manière de faire les choses généralement convenue parmi nous au sujet d'un homme achetant du tissu dans une ville, et l'emmenant ensuite dans une autre ville pour le vendre comme une murabaha, est qu'il n'est pas compté pour avoir le salaire d'un agent, ni aucune allocation pour le repassage, le pliage, le redressement, les dépenses, ou le loyer d'une maison. Quant au coût du transport de la draperie, il est inclus dans le prix de base, et aucune part du profit ne lui est allouée à moins que l'agent ne dise tout cela à l'investisseur. S'ils acceptent de partager les profits en conséquence après en avoir eu connaissance, il n'y a pas de mal à cela.\" Malik a dit : \"Quant au blanchiment, à la couture, à la teinture, et à de telles choses, elles sont traitées de la même manière que les articles de draperie. Le profit est compté en elles comme il est compté dans les articles de draperie. Donc s'il vend les articles de draperie sans clarifier les choses que nous avons nommées comme n'obtenant pas de profit, et si la draperie est déjà partie, le transport doit être compté, mais aucun profit n'est donné. Si les articles de draperie ne sont pas partis, la transaction entre eux est nulle et non avenue à moins qu'ils ne fassent un nouvel accord mutuel sur ce qui doit être permis entre eux.\" Malik a parlé d'un agent qui achetait des marchandises pour de l'or ou de l'argent, et le taux de change le jour de l'achat était de dix dirhams pour le dinar. Il les emmenait dans une ville pour vendre en murabaha, ou les vendait là où il les avait achetées selon le taux de change du jour où il les vendait. S'il les achetait pour des dirhams et qu'il les vendait pour des dinars, ou qu'il les achetait pour des dinars et qu'il les vendait pour des dirhams, et que les marchandises n'étaient pas parties alors il avait le choix. S'il le souhaitait, il acceptait de vendre les marchandises et s'il le souhaitait, il les laissait. Si les marchandises avaient été vendues, il avait le prix pour lequel le vendeur les avait achetées, et le vendeur était compté avoir le profit sur ce pour quoi elles avaient été achetées, au-dessus de ce que l'investisseur gagnait comme profit. Malik a dit : \"Si un homme vend des marchandises valant cent dinars pour cent dix, et qu'il entend après cela qu'elles valent quatre-vingt-dix dinars, et que les marchandises sont parties, le vendeur a le choix. S'il aime, il a le prix des marchandises le jour où elles lui ont été prises à moins que le prix ne soit plus que le prix pour lequel il était obligé de les vendre en premier lieu, et il n'a pas plus que cela - et c'est cent dix dinars. S'il aime, c'est compté comme profit contre quatre-vingt-dix à moins que le prix que ses marchandises ont atteint ne soit moins que la valeur. On lui donne le choix entre ce que ses marchandises rapportent et le capital plus le profit, qui est quatre-vingt-dix-neuf dinars.\" Malik a dit : \"Si quelqu'un vend des marchandises en murabaha et qu'il dit : 'Cela a été évalué à cent dinars pour moi.' Puis il entend plus tard, que cela valait cent vingt dinars, le client se voit donner le choix. S'il le souhaite, il donne au vendeur la valeur des marchandises le jour où il les a prises, et s'il le souhaite, il donne le prix pour lequel il les a achetées selon le calcul de quel profit il lui donne, pour autant que cela aille, à moins que cela ne soit moins que le prix pour lequel il les a achetées, car il ne devrait pas donner au propriétaire des marchandises une perte sur le prix pour lequel il les a achetées parce qu'il était satisfait de cela. Le propriétaire des marchandises est venu chercher un supplément, donc l'acheteur n'a aucun argument contre le vendeur en cela pour faire une réduction du premier prix pour lequel il l'a acheté selon la liste du contenu.\" Malik a parlé de ce qui était fait parmi eux dans le cas d'un groupe de personnes qui achetaient des marchandises, de la draperie ou des esclaves, et un homme en entendit parler et dit à l'un du groupe : \"J'ai entendu la description et la situation des articles de draperie que tu as achetés de un tel. Te donnerai-je tel et tel profit pour reprendre ta portion ?\" Cette personne accepta, et l'homme lui donna le profit et devint un partenaire à sa place. Quand il regarda l'achat, il vit qu'il était vilain et le trouva trop cher. Malik a dit : \"Cela lui est obligé et il n'y a pas de choix en cela pour lui s'il l'a acheté selon une liste de contenu et que la description était bien connue.\" Malik a parlé d'un homme à qui on avait envoyé des articles de draperie, et des vendeurs vinrent à lui et il leur lut sa liste de contenu et dit : \"Dans chaque sac est tel et tel châle de Basra et tel et tel châle léger de Sabir. Leur taille est telle et telle,\" et il leur nomma des types d'articles de draperie par leur sorte, et il dit : \"Achetez-les de moi selon cette description.\" Ils achetèrent les sacs selon ce qu'il leur avait décrit, et ensuite ils les achetèrent et les trouvèrent trop chers et le regrettèrent. Malik a dit : \"La vente est contraignante pour eux, si les marchandises s'accordent avec la liste de contenu sur laquelle il les a vendues.\" Malik a dit : \"C'est la manière de faire les choses que les gens utilisent encore aujourd'hui. Ils permettent la vente parmi eux quand les marchandises s'accordent avec la liste de contenu et ne sont pas différentes d'elle.\" Yahya m'a rapporté de Malik, de Nafi, de Abdullah ibn Umar, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Les deux parties dans une transaction commerciale ont le droit de rétractation tant qu'elles ne se sont pas séparées, sauf dans la transaction appelée khiyar.\" Malik a dit : \"Il n'y a pas de limite spécifiée ni aucune matière qui est appliquée dans ce cas selon nous.\""
    },
    {
        "hadithnumber": 1372,
        "text": "Malik m'a rapporté de Yahya ibn Said, de Abu Bakr ibn Muhammad ibn Amr ibn Hazm, de Umar ibn Abdal-Aziz, de Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham, de Abu Hurayra, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Si quelqu'un fait faillite, et qu'un homme trouve sa propre propriété intacte avec lui, il y a plus droit que quiconque d'autre.\" Malik a parlé d'un homme qui vendait des marchandises à un homme, et l'acheteur faisait faillite. Il a dit : \"Le vendeur prend tout ce qu'il trouve de ses marchandises. Si l'acheteur en a vendu une partie et les a distribuées, le vendeur des marchandises y a plus droit que les créanciers. Ce que l'acheteur a distribué n'empêche pas le vendeur de prendre quoi que ce soit qu'il trouve de ses marchandises. C'est le droit du vendeur s'il a reçu une partie du prix de l'acheteur et qu'il veut le rendre pour prendre ce qu'il trouve de ses marchandises, et dans ce qu'il ne trouve pas, il est comme les créanciers.\" Malik a parlé de quelqu'un qui achetait de la laine filée ou une parcelle de terre, et faisait ensuite du travail dessus, comme construire une maison sur la parcelle de terre ou tisser la laine filée en tissu. Puis il faisait faillite après l'avoir achetée, et le propriétaire original de la parcelle disait : \"Je prendrai la parcelle et toute structure qui est dessus.\" Malik a dit : \"Cette structure n'est pas à lui. Cependant, la parcelle et ce qui est en elle que l'acheteur a amélioré est évalué. Ensuite on voit quel est le prix de la parcelle et combien de cette valeur est le prix de la structure. Ils sont partenaires en cela. Le propriétaire de la parcelle a autant que sa portion, et les créanciers ont le montant de la portion de la structure.\" Malik a dit : \"L'explication de cela est que la valeur de tout cela est de quinze cents dirhams. La valeur de la parcelle est de cinq cents dirhams, et la valeur du bâtiment est de mille dirhams. Le propriétaire de la parcelle a un tiers, et les créanciers ont deux tiers.\" Malik a dit : \"C'est comme cela avec le filage et d'autres choses de la même nature dans ces circonstances et l'acheteur a une dette qu'il ne peut pas payer. C'est le comportement dans de tels cas.\" Malik a dit : \"Quant aux marchandises qui ont été vendues et que l'acheteur n'améliore pas, mais ces marchandises se vendent bien et ont monté en prix, donc leur propriétaire les veut et les créanciers veulent aussi les saisir, alors les créanciers choisissent entre donner au propriétaire des marchandises le prix pour lequel il les a vendues et ne lui donner aucune perte et lui rendre ses marchandises. Si le prix des marchandises a baissé, celui qui les a vendues a le choix. S'il aime, il peut prendre ses marchandises et il n'a aucune réclamation sur aucune des propriétés de son débiteur, et c'est son droit. S'il aime, il peut être l'un des créanciers et prendre une portion de son dû et ne pas prendre ses marchandises. C'est à lui de décider.\" Malik a dit au sujet de quelqu'un qui a acheté une esclave ou un animal et elle a donné naissance en sa possession et l'acheteur a fait faillite : \"L'esclave ou l'animal et la progéniture appartiennent au vendeur à moins que les créanciers ne le désirent. Dans ce cas, ils lui donnent son dû complet et ils la prennent.\""
    },
    {
        "hadithnumber": 1384,
        "text": "Malik m'a rapporté de Yahya ibn Said qu'il a entendu Muhammad ibn al-Munkadir dire : \"Allah aime son esclave qui est généreux quand il vend, et généreux quand il achète, généreux quand il rembourse, et généreux quand il est remboursé.\" Malik a dit au sujet d'un homme qui achetait des chameaux ou des moutons ou des marchandises sèches ou des esclaves ou toutes marchandises sans mesurer précisément : \"Il n'y a pas d'achat sans mesurer précisément dans tout ce qui peut être compté.\" Malik a dit au sujet d'un homme qui donnait des marchandises à un homme pour vendre pour lui et fixait leur prix en disant : \"Si tu les vends pour ce prix comme je t'ai ordonné de le faire, tu auras un dinar (ou quelque chose qu'il a spécifié, dont ils sont tous deux satisfaits), si tu ne les vends pas, tu n'auras rien.\" \"Il n'y a pas de mal à cela quand il nomme un prix auquel les vendre et nomme un honoraire connu. S'il vend les marchandises, il prend l'honoraire, et s'il ne les vend pas, il n'a rien.\" Malik a dit : \"C'est comme dire à un autre homme : 'Si tu captures mon esclave en fuite ou ramène mon chameau égaré, tu auras tel et tel.' C'est de la catégorie de la récompense, et non de la catégorie du don d'un salaire. Si cela avait été de la catégorie du don d'un salaire, cela n'aurait pas été bon.\" Malik a dit : \"Quant à un homme à qui on donne des marchandises et à qui on dit que s'il les vend il aura un pourcentage nommé pour chaque dinar, ce n'est pas bon parce que chaque fois qu'il est un dinar de moins que le prix des marchandises, il diminue le dû qui a été nommé pour lui. C'est une transaction incertaine. Il ne sait pas combien on lui donnera.\""
    },
    {
        "hadithnumber": 1385,
        "text": "Malik m'a rapporté qu'il a interrogé Ibn Shihab sur un homme qui louait un animal, et ensuite le relouait pour plus que ce pour quoi il l'avait loué. Il a dit : \"Il n'y a pas de mal à cela.\""
    },
    {
        "hadithnumber": 1388,
        "text": "Malik a dit : \"La forme reconnue et permise de qirad est qu'un homme prenne du capital d'un associé pour l'utiliser. Il ne le garantit pas et en voyageant paie sur le capital pour la nourriture et les vêtements et ce dont il fait bon usage, selon le montant du capital. C'est-à-dire, quand il voyage pour faire le travail et que le capital peut le supporter. S'il reste avec son peuple, il n'a pas de dépenses ou de vêtements du capital.\" Malik a dit : \"Il n'y a pas de mal à ce que les deux parties dans un qirad s'aident mutuellement par voie de faveur quand c'est acceptable pour eux deux.\" Malik a dit : \"Il n'y a pas de mal à ce que l'investisseur du capital achète une partie des marchandises de l'agent dans le qirad si c'est acceptable et sans conditions.\" Malik a parlé d'un investisseur faisant un prêt qirad à un homme et son esclave, pour être utilisé par les deux. Il a dit : \"C'est permis, et il n'y a pas de mal à cela parce que le profit est propriété pour son esclave, et le profit n'est pas pour le maître jusqu'à ce qu'il le prenne de lui. C'est comme le reste de ses gains.\" Malik a dit : \"Quand un homme doit de l'argent à un autre homme et qu'il lui demande de le laisser rester avec lui comme quirad, c'est désapprouvé jusqu'à ce que le créancier reçoive sa propriété. Ensuite il peut en faire un prêt qirad ou le garder. C'est parce que le débiteur peut être dans une situation serrée, et vouloir le retarder pour l'augmenter pour lui.\" Malik a parlé d'un investisseur qui a fait un prêt qirad à un homme, et une partie du principal a été perdue avant qu'il ne l'utilise, et ensuite il l'a utilisé et a fait un profit. L'agent voulait faire du principal le reste de l'argent après ce qui avait été perdu de lui. Malik a dit : \"Sa déclaration n'est pas acceptée, et le principal est complété à son montant original à partir de son profit. Ensuite ils divisent ce qui reste après que le principal a été remboursé selon les conditions du qirad.\" Malik a dit : \"Le prêt qirad n'est bon qu'en pièces d'or ou d'argent et il n'est jamais permis dans aucune sorte de marchandises ou de biens ou d'articles.\" Malik a dit : \"Il y a certaines transactions pour lesquelles si un long laps de temps passe après que la transaction a eu lieu, sa révocation devient inacceptable. Quant à l'usure, il n'y a jamais rien sauf son rejet que ce soit peu ou beaucoup. Ce qui est permis dans autre qu'elle n'est pas permis en elle parce qu'Allah, le Béni et l'Exalté, a dit dans Son Livre : 'Et si vous vous repentez, à vous votre capital, ne lésant personne et n'étant point lésés.'\" Yahya a dit que Malik a parlé d'un investisseur qui faisait un prêt qirad et stipulait à l'agent que seules certaines marchandises devaient être achetées avec son argent ou il interdisait certaines marchandises qu'il nommait d'être achetées. Il a dit : \"Il n'y a pas de mal à ce qu'un investisseur fasse une condition à un agent en qirad de ne pas acheter un certain genre d'animal ou de marchandises qu'il spécifie. Il est désapprouvé pour un investisseur de faire comme condition à un agent en qirad qu'il n'achète que certaines marchandises à moins que les marchandises qu'il lui ordonne d'acheter ne soient en offre abondante et ne manquent ni en hiver ni en été. Il n'y a pas de mal dans ce cas.\" Malik a parlé d'un investisseur qui prêtait de l'argent qirad et stipulait que quelque chose du profit devait être à lui seul sans que l'agent le partage. Il a dit : \"Ce n'est pas bon, même si ce n'est qu'un dirham à moins qu'il ne stipule que la moitié du profit est à lui et la moitié du profit est à l'agent ou un tiers ou un quart ou n'importe quoi. Quand il nomme un pourcentage, que ce soit grand ou petit, tout ce qui est spécifié par cela est halal. C'est le qirad des musulmans.\" Il a dit : \"Il n'est pas non plus bon si l'investisseur stipule qu'un dirham ou plus du profit est purement à lui, sans que l'agent le partage et qu'ensuite ce qui reste du profit doit être divisé en deux entre eux. Ce n'est pas le qirad des Musulmans.\" Yahya a dit que Malik a dit : \"La personne qui met le principal ne doit pas stipuler qu'il a quelque chose du profit seul sans que l'agent le partage, ni l'agent ne doit stipuler qu'il a quelque chose du profit seul sans que l'investisseur le partage. Dans le qirad, il n'y a pas de vente, pas de loyer, pas de travail, pas d'avance, et pas de commodité qu'une partie spécifie pour elle-même sans que l'autre partie partage à moins qu'une partie ne l'autorise à l'autre inconditionnellement comme une faveur et que ce soit bien pour les deux. Aucune des parties ne devrait faire une condition sur l'autre qui l'augmente en or ou en argent ou en nourriture sur l'autre partie.\" Il a dit : \"Si quoi que ce soit de cela entre dans le qirad, cela devient de la location, et la location n'est bonne qu'avec des termes connus et fixes. L'agent ne devrait pas stipuler quand il prend le principal qu'il rembourse ou commissionne quiconque avec les marchandises, ni qu'il prenne l'une d'elles pour lui-même. Quand il y a un profit, et qu'il est temps de séparer le capital, alors ils divisent le profit selon les termes du contrat. Si le principal n'augmente pas ou qu'il y a une perte, l'agent n'a pas à compenser ce qu'il a dépensé pour lui-même ou pour la perte. Cela tombe sur l'investisseur à partir du principal. Le qirad est permis sur tous les termes sur lesquels l'investisseur et l'agent font un accord mutuel, de moitié du profit, ou un tiers ou un quart ou n'importe quoi.\" Malik a dit : \"Il n'est pas permis pour l'agent de stipuler qu'il utilise l'argent du qirad pour un certain nombre d'années et qu'il ne lui soit pas pris pendant ce temps.\" Il a dit : \"Il n'est pas bon pour l'investisseur de stipuler que l'argent du qirad ne devrait pas être retourné pour un certain nombre d'années qui sont spécifiées, parce que le qirad n'est pas pour un terme. L'investisseur le prête à un agent pour l'utiliser pour lui. S'il semble approprié à l'un ou l'autre d'abandonner le projet et que l'argent est en pièces, et que rien n'a été acheté avec, il peut être abandonné, et l'investisseur reprend son argent. S'il semble approprié à l'investisseur de reprendre le prêt qirad après que des marchandises ont été achetées avec, il ne peut pas le faire jusqu'à ce que l'acheteur ait vendu les marchandises et qu'elles soient devenues de l'argent. S'il semble approprié à l'agent de retourner le prêt, et qu'il a été transformé en marchandises il ne peut pas le faire jusqu'à ce qu'il les ait vendues. Il retourne le prêt en espèces comme il l'a pris.\" Malik a dit : \"Il n'est pas bon pour l'investisseur de stipuler que l'agent paie toute zakat due de sa portion du profit en particulier, parce que l'investisseur en stipulant cela, stipule une augmentation fixe pour lui-même du profit parce que la portion de zakat dont il serait responsable par sa portion du profit, lui est retirée. Il n'est pas permis pour l'investisseur de stipuler à l'agent d'acheter seulement de un tel, se référant à un homme spécifique. Ce n'est pas permis parce qu'en faisant ainsi il deviendrait son salarié pour un salaire.\" Malik a parlé d'un investisseur en qirad qui stipulait une garantie pour un montant d'argent de l'agent : \"L'investisseur n'est pas autorisé à stipuler des conditions sur son principal autres que les conditions sur lesquelles le qirad est basé ou selon le précédent de la sunna des Musulmans. Si le principal est augmenté par la condition de garantie, l'investisseur a augmenté sa part du profit à cause de la position de la garantie. Mais le profit ne doit être divisé que selon ce qu'il aurait été si le prêt avait été donné sans la garantie. Si le principal est détruit, je ne pense pas que l'agent ait une garantie tenue contre lui parce que la stipulation de garanties dans le qirad est nulle et non avenue.\" Malik a parlé d'un investisseur qui a donné de l'argent qirad à un homme et l'homme a stipulé qu'il n'achèterait que des palmiers ou des animaux avec parce qu'il cherchait à manger les dattes ou la progéniture des animaux et il les a gardés quelque temps pour les utiliser pour lui-même. Il a dit : \"Ce n'est pas permis. Ce n'est pas la sunna des Musulmans dans le qirad à moins qu'il ne l'achète et ne le vende ensuite comme d'autres marchandises sont vendues.\" Malik a dit : \"Il n'y a pas de mal à ce que l'agent stipule sur l'investisseur un esclave pour l'aider à condition que l'esclave soit susceptible de gagner avec lui hors de l'investissement, et quand l'esclave l'aide seulement avec l'investissement, pas avec autre chose.\" Yahya a dit que Malik a dit : \"Personne ne devrait faire un prêt qirad sauf en pièces, parce que le prêt ne doit pas être en marchandises, puisque prêter des marchandises ne peut être travaillé que de l'une de deux manières : Soit le propriétaire des marchandises dit à l'emprunteur : 'Prends ces marchandises et vends-les. Achète et vends avec le capital réalisé selon le qirad.' L'investisseur stipule une augmentation pour lui-même de la vente de ses biens et ce qui le soulage des dépenses en le vendant. Ou bien il dit : 'Troc avec ces marchandises et vends. Quand tu as fini, achète pour moi le semblable de mes marchandises que je t'ai données. S'il y a augmentation, c'est entre toi et moi.' Il peut arriver que l'investisseur donne les marchandises à l'agent à un moment où elles sont en demande et chères, et ensuite l'agent les retourne alors qu'elles sont bon marché et il aurait pu les acheter pour seulement un tiers du prix original ou même moins que cela. L'agent a alors un profit de la moitié du montant dont le prix des marchandises a diminué comme sa portion du profit. Ou il pourrait prendre les marchandises à un moment où leur prix est bas, et les utiliser jusqu'à ce qu'il ait beaucoup d'argent. Ensuite ces marchandises deviennent chères et leur prix monte quand il les retourne, donc il les achète pour tout ce qu'il a de sorte que tout son travail et son souci ont été vains. C'est une transaction incertaine et n'est pas bonne. Si, cependant, cela n'est pas connu jusqu'à ce que ce soit arrivé, alors le salaire qu'un agent en qirad serait payé pour vendre cela, est regardé et il lui est donné pour son souci. Ensuite l'argent est qirad du jour où l'argent est devenu de l'argent comptant et collecté comme pièces et il est retourné comme un qirad comme cela.\" Yahya a dit que Malik a parlé d'un homme qui a fait un prêt qirad à un homme et il a acheté des marchandises avec et les a transportées vers un centre commercial. Il n'était pas profitable de les vendre et l'agent craignait une perte s'il les vendait, alors il loua un transport pour les emmener dans une autre ville, et il les vendit là et fit une perte, et le coût de la location était plus grand que le principal. Malik a dit : \"Si l'agent peut payer le coût de la location de ce que le capital a réalisé, sa voie est celle-là. Quelle que soit la portion de la location qui n'est pas couverte par le principal, l'agent doit la payer. L'investisseur n'est responsable d'aucune partie de cela. C'est parce que l'investisseur lui a seulement ordonné de commercer avec le principal. L'investisseur n'est pas responsable d'autre chose que le principal. Si l'investisseur avait été responsable, cela aurait été une perte supplémentaire pour lui en plus du principal qu'il a investi. L'agent ne peut pas mettre cela sur l'investisseur.\" Yahya a dit que Malik a parlé d'un investisseur qui a fait un prêt qirad à un homme, qui l'a utilisé et a fait un profit. Ensuite l'homme a acheté avec tout le profit une esclave et il a eu des rapports avec elle et elle est devenue enceinte de lui, et donc le capital a diminué. Malik a dit : \"S'il a de l'argent, le prix de l'esclave est pris de sa propriété, et le capital est restauré par cela. S'il y a quelque chose de reste après que l'argent est payé, c'est divisé entre eux selon le premier qirad. S'il ne peut pas le payer, l'esclave est vendue pour que le capital soit restauré de son prix.\" Malik a parlé d'un investisseur qui a fait un prêt qirad à un homme, et l'agent a dépensé plus que le montant du prêt qirad en achetant des marchandises avec et a payé l'augmentation de son propre argent. Malik a dit : \"L'investisseur a le choix si les marchandises sont vendues pour un profit ou une perte ou si elles ne sont pas vendues. S'il souhaite prendre les marchandises, il les prend et rembourse à l'agent ce qu'il a mis pour elles. Si l'agent refuse, l'investisseur est partenaire pour sa part du prix en augmentation et diminution selon ce que l'agent a payé en plus pour elles de lui-même.\" Malik a parlé d'un agent qui a pris de l'argent qirad d'un homme et l'a ensuite donné à un autre homme pour l'utiliser comme qirad sans le consentement de l'investisseur. Il a dit : \"L'agent est responsable de la propriété. Si elle est diminuée, il est responsable de la perte. S'il y a du profit, l'investisseur a sa stipulation du profit, et ensuite l'agent a sa stipulation de ce qui reste de l'argent.\" Malik a parlé d'un agent qui a dépassé et a emprunté une partie de ce qu'il avait de qirad en argent et il a acheté des marchandises pour lui-même avec. Malik a dit : \"S'il a un profit, le profit est divisé selon la condition entre eux dans le qirad. S'il a une perte, il est responsable de la perte.\" Malik a dit au sujet d'un investisseur qui a payé de l'argent qirad à un homme, et l'agent a emprunté une partie de l'argent comptant et a acheté des marchandises pour lui-même avec : \"L'investisseur du capital a le choix. S'il le souhaite, il partage avec lui dans les marchandises selon le qirad, et s'il le souhaite, il se libère d'elles, et reprend tout le principal de l'agent. C'est ce qui est fait avec quelqu'un qui dépasse les bornes.\" Yahya a dit que Malik a parlé d'un investisseur qui a fait un prêt qirad à un homme. Il a dit : \"Quand l'investissement est grand, les dépenses de voyage de l'agent sont prises de lui. Il peut l'utiliser pour manger et s'habiller d'une manière acceptable selon la taille de l'investissement. Si cela lui épargne des ennuis, il peut prendre un salaire d'une partie du capital, s'il est grand, et qu'il ne peut pas subvenir à ses besoins. Il y a certains travaux dont un agent ou son semblable n'est pas responsable, parmi eux la collecte des dettes, le transport des marchandises, le chargement et ainsi de suite. Il peut embaucher du capital quelqu'un pour faire cela pour lui. L'agent ne devrait pas dépenser du capital ni s'habiller de celui-ci tant qu'il réside avec sa famille. Il ne lui est permis d'avoir des dépenses que quand il voyage pour l'investissement. Les dépenses sont prises du capital. S'il ne commerce avec la propriété que dans la ville où il réside, il n'a pas de dépenses du capital et pas de vêtements.\" Malik a parlé d'un investisseur qui a payé de l'argent qirad à un homme, et l'agent est sorti avec et avec son propre capital. Il a dit : \"Les dépenses viennent du qirad et de son propre capital selon leurs proportions.\" Yahya a dit que Malik a parlé d'un agent qui avait de l'argent qirad avec lui et il a dépensé de celui-ci et s'est habillé. Il a dit : \"Il ne peut en donner aucune partie, et ni un mendiant ni personne d'autre ne doit en recevoir, et il ne paie personne de compensation de celui-ci. S'il rencontre des gens, et qu'ils sortent de la nourriture et qu'il sort de la nourriture, j'espère que cela lui sera permis s'il n'a pas l'intention de leur accorder quelque chose. S'il a l'intention de cela ou de ce qui est comme ça sans la permission de l'investisseur, il doit obtenir la sanction de l'investisseur pour cela. S'il le sanctionne, il n'y a pas de mal. S'il refuse de le sanctionner, il doit le rembourser avec du semblable s'il a quelque chose qui convient comme compensation.\" Yahya a dit que Malik a dit : \"La manière de faire les choses généralement convenue parmi nous au sujet d'un investisseur qui paie de l'argent qirad à un agent pour acheter des marchandises, et l'agent vend ensuite les marchandises pour un prix à payer plus tard, et a un profit dans la transaction, puis l'agent meurt avant d'avoir reçu le paiement, est que si ses héritiers veulent prendre cet argent, ils ont la portion stipulée de leur père du profit. C'est à eux s'ils sont dignes de confiance pour prendre le paiement. S'ils n'aiment pas le collecter du débiteur et qu'ils le renvoient à l'investisseur, ils ne sont pas obligés de le collecter et il n'y a rien contre eux et rien pour eux par leur remise à l'investisseur. S'ils le collectent, ils en ont une part et des dépenses comme leur père avait. Ils sont dans la position de leur père. S'ils ne sont pas dignes de confiance pour le faire, ils peuvent amener quelqu'un de fiable et digne de confiance pour collecter l'argent. S'il collecte tout le capital et tout le profit, ils sont dans la position de leur père.\" Malik a parlé d'un investisseur qui a payé de l'argent qirad à un homme à condition qu'il l'utilise et soit responsable de tout paiement retardé pour lequel il l'a vendu. Il a dit : \"Ceci est obligatoire pour l'agent. S'il le vend pour un paiement retardé, il en est responsable.\" Yahya a dit que Malik a parlé d'un investisseur qui a donné de l'argent qirad à un homme, et ensuite l'homme a cherché un prêt de l'investisseur ou l'investisseur a emprunté de l'argent de l'agent, ou l'investisseur a laissé des marchandises avec l'agent pour vendre pour lui, ou l'investisseur a donné à l'agent des dinars pour acheter des marchandises avec. Malik a dit : \"Il n'y a pas de mal si l'investisseur laisse ses marchandises avec lui sachant que si l'agent n'avait pas eu son argent et qu'il lui avait demandé une chose similaire, il l'aurait quand même fait à cause de la fraternité entre eux ou parce que cela n'aurait été aucun ennui pour lui et que si l'agent avait refusé cela, il n'aurait pas retiré son capital de lui. Ou si l'agent avait emprunté de l'investisseur ou porté ses marchandises pour lui et qu'il savait que si l'investisseur n'avait pas eu son capital avec lui, il aurait quand même fait la même chose pour lui, et s'il lui avait refusé cela, il ne lui aurait pas retourné son capital. Si c'est vrai entre eux deux et que c'est dans la voie d'une faveur entre eux et que ce n'est pas une condition dans les termes du qirad, c'est permis et il n'y a pas de mal à cela. Si une condition entre en cela, ou qu'il est craint que l'agent ne le fasse pour l'investisseur que pour sauvegarder le capital en sa possession, ou que l'investisseur ne le fasse que parce que l'agent a pris son capital et ne le lui retournera pas, ce n'est pas permis dans le qirad et cela fait partie de ce que les gens de science interdisent.'\" Yahya a dit que Malik a parlé d'un homme qui a prêté de l'argent à un autre homme et ensuite le débiteur lui a demandé de le laisser avec lui comme un qirad. Malik a dit : \"Je n'aime pas cela à moins qu'il ne reprenne son argent de lui, et ensuite le lui paie comme un qirad s'il le souhaite ou s'il le souhaite le garde.\" Malik a parlé d'un investisseur qui a payé à un homme de l'argent qirad et l'homme lui a dit qu'il était collecté avec lui et lui a demandé de l'écrire pour lui comme un prêt. Il a dit : \"Je n'aime pas cela à moins qu'il ne prenne son argent de lui et ensuite le lui prête ou le garde comme il le souhaite. C'est seulement par crainte qu'il en ait perdu une partie, et veuille le différer pour qu'il puisse compenser ce qui a été perdu de celui-ci. C'est désapprouvé et n'est pas permis et ce n'est pas bon.\" Yahya a dit que Malik a parlé d'un investisseur payant de l'argent qirad à un agent qui a fait un profit et ensuite voulait prendre sa part du profit et l'investisseur était absent. Il a dit : \"Il ne devrait rien en prendre à moins que l'investisseur ne soit présent. S'il en prend quelque chose, il en est responsable jusqu'à ce que ce soit comptabilisé dans la division du capital.\" Malik a dit : \"Il n'est pas permis pour les parties impliquées dans un qirad de comptabiliser et de diviser la propriété qui est loin d'eux jusqu'à ce que le capital soit présent, et que l'investisseur reçoive le principal en entier. Ensuite ils divisent le profit en leurs portions convenues.\" Malik a parlé d'un homme prenant de l'argent qirad, et achetant des marchandises avec alors qu'il avait une dette. Ses créanciers l'ont cherché et l'ont trouvé alors qu'il était dans une ville loin de l'investisseur, et il avait une marchandise profitable dont la bonne qualité était claire. Ils voulaient qu'il vende la marchandise pour eux afin qu'ils puissent prendre sa part du profit. Malik a dit : \"Aucun profit du qirad n'est pris jusqu'à ce que l'investisseur soit présent. Il prend son principal et ensuite le profit est divisé mutuellement entre eux.\" Malik a parlé d'un investisseur qui a mis de l'argent qirad avec un agent et il l'a utilisé et a eu un profit. Ensuite le principal a été mis de côté et le profit divisé. Il a pris sa part et a ajouté la part de l'investisseur à son principal en présence de témoins qu'il avait appelés. Malik a dit : \"Il n'est pas permis de diviser le profit à moins que l'investisseur ne soit présent. S'il a pris quelque chose ici il le rend jusqu'à ce que l'investisseur ait reçu le principal en entier. Ensuite ce qui reste est divisé en leurs portions respectives.\" Malik a parlé d'un investisseur qui a mis de l'argent qirad avec un agent. L'agent l'a utilisé et est ensuite venu à l'investisseur et a dit : \"Ceci est ta portion du profit, et j'ai pris le semblable pour moi-même, et j'ai retenu ton principal en entier.\" Malik a dit : \"Je n'aime pas cela, à moins que tout le capital ne soit présent, que le principal soit là et qu'il sache qu'il est complet et qu'il le reçoive. Ensuite ils divisent le profit entre eux. Il lui retourne le principal s'il le souhaite, ou il le garde. La présence du principal est nécessaire par crainte que l'agent n'en ait perdu une partie, et puisse donc vouloir qu'il ne lui soit pas retiré et le garder dans sa main.\" Yahya a dit que Malik a parlé d'un investisseur qui a mis de l'argent qirad avec un agent qui a acheté des marchandises avec, et l'investisseur lui a dit de les vendre. L'agent a dit qu'il ne voyait aucun moyen de vendre à ce moment-là et ils se sont querellés à ce sujet. Il a dit : \"On ne regarde pas la déclaration de l'un ou l'autre d'eux. Les gens d'expérience et de perspicacité concernant de telles marchandises sont interrogés sur ces marchandises. S'ils peuvent voir un moyen de les vendre elles sont vendues pour eux. S'ils pensent qu'il est temps d'attendre, ils devraient attendre.\" Malik a parlé d'un homme qui a pris de l'argent qirad d'un investisseur et l'a utilisé et quand l'investisseur lui a demandé son argent, il a dit qu'il l'avait en entier. Quand il l'a tenu à son règlement il a admis que \"Tel et tel montant de celui-ci a été perdu avec moi,\" et il a nommé un montant d'argent. \"Je te l'ai dit pour que tu me le laisses.\" Malik a dit : \"Il ne bénéficie pas de le nier après avoir confirmé qu'il l'avait tout. Il est responsable par sa confession contre lui-même à moins qu'il ne produise des preuves sur la perte de cette propriété qui confirment sa déclaration. S'il ne produit pas une raison acceptable il est responsable par sa confession, et son déni ne lui sert à rien.\" Malik a dit : \"De même, s'il avait dit : 'J'ai eu tel et tel profit du capital,' et qu'ensuite le propriétaire du capital lui demandait de lui payer le principal et son profit, et qu'il disait qu'il n'avait pas eu de profit dedans et ne l'avait dit que pour qu'il puisse être laissé en sa possession, cela ne lui bénéficie pas. Il est tenu de rendre compte de ce qu'il a affirmé à moins qu'il n'apporte une preuve acceptable de sa parole, de sorte que la première déclaration ne soit pas contraignante pour lui.\" Malik a parlé d'un investisseur qui a mis de l'argent qirad avec un agent qui a fait un profit avec. L'agent a dit : \"J'ai pris le qirad de toi à condition que j'aie deux tiers.\" Le propriétaire du capital dit : \"Je t'ai donné un qirad à condition que tu aies un tiers.\" Malik a dit : \"La parole est la parole de l'agent, et il doit prêter serment sur cela si ce qu'il dit ressemble à la pratique connue du qirad ou en est proche. S'il apporte une affaire qui est inacceptable et que les gens ne font pas de qirads comme ça, il n'est pas cru, et il est jugé être selon comment un qirad comme lui serait normalement.\" Malik a parlé d'un homme qui a donné à un homme cent dinars comme qirad. Il a acheté des marchandises avec et est ensuite allé payer les cent dinars au propriétaire des marchandises et a trouvé qu'ils avaient été volés. L'investisseur dit : \"Vends les marchandises. S'il y a quelque chose en plus, c'est à moi. S'il y a une perte, c'est contre toi parce que tu l'as perdu.\" L'agent dit : \"Plutôt tu dois remplir ce que le vendeur est dû. Je les ai achetées avec ton capital que tu m'as donné.\" Malik a dit : \"L'agent est obligé de payer le prix au vendeur et on dit à l'investisseur : 'Si tu le souhaites, paie les cent dinars à l'agent et les marchandises sont entre vous. Le qirad est selon ce sur quoi le premier cent était basé. Si tu le souhaites, tu es libre des marchandises.' Si les cent dinars sont payés à l'agent, c'est un qirad selon les conditions du premier qirad. S'il refuse, les marchandises appartiennent à l'agent et il doit payer leur prix.\" Malik a parlé de deux personnes dans un qirad qui ont réglé et l'agent avait encore certaines des marchandises qu'il utilisait - un tissu élimé ou une outre à eau ou le semblable de cela. Malik a dit : \"Tout de cela qui est insignifiant n'a aucune importance et appartient à l'agent. Je n'ai entendu personne donner une décision appelant au retour de cela. Tout ce qui a un prix est retourné. Si c'est quelque chose qui a de la valeur comme un animal, un chameau, un tissu grossier ou le semblable de cela qui rapporte un prix, je pense qu'il devrait retourner ce qu'il a de reste de telles choses à moins que le propriétaire ne le néglige.\""
    },
    {
        "hadithnumber": 1392,
        "text": "Malik m'a rapporté de Ibn Shihab qu'il a interrogé Salim ibn Abdullah ibn Umar sur la location de champs. Il a dit : \"Il n'y a pas de mal à cela pour de l'or ou de l'argent.\" Ibn Shihab a dit : \"Je lui ai dit : 'Que penses-tu du hadith qui est mentionné de Rafi ibn Khadij ?'\" Il a dit : \"Rafi a exagéré. Si j'avais un champ, je le louerais.\""
    },
    {
        "hadithnumber": 1397,
        "text": "Malik m'a rapporté qu'il a entendu la même chose de Sulayman ibn Yasar. Malik a parlé d'un homme qui a racheté l'un des partenaires dans une propriété partagée, en payant l'homme avec un animal, un esclave, une esclave, ou l'équivalent de cela en marchandises. Ensuite un autre partenaire a décidé d'exercer son droit de préemption après cela, et il a trouvé que l'esclave ou l'esclave était morte, et personne ne savait quelle avait été sa valeur. L'acheteur a prétendu : \"La valeur de l'esclave ou de l'esclave était de 100 dinars.\" Le partenaire avec le droit de préemption a prétendu : \"La valeur était de 50 dinars.\" Malik a dit : \"L'acheteur prête serment que la valeur de ce qu'il a payé était de 100 dinars. Ensuite si celui avec le droit de préemption le souhaite, il peut le compenser, ou bien il peut le laisser, à moins qu'il ne puisse apporter une preuve claire que la valeur de l'esclave ou de l'esclave est moindre que ce que l'acheteur a dit. Si quelqu'un donne sa portion d'une maison ou d'une terre partagée et que le destinataire le rembourse pour cela par de l'argent ou des marchandises, les partenaires peuvent le prendre par préemption s'ils le souhaitent et payer au destinataire la valeur de ce qu'il a donné en dinars ou dirhams. Si quelqu'un fait un don de sa portion d'une maison ou d'une terre partagée, et ne prend aucune rémunération et ne cherche pas à le faire, et qu'un partenaire veut le prendre pour sa valeur, il ne peut pas le faire tant que le partenaire original n'a pas reçu de récompense pour cela. S'il y a une récompense, celui avec le droit de préemption peut l'avoir pour le prix de la récompense.\" Malik a parlé d'un homme qui a acheté dans un morceau de terre partagé pour un prix à crédit, et l'un des partenaires voulait le posséder par droit de préemption. Malik a dit : \"S'il semble probable que le partenaire peut respecter les termes, il a droit de préemption pour les mêmes termes de crédit. S'il est craint qu'il ne puisse pas respecter les termes, mais qu'il peut apporter un garant riche et fiable de statut égal à celui qui a acheté dans la terre, il peut aussi prendre possession.\" Malik a dit : \"L'absence d'une personne ne coupe pas son droit de préemption. Même s'il est au loin pour longtemps, il n'y a pas de limite de temps après laquelle le droit de préemption est coupé.\" Malik a dit que si un homme laissait de la terre à un certain nombre de ses enfants, puis l'un d'eux qui avait un enfant mourait et l'enfant du défunt vendait son droit dans cette terre, le frère du vendeur avait plus droit de le préempter que ses oncles paternels, les partenaires de son père. Malik a dit : \"C'est ce qui est fait dans notre communauté.\" Malik a dit : \"La préemption est partagée entre les partenaires selon leurs parts existantes. Chacun d'eux prend selon sa portion. Si elle est petite, il a peu. Si elle est grande, c'est selon cela. C'est s'ils sont tenaces et se disputent l'un avec l'autre à ce sujet.\" Malik a dit : \"Quant à un homme qui rachète la part de l'un de ses partenaires, et l'un des autres partenaires dit : 'Je prendrai une portion selon ma part,' et le premier partenaire dit : 'Si tu souhaites prendre toute la préemption, je te l'abandonnerai. Si tu souhaites la laisser, alors laisse-la.' Si le premier partenaire lui donne le choix et la lui remet, le second partenaire ne peut que prendre toute la préemption ou la rendre. S'il la prend, il y a droit. Sinon, il n'a rien.\" Malik a parlé d'un homme qui a acheté de la terre, et l'a développée en plantant des arbres ou en creusant un puits etc., et ensuite quelqu'un est venu, et voyant qu'il avait un droit dans la terre, voulait en prendre possession par préemption. Malik a dit : \"Il n'a pas de droit de préemption à moins qu'il ne compense l'autre pour ses dépenses. S'il lui donne le prix de ce qu'il a développé, il a droit à la préemption. Sinon, il n'a aucun droit en elle.\" Malik a dit que quelqu'un qui vendait sa portion d'une maison ou d'une terre partagée et ensuite, en apprenant que quelqu'un avec un droit de préemption devait prendre possession par ce droit, demandait à l'acheteur de révoquer la vente, et il le faisait, n'avait pas le droit de faire cela. Le préempteur a plus droit à la propriété pour le prix pour lequel il l'a vendue. Dans le cas de quelqu'un qui a acheté avec une section d'une maison ou d'une terre partagée, un animal et des marchandises (qui n'étaient pas partagés), de sorte que quand quelqu'un demandait son droit de préemption dans la maison ou la terre il disait : \"Prends ce que j'ai acheté tout ensemble, car je l'ai acheté tout ensemble,\" Malik a dit : \"Le préempteur n'a besoin de prendre possession que de la maison ou de la terre. Chaque chose que l'homme a achetée est évaluée selon sa part de la somme forfaitaire que l'homme a payée. Ensuite le préempteur prend possession de son droit pour un prix qui est approprié sur cette base. Il ne prend aucun animal ou marchandise à moins qu'il ne veuille faire cela.\" Malik a dit : \"Si quelqu'un vend une section de terre partagée, et l'un de ceux qui ont le droit de préemption la remet à l'acheteur et un autre refuse de faire autre chose que de prendre sa préemption, celui qui refuse de remettre doit prendre toute la préemption, et il ne peut pas prendre selon son droit et laisser ce qui reste. Dans le cas où l'un d'un certain nombre de partenaires dans une maison vendait sa part quand tous ses partenaires étaient absents sauf un homme, celui présent se voyait donner le choix soit de prendre la préemption soit de la laisser, et il disait : 'Je prendrai ma portion et laisserai les portions de mes partenaires jusqu'à ce qu'ils soient présents. S'ils la prennent, c'est cela. S'ils la laissent, je prendrai toute la préemption,' Malik a dit : 'Il ne peut que la prendre toute ou la laisser. Si ses partenaires viennent, ils peuvent prendre de lui ou la laisser comme ils le souhaitent. Si cela lui est offert et qu'il n'accepte pas, je pense qu'il n'a pas de préemption'\""
    },
    {
        "hadithnumber": 1402,
        "text": "Malik m'a rapporté que Rabia ibn Abi Abd ar-Rahman a dit : \"Un homme irakien vint devant Umar ibn al-Khattab et dit : 'Je suis venu à toi à cause d'une affaire qui n'a pas de commencement et pas de fin.' Umar dit : 'Qu'est-ce que c'est ?' L'homme dit : 'Le faux témoignage est apparu dans notre terre.' Umar dit : 'Est-ce vrai ?' Il dit : 'Oui.' Umar dit : 'Par Allah ! Un homme n'est pas détenu en Islam sans témoins justes'\""
    },
    {
        "hadithnumber": 1403,
        "text": "Malik m'a rapporté que Umar ibn al-Khattab a dit : \"Le témoignage de quelqu'un connu pour porter rancune ou pour être peu fiable n'est pas accepté.\""
    },
    {
        "hadithnumber": 1414,
        "text": "Yahya a dit : \"Malik nous a rapporté de Ibn Shihab, de Said ibn al-Musayyab, que le Messager d'Allah, paix et bénédictions sur lui, a dit : 'Le gage donné comme sécurité n'est pas perdu.'\" Malik a dit : \"L'explication de cela selon ce que nous pensons - et Allah sait mieux - est qu'un homme donne un gage à quelqu'un en sécurité pour quelque chose. Le gage est supérieur à ce pour quoi il l'a mis en gage. Le gageur dit au prêteur sur gages : 'Je t'apporterai ton dû, après tel et tel temps. Sinon, le gage est à toi pour ce pour quoi il a été mis en gage.'\" Malik a dit : \"Cette transaction n'est pas bonne et elle n'est pas halal. C'est ce qui a été interdit. Si le propriétaire apporte ce pour quoi il l'a mis en gage après la période, il est à lui. Je pense que la condition de temps est nulle.\""
    },
    {
        "hadithnumber": 1416,
        "text": "Yahya a dit qu'il a entendu Malik dire : \"Ce qui est fait dans notre communauté au sujet de quelqu'un qui a consommé un animal sans la permission de son propriétaire, est qu'il doit payer son prix le jour où il l'a consommé. Il n'est pas obligé de le remplacer par un animal similaire ni ne compense le propriétaire avec aucune sorte d'animal. Il doit payer son prix le jour où il a été consommé, et donner la valeur est plus équitable en compensation pour les animaux et les marchandises.\" Yahya a dit qu'il a entendu Malik dire au sujet de quelqu'un qui consomme de la nourriture sans la permission de son propriétaire : \"Il retourne au propriétaire un poids semblable du même genre de nourriture. La nourriture est dans la position de l'or et de l'argent. L'or et l'argent sont retournés avec de l'or et de l'argent. L'animal n'est pas dans la position de l'or en cela. Ce qui distingue entre eux est la sunna et le comportement qui est en vigueur. Yahya a dit qu'il a entendu Malik dire : \"Si un homme se voit confier une richesse et ensuite commerce avec elle pour lui-même et fait un profit, le profit est à lui parce qu'il est responsable de la propriété jusqu'à ce qu'il la retourne à son propriétaire.\" Yahya m'a rapporté de Malik, de Zayd ibn Aslam, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Si quelqu'un change sa religion - frappez son cou !\" Le sens de la déclaration du Prophète, paix et bénédictions sur lui, à notre avis et Allah sait mieux, est que \"si quelqu'un change sa religion, frappez son cou !\" fait référence à ceux qui quittent l'Islam pour autre chose que lui - comme les hérétiques et leurs semblables, au sujet de qui c'est connu. Ils sont tués sans être appelés au repentir parce que leur repentir n'est pas reconnu. Ils cachaient leur mécréance et publiaient leur Islam, donc je ne pense pas qu'on appelle de telles personnes au repentir, et on n'accepte pas leur parole. Quant à celui qui sort de l'Islam vers autre chose et le divulgue, on l'appelle au repentir. S'il ne se tourne pas en repentir, il est tué. S'il y a des gens dans cette situation, je pense qu'on devrait les appeler à l'Islam et les appeler au repentir. S'ils se tournent en repentir, cela est accepté d'eux. S'ils ne se tournent pas en repentir, ils sont tués. Cela ne fait pas référence comme nous le voyons, et Allah sait mieux, à ceux qui sortent du Judaïsme vers le Christianisme ou du Christianisme vers le Judaïsme, ni à quelqu'un qui change sa religion des diverses formes de religion sauf pour l'Islam. Quiconque sort de l'Islam vers autre que lui et divulgue cela, c'est celui qui est visé, et Allah sait mieux.\""
    },
    {
        "hadithnumber": 1424,
        "text": "Malik m'a rapporté qu'il avait entendu que Umar ibn al-Khattab ou Uthman ibn Affan donna un jugement au sujet d'une femme esclave qui a induit un homme en erreur sur elle-même et a dit qu'elle était libre. Il l'a épousée et elle a porté des enfants. Il a été décidé qu'il devrait racheter ses enfants avec leur semblable d'esclaves. Yahya a dit qu'il a entendu Malik dire : \"Les racheter avec leur prix est plus équitable dans ce cas, si Allah le veut.\""
    }
]