[
    {
        "hadithnumber": 357,
        "text": "Yahya m'a rapporté de Malik, de Abu'n-Nadr, le mawla de Umar ibn Ubaydullah, que Abu Murra, le mawla de Aqil ibn Abi Talib, lui a dit qu'il avait entendu Umm Hani bint Abi Talib dire : \"Je suis allée voir le Messager d'Allah, paix et bénédictions sur lui, l'année de la conquête et je l'ai trouvé en train de faire le ghusl alors que sa fille Fatima le cachait avec un vêtement. Je lui ai dit : 'Paix sur toi' et il a dit : 'Qui est-ce ?' J'ai répondu : 'Umm Hani bint Abi Talib', et il a dit : 'Bienvenue, Umm Hani !' Quand il eut fini son ghusl, il se leva et pria huit rakas, se couvrant d'un seul vêtement, puis s'éloigna. Je dis : 'Messager d'Allah, le fils de ma mère, Ali, dit qu'il est déterminé à tuer un tel, fils de Hubayra, un homme que j'ai placé sous ma protection.' Le Messager d'Allah, paix et bénédictions sur lui, dit : 'Nous accordons la protection à quiconque tu as accordé la protection, Umm Hani.'\" Umm Hani a raconté que cet incident s'est produit le matin."
    },
    {
        "hadithnumber": 363,
        "text": "Yahya m'a rapporté de Malik, de Abu'n-Nadr, le mawla de Umar ibn Ubaydullah, de Busr ibn Said, que Zayd ibn Khalid al-Juhani l'envoya à Abu Juhaym pour lui demander ce qu'il avait entendu du Messager d'Allah, paix et bénédictions sur lui, au sujet de passer devant quelqu'un qui prie. Abu Juhaym dit : \"Le Messager d'Allah, paix et bénédictions sur lui, a dit : 'Si celui qui passe devant un homme qui prie savait ce qu'il s'attire, il serait préférable pour lui de s'arrêter pendant quarante plutôt que de passer devant lui.'\" Abu'n-Nadr a dit : \"Je ne sais pas s'il a dit quarante jours ou mois ou années.\""
    },
    {
        "hadithnumber": 364,
        "text": "Yahya m'a rapporté de Malik, de Zayd ibn Aslam, de Ata ibn Yasar, que Kab al-Ahbar a dit : \"Si la personne qui passait devant un homme qui prie savait ce qu'il s'attirait, il serait préférable pour lui de s'enfoncer dans le sol plutôt que de passer devant lui.\""
    },
    {
        "hadithnumber": 365,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Abdullah ibn Umar désapprouvait le fait de passer devant des femmes pendant qu'elles priaient."
    },
    {
        "hadithnumber": 369,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Ali ibn Abi Talib a dit : \"Les choses qui passent devant un homme qui prie n'annulent pas sa prière.\""
    },
    {
        "hadithnumber": 370,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, de Salim ibn Abdullah, que Abdullah ibn Umar disait : \"Les choses qui passent devant un homme qui prie n'annulent pas sa prière.\""
    },
    {
        "hadithnumber": 371,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que Abdullah ibn Umar utilisait l'animal qu'il montait comme sutra (barrière) lorsqu'il priait."
    },
    {
        "hadithnumber": 397,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Abi Bakr ibn Hazim, de son père, que Amr ibn Sulaym az-Zuraqi a dit : \"Abu Humayd as-Saidi m'a dit qu'ils ont demandé au Messager d'Allah, paix et bénédictions sur lui, comment ils devaient prier pour lui (demander des bénédictions sur lui) et il répondit qu'ils devaient dire : 'Ô Allah, bénis Muhammad et ses épouses et sa descendance comme Tu as béni la famille d'Ibrahim, et accorde la baraka à Muhammad et à ses épouses et à sa descendance comme Tu as accordé la baraka à la famille d'Ibrahim. Tu es Digne de Louange et Glorieux.'\" (Allahumma salli ala Muhammad wa azwajihi wa alihi kama sallaita ala ali Ibrahim, wa barik ala Muhammad wa azwajihi wa alihi kama barakta ala ali Ibrahim, innaka Hamidun Majid)."
    },
    {
        "hadithnumber": 400,
        "text": "Yahya m'a rapporté de Malik, de Nafi, de Ibn Umar, que le Messager d'Allah, paix et bénédictions sur lui, avait l'habitude de prier deux rakas avant le dhuhr et deux rakas après, deux rakas après le maghrib, dans sa maison, et deux rakas après le isha. Il ne priait pas après le vendredi (jumua) jusqu'à ce qu'il soit parti, et alors il priait deux rakas."
    },
    {
        "hadithnumber": 419,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, de Said ibn al-Musayyab, que Umar ibn al-Khattab et Uthman ibn Affan, qu'Allah soit satisfait d'eux, faisaient de même."
    },
    {
        "hadithnumber": 434,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, que Said al-Musayyab lui a dit qu'on disait aux gens de manger le jour du Fitr avant de sortir. Malik a dit qu'il ne considérait pas que les gens devaient faire cela pour le Adha."
    },
    {
        "hadithnumber": 441,
        "text": "Yahya m'a rapporté que Malik a dit : \"La sunna concernant l'heure de la prière les jours de l'Aïd al-Fitr et al-Adha - et il n'y a pas de désaccord parmi nous à ce sujet - est que l'imam quitte sa maison et dès qu'il a atteint le lieu de prière, la prière est due.\" Yahya a dit que l'on demanda à Malik si un homme qui priait avec l'imam pouvait partir avant le prêche (khutba), et il dit : \"Il ne doit pas partir avant que l'imam ne parte.\" Yahya m'a rapporté de Malik, de Yazid ibn Ruman, de Salih ibn Khawwat, de quelqu'un qui avait prié (la prière de la peur) avec le Messager d'Allah, paix et bénédictions sur lui, le jour de Dhat ar-Riqa, qu'un groupe avait formé un rang avec lui et un groupe avait formé un rang face à l'ennemi. Il pria alors une raka avec le groupe avec lequel il était, puis resta debout pendant qu'ils finissaient par eux-mêmes. Ils partirent ensuite et formèrent un rang face à l'ennemi, puis l'autre groupe vint et il pria la raka restante de sa prière avec eux, puis resta assis pendant qu'ils finissaient par eux-mêmes. Puis il fit le taslim avec eux."
    },
    {
        "hadithnumber": 453,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que le Messager d'Allah, paix et bénédictions sur lui, disait : \"Quand un nuage apparaît de la direction de la mer et va ensuite vers le Sham (Syrie/Levant), ce sera une source abondante de pluie.\""
    },
    {
        "hadithnumber": 477,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, que son père a dit que Abasa (Sourate 80) a été révélée au sujet de Abdullah ibn Umm Maktum. Il vint au Prophète, paix et bénédictions sur lui, et commença à dire : \"Ô Muhammad, montre-moi une place près de toi (où je peux m'asseoir),\" alors que l'un des notables des idolâtres était en audience avec le Prophète, paix et bénédictions sur lui. Le Prophète, paix et bénédictions sur lui, commença à se détourner de lui et à donner son attention à l'autre homme, et il lui dit : \"Père d'un tel, vois-tu un mal dans ce que je dis ?\" et il dit : \"Non, par le sang (de nos sacrifices), je ne vois aucun mal dans ce que tu dis.\" Et Abasa - \"Il s'est renfrogné et s'est détourné parce que l'aveugle est venu à lui\" - fut révélée."
    },
    {
        "hadithnumber": 480,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu qu'il fallut huit ans à Abdullah ibn Umar pour apprendre la Sourate al-Baqara."
    },
    {
        "hadithnumber": 518,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Dinar, de Abdullah ibn Umar, que Umar ibn al-Khattab disait : \"N'ayez pas l'intention de faire votre prière au lever ou au coucher du soleil, car les cornes de Satan se lèvent avec le lever du soleil et se couchent avec son coucher.\" Umar battait les gens pour ce genre de prière."
    },
    {
        "hadithnumber": 520,
        "text": "Yahya m'a rapporté de Malik, de Jafar ibn Muhammad, de son père, que le Messager d'Allah, paix et bénédictions sur lui, fut lavé dans une longue chemise."
    },
    {
        "hadithnumber": 524,
        "text": "Traduction du hadith non disponible"
    },
    {
        "hadithnumber": 528,
        "text": "Yahya m'a rapporté de Muhammad ibn al-Munkadir, que Rabia ibn Abdullah ibn al-Hadir lui a dit qu'il avait vu Umar ibn al-Khattab diriger les gens devant le brancard (cercueil) aux funérailles de Zaynab bint Jahsh."
    },
    {
        "hadithnumber": 529,
        "text": "Yahya m'a rapporté de Malik que Hisham ibn Urwa a dit : \"Je n'ai vu mon père que devant un cortège funèbre.\" Il ajouta : \"Puis il venait au Baqi et s'asseyait jusqu'à ce que le cortège le dépasse.\""
    },
    {
        "hadithnumber": 530,
        "text": "Yahya m'a rapporté de Malik que Ibn Shihab a dit : \"Marcher derrière le brancard est en contradiction avec la sunna.\""
    },
    {
        "hadithnumber": 532,
        "text": "Yahya m'a rapporté de Malik, de Said ibn Abi Said al-Maqburi, que Abu Hurayra a interdit à quiconque de le suivre avec une torche allumée après sa mort. Yahya a dit : \"J'ai entendu Malik désapprouver cela.\""
    },
    {
        "hadithnumber": 577,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abu Hurayra a dit : \"Hâtez vos funérailles, car c'est seulement vers un bien que vous le faites avancer, ou un mal que vous retirez de vos cous.\""
    },
    {
        "hadithnumber": 578,
        "text": "Yahya m'a rapporté de Malik, de Amr ibn Yahya al-Mazini, que son père a dit qu'il avait entendu Abu Said al-Khudri dire que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Il n'y a pas de zakat sur moins de cinq chameaux, il n'y a pas de zakat sur moins de cinq awaq (deux cents dirhams d'argent pur) et il n'y a pas de zakat sur moins de cinq awsuq (trois cents sa).\""
    },
    {
        "hadithnumber": 579,
        "text": "Yahya m'a rapporté de Malik, de Muhammad ibn Abdullah ibn Abd ar-Rahman ibn Abi Sa'sa'a al-Ansari, de al-Mazini, de son père, de Abu Said al-Khudri, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Il n'y a pas de zakat sur moins de cinq awsuq de dattes, il n'y a pas de zakat sur moins de cinq awaq d'argent et il n'y a pas de zakat sur moins de cinq chameaux.\""
    },
    {
        "hadithnumber": 594,
        "text": "Yahya m'a rapporté de Malik, de Ayyub ibn Abi Tamima as-Sakhtayani, que Umar ibn Abd al-Aziz, écrivant au sujet de la richesse que l'un de ses gouverneurs avait collectée injustement, ordonna qu'elle soit rendue à son propriétaire et que la zakat en soit prélevée pour les années qui s'étaient écoulées. Puis, peu de temps après, il révisa son ordre avec un message disant que la zakat ne devait en être prélevée qu'une seule fois, puisque ce n'était pas une richesse en main (disponible).\""
    },
    {
        "hadithnumber": 595,
        "text": "Yahya m'a rapporté de Malik, de Yazid ibn Khusayfa, qu'il avait demandé à Sulayman ibn Yasar si la zakat était due par un homme qui avait de la richesse en main mais devait aussi une dette du même montant, et il répondit : \"Non.\" Malik a dit : \"La position sur laquelle nous sommes d'accord concernant une dette est que le prêteur ne paie pas de zakat dessus jusqu'à ce qu'il la récupère. Même si elle reste chez l'emprunteur pendant plusieurs années avant que le prêteur ne la collecte, le prêteur ne doit payer la zakat dessus qu'une seule fois. S'il collecte un montant de la dette qui n'est pas imposable (zakatable), et a d'autres richesses qui sont imposables, alors ce qu'il a collecté de la dette est ajouté au reste de sa richesse et il paie la zakat sur la somme totale.\" Malik continua : \"S'il n'a pas d'argent liquide autre que ce qu'il a collecté de sa dette, et que cela n'atteint pas un montant imposable, alors il n'a pas à payer de zakat. Il doit cependant tenir un registre du montant qu'il a collecté et si, plus tard, il collecte un autre montant qui, une fois ajouté à ce qu'il a déjà collecté, rend la zakat effective, alors il doit payer la zakat dessus.\" Malik continua : \"La zakat est due sur ce premier montant, ainsi que sur ce qu'il a collecté en plus de la dette qui lui est due, qu'il ait ou non utilisé ce qu'il a collecté en premier. Si ce qu'il reprend atteint vingt dinars d'or, ou deux cents dirhams d'argent, il paie la zakat dessus. Il paie la zakat sur tout ce qu'il reprend après cela, que ce soit un grand ou un petit montant, selon le montant.\" Malik a dit : \"Ce qui montre que la zakat n'est prélevée qu'une seule fois sur une dette qui est hors de main depuis quelques années avant d'être recouvrée, c'est que si des marchandises restent chez un homme à des fins commerciales pendant quelques années avant qu'il ne les vende, il n'a à payer la zakat sur leurs prix qu'une seule fois. C'est parce que celui à qui la dette est due, ou qui possède les marchandises, ne devrait pas avoir à prélever la zakat sur la dette, ou les marchandises, à partir d'autre chose, puisque la zakat sur toute chose n'est prélevée que sur la chose elle-même, et non sur autre chose.\" Malik a dit : \"Notre position concernant quelqu'un qui doit une dette, et a des marchandises qui valent assez pour payer la dette, et a aussi un montant d'argent liquide qui est imposable, est qu'il paie la zakat sur l'argent liquide qu'il a en main. Si, cependant, il n'a que suffisamment de marchandises et d'argent liquide pour payer la dette, alors il n'a pas à payer de zakat. Mais si l'argent liquide qu'il a atteint un montant imposable au-delà du montant de la dette qu'il doit, alors il doit payer la zakat dessus.\""
    },
    {
        "hadithnumber": 597,
        "text": "Yahya m'a rapporté de Malik que Abdullah ibn Dinar a dit : \"J'ai entendu Abdullah ibn Umar à qui l'on demandait ce qu'était le kanz (trésor) et il a dit : 'C'est une richesse sur laquelle la zakat n'a pas été payée.'\""
    },
    {
        "hadithnumber": 598,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Dinar, de Abu's-Salih as-Samman, que Abu Hurayra disait : \"Quiconque a une richesse sur laquelle il n'a pas payé la zakat trouvera, le Jour de la Résurrection, sa richesse transformée pour ressembler à un serpent à tête blanche avec une poche de venin dans chaque joue qui le cherchera jusqu'à ce qu'il l'ait en son pouvoir, disant : 'Je suis la richesse que tu avais cachée.'\""
    },
    {
        "hadithnumber": 600,
        "text": "Yahya m'a rapporté de Malik, de Humayd ibn Qays al-Makki, de Tawus al-Yamani, que de trente vaches, Muadh ibn Jabal prenait une vache dans sa deuxième année, et de quarante vaches, une vache dans sa troisième ou quatrième année, et quand moins que cela (c'est-à-dire trente vaches) lui était apporté, il refusait d'en prendre quoi que ce soit. Il dit : \"Je n'ai rien entendu à ce sujet de la part du Messager d'Allah, paix et bénédictions sur lui. Quand je le rencontrerai, je le lui demanderai.\" Mais le Messager d'Allah, paix et bénédictions sur lui, mourut avant que Muadh ibn Jabal ne revienne. Yahya a dit que Malik a dit : \"Le mieux que j'ai entendu au sujet de quelqu'un qui a des moutons ou des chèvres avec deux bergers ou plus dans des endroits différents est qu'ils sont additionnés et le propriétaire paie alors la zakat sur eux. C'est la même situation qu'un homme qui a de l'or et de l'argent dispersés entre les mains de diverses personnes. Il doit tout additionner et payer toute zakat qu'il y a à payer sur la somme totale.\" Yahya a dit que Malik a dit, au sujet d'un homme qui avait à la fois des moutons et des chèvres, qu'ils étaient additionnés ensemble pour que la zakat soit évaluée, et si entre eux ils arrivaient à un nombre sur lequel la zakat était due, il payait la zakat sur eux. Malik ajouta : \"Ils sont tous considérés comme des moutons, et dans le livre de Umar ibn al-Khattab il est dit : 'Sur les moutons et les chèvres en pâturage, s'ils arrivent à quarante ou plus, une brebis.'\" Malik a dit : \"S'il y a plus de moutons que de chèvres et que leur propriétaire n'a à payer qu'une brebis, le collecteur de zakat prend la brebis des moutons. S'il y a plus de chèvres que de moutons, il la prend des chèvres. S'il y a un nombre égal de moutons et de chèvres, il prend la brebis de l'espèce qu'il souhaite.\" Yahya a dit que Malik a dit : \"De même, les chameaux arabes et les chameaux de Bactriane sont additionnés ensemble afin d'évaluer la zakat que le propriétaire a à payer. Ils sont tous considérés comme des chameaux. S'il y a plus de chameaux arabes que de chameaux de Bactriane et que le propriétaire n'a à payer qu'un chameau, le collecteur de zakat le prend des chameaux arabes. Si, cependant, il y a plus de chameaux de Bactriane, il le prend de ceux-ci. S'il y a un nombre égal des deux, il prend le chameau de l'espèce qu'il souhaite.\" Malik a dit : \"De même, les vaches et les buffles d'eau sont additionnés ensemble et sont tous considérés comme du bétail. S'il y a plus de vaches que de buffles d'eau et que le propriétaire n'a à payer qu'une vache, le collecteur de zakat la prend des vaches. S'il y a plus de buffles d'eau, il la prend d'eux. S'il y a un nombre égal des deux, il prend la vache de l'espèce qu'il souhaite. Donc si la zakat est nécessaire, elle est évaluée en prenant les deux espèces comme un seul groupe.\" Yahya a dit que Malik a dit : \"Aucune zakat n'est due par quiconque entre en possession de bétail, que ce soit des chameaux ou du bétail ou des moutons et des chèvres, jusqu'à ce qu'une année se soit écoulée sur eux depuis le jour où il les a acquis, à moins qu'il n'ait déjà en sa possession un nisab de bétail. (Le nisab est le montant minimum sur lequel la zakat doit être payée, soit cinq têtes de chameaux, soit trente têtes de bétail, soit quarante moutons et chèvres). S'il avait déjà cinq têtes de chameaux, ou trente têtes de bétail, ou quarante moutons et chèvres, et qu'il a ensuite acquis des chameaux, ou du bétail, ou des moutons et des chèvres supplémentaires, que ce soit par le commerce, ou un don, ou un héritage, il doit payer la zakat sur eux lorsqu'il paie la zakat sur le bétail qu'il a déjà, même si une année ne s'est pas écoulée sur l'acquisition. Et même si le bétail supplémentaire qu'il a acquis a eu la zakat prélevée dessus le jour avant qu'il ne l'achète, ou le jour avant qu'il ne l'hérite, il doit quand même payer la zakat dessus lorsqu'il paie la zakat sur le bétail qu'il a déjà.\" Yahya a dit que Malik a dit : \"C'est la même situation que quelqu'un qui a de l'argent sur lequel il paie la zakat et qu'il utilise ensuite pour acheter des marchandises à quelqu'un d'autre. Il doit ensuite payer la zakat sur ces marchandises lorsqu'il les vend. Il se pourrait qu'un homme doive payer la zakat sur elles un jour, et que le lendemain l'autre homme doive aussi payer.\" Malik a dit, dans le cas d'un homme qui avait des moutons et des chèvres qui n'atteignaient pas le montant imposable, et qui a ensuite acheté ou hérité d'un nombre supplémentaire de moutons et de chèvres bien au-dessus du montant imposable, qu'il n'avait pas à payer de zakat sur tous ses moutons et chèvres jusqu'à ce qu'une année se soit écoulée sur eux depuis le jour où il a acquis les nouveaux animaux, qu'il les ait achetés ou hérités. C'était parce qu'aucun du bétail qu'un homme avait, que ce soit des chameaux, ou du bétail, ou des moutons et des chèvres, n'était compté comme un nisab jusqu'à ce qu'il y en ait assez d'une seule espèce pour qu'il ait à payer la zakat dessus. C'était le nisab qui est utilisé pour évaluer la zakat sur ce que le propriétaire avait acquis en plus, que ce soit une grande ou une petite quantité de bétail. Malik a dit : \"Si un homme a assez de chameaux, ou de bétail, ou de moutons et de chèvres, pour qu'il ait à payer la zakat sur chaque espèce, et qu'il acquiert ensuite un autre chameau, ou vache, ou mouton, ou chèvre, il doit être inclus avec le reste de ses animaux lorsqu'il paie la zakat sur eux.\" Yahya a dit que Malik a dit : \"C'est ce que j'aime le plus de ce que j'ai entendu à ce sujet.\" Malik a dit, dans le cas d'un homme qui n'a pas l'animal requis de lui pour la zakat : \"Si c'est une chamelle de deux ans qu'il n'a pas, un chameau mâle de trois ans est pris à la place. Si c'est une chamelle de trois ou quatre ou cinq ans qu'il n'a pas, alors il doit acheter l'animal requis afin qu'il donne au collecteur ce qui est dû. Je n'aime pas que le propriétaire donne au collecteur la valeur équivalente.\" Malik a dit, au sujet des chameaux utilisés pour le transport de l'eau, et du bétail utilisé pour faire tourner les roues à eau ou labourer : \"À mon avis, de tels animaux sont inclus lors de l'évaluation de la zakat.\""
    }
]