[
    {
        "hadithnumber": 1426,
        "text": "Malik m'a rapporté de Nafi que Safiyya bint Abi Ubayd l'a informé que Umar ibn al-Khattab a dit : \"Quel est le problème avec les hommes qui ont des rapports sexuels avec leurs esclaves-filles et ensuite les laissent aller ? Il ne m'arrive jamais qu'une esclave-fille vienne à moi dont le maître confesse qu'il a eu des rapports sexuels avec elle, sans que je ne connecte son enfant à lui, qu'il ait pratiqué le coït interrompu ou cessé d'avoir des rapports avec elle ou non.\" Yahya a dit qu'il a entendu Malik dire : \"Ce qui est fait dans notre communauté au sujet d'une umm walad qui commet un crime est que son maître est responsable de ce qu'elle a fait jusqu'à concurrence de sa valeur. Il n'a pas à la surrender, et on ne peut lui faire supporter plus que sa valeur pour son crime.\""
    },
    {
        "hadithnumber": 1430,
        "text": "Malik m'a rapporté de Abu'z-Zinad, de al-Araj, de Abu Hurayra que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"L'excédent d'eau n'est pas retenu afin d'empêcher l'herbage de pousser.\""
    },
    {
        "hadithnumber": 1437,
        "text": "Yahya a dit qu'il a entendu Malik parler d'un homme qui est mort et a laissé des propriétés à Aliya et Safila (districts périphériques de Médine). Il a dit : \"La terre non irriguée arrosée naturellement n'est pas dans la même catégorie que la terre irriguée à moins que la famille ne soit satisfaite de cela. La terre non irriguée n'est dans la même catégorie que la terre avec une source que quand elle lui ressemble. Quand les propriétés sont dans une seule terre, et sont proches les unes des autres, chaque propriété individuelle est évaluée et ensuite divisée entre les héritiers. Les demeures et les maisons sont dans la même position.\" Yahya m'a rapporté de Malik, de Ibn Shihab, de Haram ibn Sad ibn Muhayyisa qu'une chamelle de al-Bara ibn Azib entra dans le jardin d'un homme et lui fit quelques dégâts. Le Messager d'Allah, paix et bénédictions sur lui, donna un jugement selon lequel les gens du jardin étaient responsables de le garder le jour, et le propriétaire des animaux était responsable de ce que les animaux détruisaient la nuit."
    },
    {
        "hadithnumber": 1438,
        "text": "Malik m'a rapporté de Hisham ibn Urwa, de son père, de Yahya ibn Abd ar-Rahman ibn Hatib que des esclaves de Hatib volèrent une chamelle appartenant à un homme de la tribu Muzayna et ils l'égorgèrent. L'affaire fut portée devant Umar ibn al-Khattab, et Umar ordonna à Kathir ibn as-Salt de couper leurs mains. Ensuite Umar dit à Habib : \"Je pense que tu dois les affamer,\" et il ajouta : \"Par Allah ! Je te ferai payer une amende telle qu'elle sera lourde pour toi.\" Il demanda à l'homme de la tribu Muzayna : \"Quel était le prix de ta chamelle ?\" Le Muzayni dit : \"Par Allah, j'ai refusé de la vendre pour 400 dirhams.\" Umar dit : \"Donne-lui 800 dirhams.\" Yahya a dit qu'il a entendu Malik dire : \"Doubler le prix n'est pas le comportement de notre communauté. Ce sur quoi les gens se sont accordés parmi nous est que l'homme est obligé de payer la valeur de la chamelle ou de l'animal le jour où il l'a pris.\""
    },
    {
        "hadithnumber": 1441,
        "text": "Malik m'a rapporté de Ibn Shihab, de Urwa ibn az-Zubayr, de Abd ar-Rahman ibn Abd al-Qari que Umar ibn al-Khattab a dit : \"Quel est le problème avec les hommes qui donnent des cadeaux à leurs fils et ensuite les gardent et si le fils meurt, ils disent : 'Ma propriété est en ma possession et je ne l'ai donnée à personne.' Mais s'ils meurent eux-mêmes, ils disent : 'Cela appartient à mon fils, je le lui ai donné.' Quiconque donne un cadeau, et ne le remet pas à celui à qui il a été donné, le cadeau est invalide, et s'il meurt, il appartient aux héritiers en général.\""
    },
    {
        "hadithnumber": 1446,
        "text": "Malik m'a rapporté de Rabia ibn Abi Abd ar-Rahman, de Yazid, le mawla de al-Munbaith, que Zayd ibn Khalid al-Juhani a dit : \"Un homme vint au Messager d'Allah, paix et bénédictions sur lui, et l'interrogea sur les objets trouvés. Il dit : 'Mémorise les caractéristiques de l'objet trouvé, puis fais-le savoir publiquement pendant un an. Si le propriétaire vient, donne-le-lui. Sinon, alors c'est ton affaire.' Il dit : 'Et au sujet des moutons perdus, Messager d'Allah ?' Il dit : 'Ils sont à toi, à ton frère ou au loup.' Il dit : 'Et le chameau perdu ?' Il dit : 'Ce n'est pas ton affaire. Il a son eau et ses pieds. Il atteindra l'eau et mangera des arbres jusqu'à ce que son propriétaire le trouve.'\""
    },
    {
        "hadithnumber": 1448,
        "text": "Malik m'a rapporté de Nafi qu'un homme trouva quelque chose et alla voir Abdullah ibn Umar et lui dit : \"J'ai trouvé quelque chose. Que penses-tu que je devrais faire à ce sujet ?\" Abdullah ibn Umar lui dit : \"Fais-le savoir publiquement !\" Il dit : \"Je l'ai fait.\" Il dit : \"Fais-le encore.\" Il dit : \"Je l'ai fait.\" Abdullah dit : \"Je ne t'ordonne pas de l'utiliser. Si tu voulais, tu aurais pu le laisser.\""
    },
    {
        "hadithnumber": 1458,
        "text": "Malik m'a rapporté de Ibn Shihab, de Amir ibn Sad ibn Abi Waqqas que son père a dit : \"Le Messager d'Allah, paix et bénédictions sur lui, est venu me voir pour me soigner d'une douleur qui devenait dure à supporter l'année du pèlerinage d'adieu. J'ai dit : 'Messager d'Allah, tu peux voir à quel point la douleur m'a atteint. J'ai de la propriété et seule ma fille hérite de moi. Donnerai-je deux tiers de ma propriété comme sadaqa ?' Le Messager d'Allah, paix et bénédictions sur lui, a dit : 'Non.' J'ai dit : 'La moitié ?' Il a dit : 'Non.' Ensuite le Messager d'Allah, paix et bénédictions sur lui, a dit : 'Un tiers, et un tiers est beaucoup. Laisser tes héritiers riches vaut mieux que de les laisser pauvres à mendier des gens. Tu ne dépenses jamais rien en entretien désirant le Visage d'Allah par cela, sans que tu sois récompensé pour cela, même ce que tu mets dans la bouche de ta femme.' Sad a dit : 'Messager d'Allah, serai-je laissé ici à La Mecque après que mes compagnons seront partis pour Médine ?' Le Messager d'Allah, paix et bénédictions sur lui, a dit : 'Si tu es laissé derrière, et que tu fais de bonnes actions tu augmenteras ton degré et ton élévation par elles. Peut-être seras-tu laissé derrière pour que certains gens puissent bénéficier de toi et d'autres puissent être lésés par toi. Ô Allah ! Complète leur hijra pour mes compagnons, et ne les fais pas retourner sur leurs talons. Le malheureux est Said ibn Khawla.' Le Messager d'Allah, paix et bénédictions sur lui, était affligé à son sujet car il était mort à La Mecque.\" Yahya a dit qu'il a entendu Malik parler d'un homme qui a légué un tiers de sa propriété à un homme et a dit aussi : \"Mon esclave servira un tel (un autre homme) aussi longtemps qu'il vivra, ensuite il est libre,\" puis cela a été examiné, et l'esclave a été trouvé être un tiers de la propriété du défunt. Malik a dit : \"Le service de l'esclave est évalué. Ensuite les deux le divisent entre eux. Celui à qui on a légué un tiers prend son tiers, comme une part, et celui à qui on a légué le service de l'esclave prend ce qui a été évalué pour lui du service de l'esclave. Chacun d'eux prend, du service de l'esclave ou de son salaire s'il a un salaire, selon sa part. Si celui à qui on a donné le service de l'esclave aussi longtemps qu'il vivait meurt, alors l'esclave est libéré.\" Yahya a dit qu'il a entendu Malik parler de quelqu'un qui a légué son tiers et a dit \"Un tel a tel et tel, et un tel a tel et tel,\" nommant une partie de sa propriété, et ses héritiers ont protesté que c'était plus d'un tiers.\" Malik a dit : \"Les héritiers ont alors une option entre donner aux bénéficiaires leurs legs complets et prendre le reste de la propriété du défunt, ou entre diviser parmi les bénéficiaires le tiers de la propriété du défunt et leur remettre leur tiers. S'ils le souhaitent, leurs droits en cela vont aussi loin qu'ils vont.\""
    },
    {
        "hadithnumber": 1460,
        "text": "Malik m'a rapporté que Yahya ibn Said a dit qu'il a entendu al-Qasim ibn Muhammad dire : \"Une femme des Ansar était mariée à Umar ibn al-Khattab. Elle lui donna Asim ibn Umar, et ensuite il se sépara d'elle. Umar vint à Quba et trouva son fils Asim jouant dans la cour de la mosquée. Il le prit par le bras et le plaça devant lui sur sa monture. La grand-mère de l'enfant le vit et se disputa avec Umar au sujet de l'enfant alors ils allèrent voir Abu Bakr as-Siddiq. Umar dit : 'Mon fils.' La femme dit : 'Mon fils.' Abu Bakr dit : 'N'interfère pas entre un enfant et sa mère.' Umar ne répéta pas ses mots.\" Yahya a dit qu'il a entendu Malik dire : \"C'est ce que j'aurais fait dans cette situation.\""
    },
    {
        "hadithnumber": 1461,
        "text": "Yahya a dit qu'il a entendu Malik parler d'un homme qui achetait des marchandises - animaux ou vêtements ou articles, et la vente était trouvée ne pas être permise donc elle était révoquée et celui qui avait pris les marchandises recevait l'ordre de rendre ses marchandises au propriétaire. Malik a dit : \"Le propriétaire des marchandises n'a que leur valeur le jour où elles lui ont été prises, et non le jour où elles lui sont retournées. C'est parce que l'homme est responsable d'elles depuis le jour où il les a prises et toute perte en elles après cela est contre lui. Pour cette raison, leur augmentation et croissance sont aussi à lui. Un homme peut prendre les marchandises à un moment où elles se vendent bien et sont en demande, et ensuite avoir à les retourner à un moment où elles ont baissé de prix et personne n'en veut. Par exemple, l'homme peut prendre les marchandises de l'autre homme, et les vendre pour dix dinars ou les garder tandis que leur prix est cela. Puis il peut avoir à les retourner alors que leur prix n'est qu'un dinar. Il ne devrait pas partir avec neuf dinars de la propriété de l'homme. Ou peut-être sont-elles prises par l'homme, et il les vend pour un dinar ou les garde, tandis que leur prix n'est qu'un dinar, ensuite il a à les retourner, et leur valeur le jour où il les retourne est dix dinars. Celui qui les a prises n'a pas à payer neuf dinars de sa propriété au propriétaire. Il est seulement obligé de payer la valeur de ce dont il a pris possession le jour où cela a été pris.\" Il a dit : \"Une partie de ce qui clarifie cela est que quand un voleur vole des marchandises, seul leur prix le jour où il les a volées est regardé. Si couper la main est nécessaire à cause de cela, c'est fait. Si le coupage est retardé, soit parce que le voleur est emprisonné jusqu'à ce que sa situation soit examinée ou qu'il s'enfuit et est ensuite attrapé, le retard du coupage de la main ne fait pas tomber de lui le hadd, qui était obligé pour lui le jour où il a volé même si ces marchandises deviennent bon marché après cela. Le délai n'oblige pas non plus à couper la main si ce n'était pas obligé le jour où il a pris ces marchandises, même si elles deviennent chères après cela.\" Malik m'a rapporté de Yahya ibn Said que Abu'd-Darda écrivit à Salman al-Farsi : \"Viens immédiatement à la terre sainte.\" Salman lui répondit par écrit : \"La terre ne rend personne saint. Les actes de l'homme le rendent saint. J'ai entendu que tu as été établi comme un docteur pour traiter et guérir les gens. Si tu es innocent, alors puisses-tu avoir le délice ! Si tu es un charlatan, alors prends garde de ne pas tuer un homme et entrer dans le Feu !\" Quand Abu'd-Darda jugeait entre deux hommes, et qu'ils se détournaient de lui pour partir, il les regardait et disait : \"Revenez à moi, et racontez-moi votre histoire encore. Un charlatan ! Par Allah !\" Yahya a dit qu'il a entendu Malik dire : \"Si quelqu'un utilise un esclave, sans la permission de son maître, dans quelque chose d'important pour lui, dont le semblable a un honoraire, il est responsable de ce qui arrive à l'esclave si quelque chose lui arrive. Si l'esclave est sauf et que son maître demande son salaire pour ce qu'il a fait, c'est le droit du maître. C'est ce qui est fait dans notre communauté.\" Yahya a dit qu'il a entendu Malik dire au sujet d'un esclave qui est en partie libre et en partie asservi : \"Sa propriété est suspendue dans sa main et il ne peut rien commencer avec elle. Il mange d'elle et s'habille d'une façon approuvée. S'il meurt, sa propriété appartient à celui envers qui il est en esclavage.\" Yahya a dit qu'il a entendu Malik dire : \"La manière de faire les choses dans notre communauté est qu'un parent peut demander des comptes à son enfant pour ce qu'il dépense pour lui depuis le jour où l'enfant a de la propriété, argent liquide ou marchandises, si le parent veut cela.\""
    },
    {
        "hadithnumber": 1464,
        "text": "Malik m'a rapporté de Nafi, de Abdullah ibn Umar que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Si un homme libère sa part d'un esclave et a assez d'argent pour couvrir le prix complet de l'esclave justement évalué pour lui, il doit racheter ses partenaires pour que l'esclave soit complètement libéré. S'il n'a pas l'argent, il le libère partiellement.\""
    },
    {
        "hadithnumber": 1465,
        "text": "Malik a dit : \"La manière de faire les choses généralement convenue parmi nous dans le cas d'un esclave dont le maître fait un legs pour libérer une partie de lui - un tiers, un quart, une moitié, ou n'importe quelle part après sa mort, est que seule la portion de lui est libérée que son maître a nommée. C'est parce que la libération de cette portion n'est obligée d'avoir lieu qu'après la mort du maître parce que le maître a l'option de retirer le legs aussi longtemps qu'il vit. Quand l'esclave est libéré de son maître, le maître est un testateur et le testateur n'a accès pour libérer que ce qu'il peut prendre de sa propriété, étant le tiers de la propriété qu'il est autorisé à léguer, et le reste de l'esclave n'est pas libre parce que la propriété de l'homme est sortie de ses mains. Comment le reste de l'esclave qui appartient à d'autres gens peut-il être libre quand ils n'ont pas initié la mise en liberté et ne l'ont pas confirmée et qu'ils n'ont pas le wala établi pour eux ? Seul le défunt pouvait faire cela. Il était celui qui l'avait libéré et celui pour qui le wala était confirmé. Cela ne doit pas être supporté par la propriété d'un autre à moins qu'il ne lègue dans le tiers de sa propriété ce qui reste d'un esclave à libérer. C'est une requête contre ses partenaires et les héritiers et les partenaires ne doivent pas refuser à l'esclave cela quand c'est dans le tiers de la propriété de l'homme mort parce qu'il n'y a pas de mal en cela pour les héritiers.\" Malik a dit : \"Si un homme libère un tiers de son esclave alors qu'il est gravement malade, il doit compléter l'émancipation pour que tout de lui soit libre de lui, si c'est dans le tiers de sa propriété auquel il a accès, parce qu'il n'est pas traité de la même manière qu'un homme qui libère un tiers d'un esclave après sa mort, parce que si celui qui a libéré un tiers de son esclave après sa mort avait vécu, il aurait pu l'annuler et la mise en liberté de l'esclave serait sans effet. Le maître qui a rendu la libération du tiers de l'esclave irrévocable dans sa maladie, aurait quand même à libérer tout de lui s'il vivait. S'il mourait, l'esclave serait mis en liberté dans le tiers du legs. C'est parce que le commandement du défunt est permis dans son tiers comme le commandement de celui en bonne santé est permis dans toute sa propriété.\" Malik a dit : \"Un maître qui libère un esclave à lui et règle son émancipation pour que son témoignage soit permis, son inviolabilité complète, et son droit d'hériter confirmé, ne peut pas lui imposer de stipulations comme ce qu'il impose à un esclave au sujet de la propriété ou du service, ni le faire faire quoi que ce soit de l'esclavage, parce que le Messager d'Allah, paix et bénédictions sur lui, a dit : 'Si un homme libère sa part d'un esclave et a assez d'argent pour couvrir le prix complet de l'esclave justement évalué pour lui, il doit donner à ses partenaires leurs parts pour que l'esclave soit complètement libre.' Malik a commenté : 'S'il possède l'esclave complètement, il est plus correct de le libérer complètement et de ne mêler aucun esclavage avec cela.' Malik m'a rapporté de Yahya ibn Said et quelqu'un d'autre, de al-Hasan ibn Abi al-Hasan al-Basri et de Muhammad ibn Sirin qu'un homme au temps du Messager d'Allah, paix et bénédictions sur lui, libéra six de ses esclaves alors qu'il mourait. Le Messager d'Allah, paix et bénédictions sur lui, tira au sort entre eux et libéra un tiers de ces esclaves. Malik ajouta qu'il avait entendu que l'homme n'avait pas d'autre propriété qu'eux.\""
    },
    {
        "hadithnumber": 1474,
        "text": "Malik m'a rapporté qu'il avait entendu que Abdullah ibn Umar fut interrogé si un esclave pouvait être acheté à la condition spécifique qu'il devait être utilisé pour remplir l'obligation de libérer un esclave, et il dit : \"Non.\" Malik a dit : \"C'est le meilleur de ce que j'ai entendu sur l'obligation de libérer des esclaves. Quelqu'un qui doit mettre un esclave en liberté à cause d'une obligation sur lui, ne peut pas en acheter un à la condition qu'il le mette en liberté parce que s'il fait cela, quoi qu'il achète n'est pas complètement un esclave parce qu'il a réduit son prix par la condition qu'il a faite de le mettre en liberté.\" Malik ajouta : \"Il n'y a pas de mal, cependant, à ce que quelqu'un achète une personne expressément pour la mettre en liberté.\" Malik a dit : \"Le meilleur de ce que j'ai entendu sur l'obligation de libérer des esclaves est qu'il n'est pas permis de libérer un chrétien ou un juif pour la remplir, et on ne libère pas un mukatab ou un mudabbar ou une umm walad ou un esclave à libérer après un certain nombre d'années, ou une personne aveugle. Il n'y a pas de mal à libérer un chrétien, un juif, ou un mage volontairement, parce qu'Allah, le Béni, l'Exalté, a dit dans Son Livre : 'soit comme une faveur alors, soit par rançon,' (Sura 47 ayat 4). La faveur est la mise en liberté.\" Malik a dit : \"Quant aux obligations de libérer des esclaves qu'Allah a mentionnées dans le Livre, on ne libère qu'un esclave mumin pour elles.\" Malik a dit : \"C'est comme cela en nourrissant les pauvres gens pour la kaffara. On ne doit nourrir que des musulmans et on ne nourrit personne en dehors du deen de l'Islam.\""
    },
    {
        "hadithnumber": 1476,
        "text": "Malik m'a rapporté que Yahya ibn Said a dit : \"Abd ar-Rahman ibn Abi Bakr mourut dans son sommeil, et A'isha, l'épouse du Prophète, paix et bénédictions sur lui, mit en liberté beaucoup d'esclaves pour lui.\" Malik a dit : \"C'est ce que j'aime le mieux de ce que j'ai entendu sur le sujet.\""
    },
    {
        "hadithnumber": 1478,
        "text": "Malik m'a rapporté de Nafi que Abdullah ibn Umar libéra un enfant illégitime et sa mère."
    }
]