[
    {
        "hadithnumber": 7,
        "text": "Yahya m'a rapporté de Malik, de son oncle Abu Suhayl, de son père, que Umar ibn al-Khattab a écrit à Abu Musa en lui disant de prier le dhuhr lorsque le soleil commençait à décliner, le asr lorsque le soleil était encore blanc pur avant qu'aucune jaunisse ne l'ait atteint, le maghrib lorsque le soleil s'était couché, et de retarder le isha tant qu'il ne dormait pas, et de prier le subh lorsque les étoiles étaient toutes visibles et comme une brume dans le ciel, et de lire dedans deux longues sourates du mufassal."
    },
    {
        "hadithnumber": 27,
        "text": "Yahya m'a rapporté de Malik, de Zayd ibn Aslam, de Ata ibn Yasar, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"La chaleur torride est une part du souffle de l'Enfer (Jahannam). Donc, quand la chaleur est féroce, retardez la prière jusqu'à ce qu'il fasse plus frais.\" Il ajouta en explication : \"Le Feu se plaignit à son Seigneur et dit : 'Mon Seigneur, une partie de moi en a consommé une autre', alors Il lui accorda deux souffles chaque année, un souffle en hiver et un souffle en été.\""
    },
    {
        "hadithnumber": 28,
        "text": "Malik nous a rapporté de Abdullah ibn Yazid, le mawla de al-Aswad ibn Sufyan, de Abu Salama ibn Abd ar-Rahman, de Muhammad ibn Abd ar-Rahman ibn Thawban, de Abu Hurayra, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Quand la chaleur est féroce, retardez la prière jusqu'à ce qu'il fasse plus frais, car la chaleur torride est une part du souffle de l'Enfer.\" Il ajouta : \"Le Feu se plaignit à son Seigneur, alors Il lui accorda deux souffles chaque année, un souffle en hiver et un souffle en été.\""
    },
    {
        "hadithnumber": 33,
        "text": "Yahya m'a rapporté de Malik, de Abu'z-Zinad, de al-Araj, de Abu Hurayra, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Quand vous faites vos ablutions (wudu), aspirez de l'eau dans votre nez et rejetez-la, et si vous utilisez des pierres pour nettoyer vos parties intimes, utilisez-en un nombre impair.\""
    },
    {
        "hadithnumber": 34,
        "text": "Yahya m'a rapporté de Ibn Shihab, de Abu Idris al-Khawlani, de Abu Hurayra, que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Celui qui fait ses ablutions doit aspirer de l'eau par son nez et la rejeter.\""
    },
    {
        "hadithnumber": 36,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Muhammad ibn Talha, de Uthman ibn Abd ar-Rahman, que son père lui a rapporté qu'il avait entendu que Umar ibn al-Khattab avait l'habitude de laver ce qui était sous son pagne avec de l'eau. Yahya a dit que l'on demanda à Malik ce qu'un homme devait faire si, en faisant ses ablutions, il oubliait et lavait son visage avant d'avoir rincé sa bouche, ou lavait ses avant-bras avant d'avoir lavé son visage. Il dit : \"Si quelqu'un lave son visage avant de rincer sa bouche, il doit rincer sa bouche et ne pas laver son visage à nouveau. Si quelqu'un lave ses avant-bras avant son visage, cependant, il doit laver ses avant-bras à nouveau pour les avoir lavés après son visage. Ceci s'il est encore près du lieu (des ablutions).\" Yahya a dit que l'on demanda à Malik ce qu'un homme devait faire s'il avait oublié de rincer sa bouche et son nez jusqu'à ce qu'il ait prié, et il dit : \"Il n'a pas à répéter la prière, mais doit rincer sa bouche et son nez s'il souhaite faire d'autres prières après cela.\""
    },
    {
        "hadithnumber": 38,
        "text": "Yahya m'a rapporté de Malik, de Zayd ibn Aslam, que Umar ibn al-Khattab a dit : \"Si tu t'endors allongé, tu dois faire les ablutions (avant de prier).\""
    },
    {
        "hadithnumber": 40,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Ibn Umar avait l'habitude de dormir assis et priait ensuite sans faire les ablutions."
    },
    {
        "hadithnumber": 47,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar prépara le corps de l'un des fils de Said ibn Zayd pour l'enterrement et le porta, puis entra dans la mosquée et pria sans faire les ablutions. Yahya a dit que l'on demanda à Malik s'il était nécessaire de faire les ablutions à cause de la régurgitation de nourriture non digérée et il dit : \"Non, les ablutions ne sont pas nécessaires, mais la bouche doit être rincée.\""
    },
    {
        "hadithnumber": 108,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, de son père, que A'isha, l'épouse du Prophète, paix et bénédictions sur lui, disait : \"Si tu as des rapports avec ta femme et que tu souhaites ensuite dormir avant de faire le ghusl, ne dors pas avant d'avoir fait les ablutions comme pour la prière.\""
    },
    {
        "hadithnumber": 109,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar, s'il souhaitait dormir ou manger en état de janaba (impureté majeure), lavait son visage et ses bras jusqu'aux coudes, et essuyait sa tête. Ensuite, il mangeait ou dormait."
    },
    {
        "hadithnumber": 115,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab, de Urwa ibn az-Zubayr, que Umm Sulaym a dit au Messager d'Allah, paix et bénédictions sur lui : \"Une femme doit-elle faire le ghusl lorsqu'elle vit la même chose qu'un homme dans son sommeil ?\" Le Messager d'Allah lui dit : \"Oui, elle doit faire le ghusl.\" A'isha lui dit : \"Honte à toi ! Une femme voit-elle cela ?\" (c'est-à-dire un liquide). Le Messager d'Allah, paix et bénédictions sur lui, lui dit : \"Que ta main droite soit pleine de poussière. D'où vient la ressemblance familiale ?\""
    },
    {
        "hadithnumber": 116,
        "text": "Yahya m'a rapporté de Malik, de Hisham ibn Urwa, de son père, de Zaynab bint Abi Salama, que Umm Salama, l'épouse du Prophète, paix et bénédictions sur lui, a dit : \"Umm Salama, l'épouse de Abu Talha al-Ansari, vint au Messager d'Allah, paix et bénédictions sur lui, et dit : 'Messager d'Allah ! Allah n'a pas honte de la vérité. Une femme doit-elle faire le ghusl si elle a fait un rêve érotique ?' Il dit : 'Oui, si elle voit un liquide.'\""
    },
    {
        "hadithnumber": 118,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar transpirait dans un vêtement alors qu'il était en état de janaba, puis priait avec ce vêtement."
    },
    {
        "hadithnumber": 124,
        "text": "Yahya m'a rapporté de Malik, de Zayd ibn Aslam, qu'un homme interrogea le Messager d'Allah, paix et bénédictions sur lui, en disant : \"Qu'est-ce qui m'est permis de ma femme lorsqu'elle a ses règles ?\" Le Messager d'Allah, paix et bénédictions sur lui, dit : \"Qu'elle enroule son pagne autour d'elle fermement, et ensuite ce qui est au-dessus de cela te concerne.\""
    },
    {
        "hadithnumber": 126,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Ubaydullah ibn Abdullah ibn Umar envoya une question à A'isha lui demandant : \"Un homme peut-il caresser sa femme lorsqu'elle a ses règles ?\" Elle répondit : \"Qu'elle enroule son pagne autour de sa partie inférieure et ensuite il peut la caresser s'il le souhaite.\""
    },
    {
        "hadithnumber": 129,
        "text": "Yahya m'a rapporté de Malik, de Abdullah ibn Abi Bakr, de sa tante paternelle, de la fille de Zayd ibn Thabit, qu'elle avait entendu que les femmes demandaient des lampes au milieu de la nuit pour vérifier leur pureté. Elle les critiquait pour cela en disant : \"Les femmes n'avaient jamais l'habitude de faire cela,\" c'est-à-dire à l'époque des compagnons. On demanda à Malik si une femme dont les règles étaient terminées pouvait faire le tayammum pour se purifier si elle ne trouvait pas d'eau, et il dit : \"Oui, car elle est comme quelqu'un en état d'impureté rituelle majeure, qui, s'il ne trouve pas d'eau, fait le tayammum.\""
    },
    {
        "hadithnumber": 130,
        "text": "Yahya m'a rapporté de Malik qu'il avait entendu que A'isha, l'épouse du Prophète, paix et bénédictions sur lui, disait qu'une femme enceinte qui remarquait un saignement s'abstenait de la prière."
    },
    {
        "hadithnumber": 131,
        "text": "Yahya m'a rapporté de Malik qu'il interrogea Ibn Shihab au sujet d'une femme enceinte qui remarquait un saignement. Ibn Shihab répondit : \"Elle s'abstient de la prière.\" Yahya a dit que Malik a dit : \"C'est ce qui se fait dans notre communauté.\""
    },
    {
        "hadithnumber": 164,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, de Sulayman ibn Yasar, que le Messager d'Allah, paix et bénédictions sur lui, levait ses mains pendant la prière."
    },
    {
        "hadithnumber": 168,
        "text": "Yahya m'a rapporté de Malik, de Abu Nuaym Wahb ibn Kaysan, que Jabir ibn Abdullah leur enseignait le takbir dans la prière. Abu Nuaym a dit : \"Il nous disait de dire 'Allah est le plus grand' chaque fois que nous nous abaissions ou nous relevions.\""
    },
    {
        "hadithnumber": 173,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar récitait dans les quatre rakas lorsqu'il priait seul - dans chaque raka la Mère du Coran (Al-Fatiha) et une autre sourate du Coran. Parfois il récitait deux ou trois sourates dans une seule raka dans la prière obligatoire. De même, il récitait la Mère du Coran et deux sourates dans les deux premières rakas du maghrib."
    },
    {
        "hadithnumber": 184,
        "text": "Yahya m'a rapporté de Malik, de Nafi, que Abdullah ibn Umar récitait les dix premières sourates du mufassal dans la prière du subh, et en voyage il récitait la Mère du Coran et une sourate dans chaque raka."
    },
    {
        "hadithnumber": 186,
        "text": "Yahya m'a rapporté de Malik, de Abu Nuaym Wahb ibn Kaysan, qu'il entendit Jabir ibn Abdullah dire : \"Celui qui prie une raka sans y réciter la Mère du Coran n'a pas accompli la prière, sauf derrière un imam.\""
    },
    {
        "hadithnumber": 189,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said et de Rabia ibn Abi Abd ar-Rahman, que al-Qasim ibn Muhammad récitait derrière l'imam lorsque l'imam ne récitait pas à voix haute."
    }
]