[
    {
        "hadithnumber": 1594,
        "text": "Yahya m'a rapporté de Malik qu'il a vu quiconque dont il était satisfait parmi les gens de science dire au sujet d'un homme qui voulait que son meurtrier soit pardonné quand il l'avait assassiné intentionnellement : \"Cela est permis pour lui. Il est plus en droit au sang de l'homme qu'aucun de ses proches après lui.\" Malik a dit au sujet d'un homme qui a pardonné le meurtre, après qu'il avait réclamé son droit et qu'il était obligé pour lui : \"Il n'y a pas de prix du sang contre le meurtrier à moins que celui qui le pardonne ne stipule cela quand il le pardonne.\" Malik a dit au sujet du meurtrier quand il a été pardonné : \"Il est fouetté cent coups et emprisonné pendant un an.\" Malik a dit : \"Quand un homme assassine intentionnellement et qu'il y a une preuve claire de cela, et que l'homme assassiné a des fils et des filles et que les fils pardonnent et que les filles refusent de pardonner, le pardon des fils est permis en opposition aux filles et il n'y a pas d'autorité pour les filles avec les fils en demandant le sang et en pardonnant.\""
    },
    {
        "hadithnumber": 1602,
        "text": "Malik m'a rapporté que Yahya ibn Said a dit : \"J'ai entendu Abu'l-Hubab Said ibn Yasar dire qu'il a entendu Abu Hurayra dire qu'il a entendu le Messager d'Allah, paix et bénédictions sur lui, dire : 'J'ai été ordonné vers une ville qui mangera les villes. Ils disaient, 'Yathrib,' mais c'est Médine. Elle enlève les mauvaises gens comme le fourneau du forgeron enlève les impuretés du fer.'\""
    },
    {
        "hadithnumber": 1603,
        "text": "Malik m'a rapporté de Hisham ibn Urwa, de son père que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Personne ne quitte Médine préférant vivre ailleurs, sans qu'Allah ne donne ce qui est meilleur que lui à sa place.\""
    },
    {
        "hadithnumber": 1604,
        "text": "Malik m'a rapporté de Hisham ibn Urwa, de son père, de Abdullah ibn az-Zubayr que Sufyan ibn Abi Zuhayr a dit : \"J'ai entendu le Messager d'Allah, paix et bénédictions sur lui, dire : 'Le Yémen sera conquis et les gens y seront attirés, prenant leurs familles et quiconque leur obéit. Médine aurait été mieux pour eux, s'ils avaient su. Le Sham sera conquis et les gens y seront attirés, prenant leurs familles et quiconque leur obéit. Médine aurait été mieux pour eux, s'ils avaient su. L'Irak sera conquis et les gens y seront attirés, prenant leurs familles et quiconque leur obéit. Médine aurait été mieux pour eux, s'ils avaient su.'\""
    },
    {
        "hadithnumber": 1605,
        "text": "Yahya m'a rapporté de Malik, de Ibn Himas, de son oncle paternel, de Abu Hurayra que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Médine sera laissée de la meilleure manière qu'elle est jusqu'à ce qu'un chien ou un loup y entre et urine sur l'un des piliers de la mosquée ou sur le minbar.\" Ils demandèrent : \"Messager d'Allah ! Qui aura les fruits à ce moment-là ?\" Il répondit : \"Les animaux cherchant de la nourriture, les oiseaux et les bêtes sauvages.\""
    },
    {
        "hadithnumber": 1610,
        "text": "Yahya m'a rapporté de Malik d'un homme qui a dit : \"Zayd ibn Thabit m'a rencontré alors que j'étais à al-Aswaf (aux abords de Médine). J'avais capturé un faucon. Il le prit de mes mains et le mit en liberté.\""
    },
    {
        "hadithnumber": 1612,
        "text": "Malik a dit que Yahya ibn Said lui avait rapporté que A'isha a dit que Amir ibn Fuhayra avait dit au temps de l'épidémie : \"J'ai vu la mort avant de la goûter, la destination du lâche est d'au-dessus de lui.\""
    },
    {
        "hadithnumber": 1615,
        "text": "Yahya m'a rapporté de Malik, de Ibn Shihab que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Deux deens ne coexisteront pas dans la Péninsule Arabique.\" Malik a dit que Ibn Shihab a dit : \"Umar ibn al-Khattab a cherché des informations à ce sujet jusqu'à ce qu'il soit absolument convaincu que le Messager d'Allah, paix et bénédictions sur lui, avait dit : 'Deux deens ne coexisteront pas dans la Péninsule Arabique,' et il a donc expulsé les juifs de Khaybar.\" Malik a dit : \"Umar ibn al-Khattab a expulsé les juifs de Najran (un établissement juif au Yémen) et Fadak (un établissement juif à trente miles de Médine). Quand les juifs de Khaybar sont partis, ils n'ont pris aucun fruit ou terre. Les juifs de Fadak ont pris la moitié des fruits et la moitié de la terre, parce que le Messager d'Allah, paix et bénédictions sur lui, avait fait un arrangement avec eux pour cela. Donc Umar leur a confié la valeur en or, argent, chameaux, cordes et sacs de selle de la moitié des fruits et la moitié de la terre, et leur a remis la valeur et les a expulsés.\""
    },
    {
        "hadithnumber": 1617,
        "text": "Yahya m'a rapporté de Malik, de Yahya ibn Said, de Abd ar-Rahman ibn al-Qasim que Aslam, le mawla de Umar ibn al-Khattab l'a informé qu'il avait visité Abdullah ibn Ayyash al-Makhzumi. Il vit qu'il avait du nabidh avec lui et il était à ce moment en route pour La Mecque. Aslam lui dit : \"Umar ibn al-Khattab aime cette boisson.\" Abdullah ibn Ayyash porta donc un grand bol à boire et l'apporta à Umar ibn al-Khattab et le plaça devant lui. Umar l'approcha de lui et leva ensuite la tête. Umar dit : \"Cette boisson est bonne,\" alors il en but un peu et le passa ensuite à un homme à sa droite. Quand Abdullah se tourna pour partir, Umar ibn al-Khattab l'appela et demanda : \"Es-tu la personne qui dit que La Mecque est mieux que Médine ?\" Abdullah dit : \"J'ai dit que c'était le Haram d'Allah, et Son lieu de sécurité, et Sa Maison était en elle.\" Umar dit : \"Je ne dis rien au sujet de la Maison d'Allah ou de Son Haram.\" Ensuite Umar répéta : \"Es-tu la personne qui dit que La Mecque est mieux que Médine ?\" Il répondit : \"J'ai dit que c'était le Haram d'Allah et Son lieu de sécurité, et Sa Maison était en elle.\" Umar dit : \"Je ne dis rien au sujet de la Maison d'Allah et de Son Haram.\" Ensuite Abdullah partit."
    },
    {
        "hadithnumber": 1622,
        "text": "Yahya m'a rapporté que Malik a dit : \"J'ai entendu que Umar ibn al-Khattab a dit : 'Une nuit à Rukba (une vallée près de Taif,) est plus préférable pour moi que dix nuits au Sham.' \" Malik a dit : \"Il voulait dire pour allonger et préserver leurs vies à cause de la sévérité de la peste au Sham.\""
    },
    {
        "hadithnumber": 1654,
        "text": "Yahya m'a rapporté de Malik de Nafi que Abdullah ibn Umar portait des vêtements teints avec de la terre rouge et teints avec du safran."
    },
    {
        "hadithnumber": 1664,
        "text": "Yahya m'a rapporté de Malik, de Abu Bakr ibn Nafi, de son père Nafi, le mawla de Ibn Umar que Safiyya bint Abi Ubayd l'a informé que Umm Salama, l'épouse du Prophète, paix et bénédictions sur lui, a dit que quand le vêtement inférieur des femmes fut mentionné au Messager d'Allah, il dit : \"Elle le laisse descendre d'un empan.\" Umm Salama dit : \"Si cela la laisse découverte ?\" Il dit : \"Alors la longueur d'un avant-bras et qu'elle ne l'augmente pas.\""
    },
    {
        "hadithnumber": 1665,
        "text": "Yahya m'a rapporté de Malik de Abu'z-Zinad de al-Araj de Abu Hurayra que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Ne portez pas une seule sandale. Portez les deux ou allez avec les deux pieds nus.\""
    },
    {
        "hadithnumber": 1700,
        "text": "Yahya m'a rapporté de Malik de Ishaq ibn Abdullah ibn Abi Talha que Anas ibn Malik a dit : \"J'ai vu Umar ibn al-Khattab quand il était amir al-muminin se voir donner un sa de dattes, et il les mangea toutes, même les inférieures.\""
    },
    {
        "hadithnumber": 1727,
        "text": "Malik m'a rapporté de Nafi, de Ibn Umar que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"La fièvre est de la véhémence de la chaleur de Jahannam, alors éteignez-la avec de l'eau.\""
    },
    {
        "hadithnumber": 1753,
        "text": "Yahya m'a rapporté de Malik, de Musa ibn Maysara, de Said ibn Abi Hind, de Abu Musa al-Ashari que le Messager d'Allah, paix et bénédictions sur lui, a dit : \"Quiconque joue aux jeux de dés a désobéi à Allah et Son Messager.\""
    },
    {
        "hadithnumber": 1764,
        "text": "Malik m'a rapporté d'une source fiable à lui de Bukayr ibn Abdullah ibn al-Ashajj de Basr ibn Said de Abu Said al-Khudri que Abu Musa al-Ashari a dit : \"Le Messager d'Allah, paix et bénédictions sur lui, a dit : 'On demande la permission trois fois. Si on vous donne la permission, alors entrez. Si non, allez-vous-en.'\""
    },
    {
        "hadithnumber": 1765,
        "text": "Malik m'a rapporté de Rabia ibn Abi Abd ar-Rahman d'un autre des oulémas de ce temps que Abu Musa al-Ashari vint et demanda la permission à Umar ibn al-Khattab d'entrer. Il demanda la permission trois fois, et ensuite s'en alla. Umar ibn al-Khattab envoya après lui et dit : \"Quel est ton problème ? Pourquoi n'es-tu pas entré ?\" Abu Musa dit : \"J'ai entendu le Messager d'Allah, paix et bénédictions sur lui, dire : 'Demandez la permission d'entrer trois fois. Si on vous donne la permission, alors entrez. Si non, allez-vous-en.' \" Umar dit : \"Qui peut confirmer cela ? Si tu ne m'amènes pas quelqu'un pour le confirmer, je te ferai telle et telle chose.\" Abu Musa sortit jusqu'à ce qu'il vienne à une assemblée dans la mosquée qui était appelée le Majlis-al-Ansar. Il dit : \"J'ai dit à Umar ibn al-Khattab que j'ai entendu le Messager d'Allah, paix et bénédictions sur lui, dire : 'Demandez la permission trois fois. Si on vous donne la permission, alors entrez. Si non, allez-vous-en.' Umar a dit : 'Si tu ne m'amènes pas quelqu'un qui peut le confirmer, je te ferai telle et telle chose'. Si l'un de vous a entendu cela, qu'il vienne avec moi.' \" Ils dirent à Abu Said al-Khudri : \"Va avec lui\". Abu Said était le plus jeune d'entre eux. Il alla avec lui et parla à Umar ibn al-Khattab de cela. Umar ibn al-Khattab dit à Abu Musa : \"Je ne te soupçonnais pas, mais je craignais que les gens ne forgent des paroles du Messager d'Allah, paix et bénédictions sur lui.\""
    }
]